Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Our ``bauble.test.BaubleTestCase`` objects use handlers of the class ``bauble.test.MockLoggingHandler``. Every time an individual unit test is started, the ``setUp`` method will create a new ``handler`` and associate it to the root logger. The ``tearDown`` method takes care of removing it.
es: Nuestros objetos de ``bauble.test.BaubleTestCase`` utilizan handler de la clase ``bauble.test.MockLoggingHandler``. Cada vez que se inicia una prueba unitaria, el método ``setUp`` crea un nuevo ``handler`` y lo asocia al logger root. El método de ``teardDown`` se encarga de eliminarlo.
it: I nostri oggetti di ``bauble.test.BaubleTestCase`` utilizzano ``handler`` della classe ``bauble.test.MockLoggingHandler``. Ogni volta che viene avviato un singolo unit test, il metodo ``setUp`` creerà un nuovo ``handler`` e lo associa al logger radice. Il metodo ``tearDown`` si prende cura di rimuoverlo.
ko: 우리의``bauble.test.BaubleTestCase ''객체는``bauble.test.MockLoggingHandler`` 클래스의 핸들러를 사용합니다. 개별 단위 테스트가 시작될 때마다``setUp ''메소드는 새로운``핸들러 ''를 생성하고이를 루트 로거에 연결합니다. ``tearDown ''메소드가이를 제거합니다.
uk: Наші об'єкти ``bauble.test.BaubleTestCase`` використовують обробники класу ``bauble.test.MockLoggingHandler``. Кожен раз, коли починається індивідуальне тестування, метод ``setUp`` створить новий ``handler`` І пов'язати його з кореневим реєстратором. Метод ``tearDown`` дбає про його видалення.

source: You can check for presence of specific logging messages in ``self.handler.messages``. ``messages`` is a dictionary, initially empty, with two levels of indexation. First the name of the logger issuing the logging record, then the name of the level of the logging record. Keys are created when needed. Values hold lists of messages, formatted according to whatever formatter you associate to the handler, defaulting to ``logging.Formatter("%(message)s")``.
es: Se puede comprobar la presencia de mensajes de registro específicos en ``self.handler.messages``. ``mensajes`` es un diccionario, inicialmente vacío, con dos niveles de indexación. Primero el nombre del registrador añadiendo al registro, luego el nombre del nivel del mensaje de registro. Las claves son producidas al necesitarse. Los valores en el diccionario son listas de mensajes, con formato según el formateador asociado al controlador, por defecto ``logging.Formatter("%(message)s")``.
it: È possibile controllare per la presenza di messaggi di registrazione specifici in ``self.handler.messages``. ``messages`` è un dizionario, inizialmente vuoto, con due livelli di indicizzazione. Prima il nome del logger che rilascia la registrazione, quindi il nome del livello del record di registrazione. Le chiavi vengono create quando necessario. I valori contengono elenchi di messaggi formattati secondo qualsiasi formattatore si associa al gestore, per difetto ``logging.Formatter("%(message)s")``.
ko: ``self.handler.messages``에서 특정 로깅 메시지의 존재 여부를 확인할 수 있습니다. ``messages``는 두 가지 수준의 인덱싱이있는 사전이며 처음에는 비어 있습니다. 먼저 로깅 레코드를 발행하는 로거의 이름, 그 다음 로깅 레코드의 레벨 이름입니다. 필요한 경우 키가 생성됩니다. 값은 핸들러에 연결하는 포맷터에 따라 형식이 지정된 메시지 목록을 보유하며 기본값은``logging.Formatter ( "% (message) s")``입니다.
uk: Ви можете перевірити присутність конкретних повідомлень журналу в `` self.handler.messages``. `` Messages`` - словник, спочатку порожній, з двома рівнями індексації. По-перше, ім'я реєстратора, який видає журнал реєстрації, потім ім'я рівня запису журналу. Ключі створюються, коли це необхідно. Значення містить списки повідомлень, відформатовані за будь-яким форматом, який ви зв'язуєте з обробником, за умовчанням для ``logging.Formatter ("%(message)s")``.

source: You can explicitly empty the collected messages by invoking ``self.handler.clear()``.
es: Al necesitarlo, puede borrar los mensajes colectados mediante la invocación de ``self.handler.clear()``.
it: È possibile svuotare in modo esplicito i messaggi raccolti richiamando ``self.handler.clear()``.
ko: ``self.handler.clear ()``를 호출하여 수집 된 메시지를 명시 적으로 비울 수 있습니다.
uk: Ви можете явним чином порожнім зібраним повідомленням викликати ``self.handler.clear()``.

source: Putting all together
es: Al ponerlo todo junto
it: Coordinamento
ko: 모두 합치기
uk: Введення всіх разом

source: From time to time you want to activate the test class you're working at::
es: De vez en cuando usted quiere activar la clase de prueba trabaja en::
it: Di volta in volta si desidera attivare la classe di test che sta lavorando a::
ko: 때때로 작업중인 테스트 클래스를 활성화하고 싶습니다::
uk: Час від часу ви хочете активізувати тестовий клас, з яким ви працюєте::

source: And at the end of the process you want to update the statistics::
es: Y al final del proceso que desea actualizar las estadísticas de::
it: E alla fine del processo si desidera aggiornare le statistiche::
ko: 프로세스가 끝나면 통계를 업데이트 할 수 있습니다::
uk: І в кінці процесу ви хочете оновити статистику::

source: Structure of user interface
es: Estructura de interfaz de usuario
it: Struttura dell'interfaccia utente
ko: 사용자 인터페이스 구조
uk: Структура користувацького інтерфейсу

source: The user interface is built according to the **Model** — **View** — **Presenter** architectural pattern. For much of the interface, **Model** is a SQLAlchemy database object, but we also have interface elements where there is no corresponding database model. In general:
es: La interfaz de usuario se construye según el ** modelo ** — ** vista **-** presentador ** patrón arquitectónico. Gran parte de la interfaz, ** modelo ** es un objeto de base de datos de SQLAlchemy, pero también tenemos elementos de la interfaz donde existe un modelo de base de datos correspondiente. En general:
it: L'interfaccia utente è costruita secondo la **modello** — **vista** — **Presenter** modello architettonico. Per gran parte dell'interfaccia, **modello** è un oggetto di database di SQLAlchemy, ma ci sono anche gli elementi dell'interfaccia dove non esiste un corrispondente modello di database. In generale:
ko: 사용자 인터페이스는 ** 모델 ** — **보기 ** — ** 발표자 ** 아키텍처 패턴에 따라 구축됩니다. 대부분의 인터페이스에서 ** Model **은 SQLAlchemy 데이터베이스 개체이지만 해당 데이터베이스 모델이없는 인터페이스 요소도 있습니다. 일반적으로 :
uk: Інтерфейс користувача побудований відповідно до архітектурного шаблону **Model** — **View** — **Presenter**. Для більшості інтерфейсів **Model** є об'єктом бази даних SQLAlchemy, але у нас також є елементи інтерфейсу, де немає відповідної моделі бази даних. В загальному:

source: The **View** is described as part of a **glade** file. This should include the signal-callback and ListStore-TreeView associations. Just reuse the base class ``GenericEditorView`` defined in ``bauble.editor``. When you create your instance of this generic class, pass it the **glade** file name and the root widget name, then hand this instance over to the **presenter** constructor.
es: El ** ver ** se describe como parte de un ** claro ** archivo. Esto debe incluir la señal de llamada y ListStore TreeView asociaciones. A reutilizar la clase base que define '' GenericEditorView'' en '' bauble.editor''. Cuando se crea una instancia de esta clase genérica, pasarlo el ** claro ** nombre del archivo y el nombre del widget de raíz, luego entregar esta instancia a la ** presentador ** constructor.
it: Il **vista** è descritto come parte di un file **glade**. Ciò dovrebbe includere il segnale-callback e associazioni ListStore-TreeView. Basta utilizzare la classe base ``GenericEditorView`` definito in ``bauble.editor``. Quando si crea l'istanza di questa classe generica, passarlo il **glade** nome del file e il nome del widget di radice, quindi consegnare questa istanza per il **presentatore** costruttore.
ko: **보기 **는 ** glade ** 파일의 일부로 설명됩니다. 여기에는 신호 콜백 및 ListStore-TreeView 연결이 포함되어야합니다. ``bauble.editor``에 정의 된 기본 클래스``GenericEditorView ''를 재사용하면됩니다. 이 일반 클래스의 인스턴스를 만들 때 ** glade ** 파일 이름과 루트 위젯 이름을 전달한 다음이 인스턴스를 ** presenter ** 생성자에게 넘깁니다.
uk: **View** описується як частина файлу **glade**. Це повинно включати асоціації зворотного виклику сигналу та ListStore-TreeView. Просто повторно використовуйте базовий клас ``GenericEditorView``, визначений у ``bauble.editor``. Коли ви створюєте екземпляр цього загальнодоступного класу, передайте його назву файлу **glade** та ім'я root-віджет, а потім передайте цей екземпляр класу конструктору **presenter**.

source: In the glade file, in the ``action-widgets`` section closing your GtkDialog object description, make sure every ``action-widget`` element has a valid ``response`` value. Use `valid GtkResponseType values <http://gtk.php.net/manual/en/html/gtk/gtk.enum.responsetype.html>`_, for example:
es: En el archivo glade, en la sección de ``action-widgets`` que cierra la descripción del objeto GtkDialog, asegúrese de que cada elemento ``action-widget`` tenga un valor ``response`` válido Use `los valores válidos de GtkResponseType <http://gtk.php.net/manual/en/html/gtk/gtk.enum.responsetype.html>`_, por ejemplo:
it: Nel file glade, nella sezione ``action-widget`` chiusura tua descrizione oggetto GtkDialog, assicurarsi che ogni elemento di ``action-widget`` ha un valore valido ``response``. Utilizza `valori validi GtkResponseType <http://gtk.php.net/manual/en/html/gtk/gtk.enum.responsetype.html>`_, ad esempio:
ko: glade 파일의``action-widgets ''섹션에서 GtkDialog 객체 설명을 닫고 모든``action-widget ''요소에 유효한``response ''값이 있는지 확인합니다. `유효한 GtkResponseType 값 <http://gtk.php.net/manual/en/html/gtk/gtk.enum.responsetype.html>`_을 사용합니다. 예를 들면 다음과 같습니다:
uk: У файлі поля, у розділі ``action-widgets``, що закриває опис об'єкта GtkDialog, переконайтеся, що кожен елемент ``action-widget`` має дійсне ``response`` значення. Використовуйте `дійсні значення GtkResponseType <http://gtk.php.net/manual/en/html/gtk/gtk.enum.responsetype.html>`_, наприклад:

source: There is no easy way to unit test a subclassed view, so please don't subclass views, there's really no need to.
es: No hay manera fácil de escribir pruebas unitarias para una subclase de una vista, así que por favor no subclasen vistas, no hay realmente ninguna necesidad.
it: Non c'è un modo facile per scrivere prove unitarie per una sottoclasse vista, cui si prega non derivare viste, davvero non ce n'è alcun bisogno.
ko: 하위 클래스 뷰를 단위 테스트하는 쉬운 방법이 없으므로 뷰를 하위 클래스로 만들지 마십시오. 실제로 그럴 필요가 없습니다.
uk: Існує непростий спосіб об'єднати тестування представленням підкласу, тому, будь ласка, не переглядайте підклас, там насправді немає потреби.

source: In the glade file, every input widget should define which handler is activated on which signal. The generic Presenter class offers generic callbacks which cover the most common cases.
es: En el archivo de glade, cada widget de entrada debe definir qué controlador se activa en que señal. La clase genérica de presentador ofrece llamadas genéricas que cubren los casos más comunes.
it: Nel file glade, ogni widget input deve definire quale gestore viene attivato il segnale. La classe generica di Presenter offre callback generici che coprono il maggior parte dei casi.
ko: glade 파일에서 모든 입력 위젯은 어떤 신호에서 어떤 핸들러가 활성화되는지 정의해야합니다. 일반 Presenter 클래스는 가장 일반적인 경우를 다루는 일반 콜백을 제공합니다.
uk: У файлі поля, кожен вхідний віджет повинен визначити, який обробник активується на який сигнал. Загальний клас Presenter пропонує загальні зворотні виклики, які охоплюють найбільш поширені випадки.

source: GtkEntry (one-line text entry) will handle the ``changed`` signal, with either ``on_text_entry_changed`` or ``on_unique_text_entry_changed``.
es: GtkEntry (entrada de texto de línea singola) encargará de la señal de ``changed``, con ``on_text_entry_changed`` o ``on_unique_text_entry_changed``.
it: GtkEntry (voce di testo a riga singola) gestirà il segnale ``changed``, con ``on_text_entry_changed`` o ``on_unique_text_entry_changed``.
ko: GtkEntry (한 줄 텍스트 항목)는``on_text_entry_changed ''또는``on_unique_text_entry_changed``와 함께``changed ''신호를 처리합니다.
uk: GtkEntry (однорядкове введення) буде обробляти сигнал ``changed``, з будь-яким ``on_text_entry_changed`` або ``on_unique_text_entry_changed``.

source: GtkTextView: associate it to a GtkTextBuffer. To handle the ``changed`` signal on the GtkTextBuffer, we have to define a handler which invokes the generic ``on_textbuffer_changed``, the only role for this function is to pass our generic handler the name of the model attribute that receives the change. This is a workaroud for an `unresolved bug in GTK <http://stackoverflow.com/questions/32106765/>`_.
es: GtkTextView: asociarlo a un GtkTextBuffer. Para manejar la señal ``changed`` en la GtkTextBuffer, tenemos que definir un manejador que invoca el genérico ``on_textbuffer_changed``, el único papel para esta función consiste en pasar a nuestro controlador genérico el nombre del atributo modelo que recibe el cambio. Este es un workaroud para un `bug sin resolver en GTK <http: stackoverflow.com/questions/32106765/>`_.
it: GtkTextView: associarla a un GtkTextBuffer. Per gestire il segnale ``changed`` sulla GtkTextBuffer, dobbiamo definire un gestore che richiama il generico ``on_textbuffer_changed``, l'unico ruolo per questa funzione è quello di passare il nostro gestore generico il nome dell'attributo modello che riceve il cambiamento. Si tratta di un workaroud per un `bug irrisolto in GTK <http://stackoverflow.com/questions/32106765/>`_.
ko: GtkTextView : GtkTextBuffer에 연결합니다. GtkTextBuffer에서``changed ''신호를 처리하려면 일반``on_textbuffer_changed``를 호출하는 핸들러를 정의해야합니다.이 함수의 유일한 역할은 일반 핸들러에 수신되는 모델 속성의 이름을 전달하는 것입니다. 변화. 이것은 GTK <http://stackoverflow.com/questions/32106765/>`_의 해결되지 않은 버그에 대한 해결 방법입니다.
uk: GtkTextView: пов'язати його з GtkTextBuffer. Для обробки сигналу ``changed`` на GtkTextBuffer, ми повинні визначити обробник, який викликає загальний ``on_textbuffer_changed``, єдина роль для цієї функції полягає в тому, щоб передати нашому загальному обробнику ім'я атрибуту моделі, який отримує зміну. Це робочий апарат для `невирішеної помилки в GTK <http://stackoverflow.com/questions/32106765/>`_.

source: GtkComboBox with translated texts can't be easily handled from the glade file, so we don't even try. Use the ``init_translatable_combo`` method of the generic ``GenericEditorView`` class, but please invoke it from the **presenter**.
es: GtkComboBox con textos traducidos no se pueden gestionar fácilmente desde el archivo de glade, por lo que aún no tratamos. Utilice el método de '' init_translatable_combo'' de la clase genérica de '' GenericEditorView'', pero por favor invocarlo desde el ** presentador **.
it: GtkComboBox con testi tradotti non può essere facilmente gestito dal file glade, così non ci proviamo. Utilizzare il metodo ``init_translatable_combo`` della classe ``GenericEditorView`` generica, ma si prega di richiamarlo dal **presentatore**.
ko: 번역 된 텍스트가있는 GtkComboBox는 glade 파일에서 쉽게 처리 할 수 없으므로 시도조차하지 않습니다. 일반``GenericEditorView ''클래스의``init_translatable_combo ''메소드를 사용하되 ** presenter **에서 호출하십시오.
uk: GtkComboBox з перекладеними текстами не може бути легко оброблено з glade файлу, тому ми навіть не намагаємося. Використовуйте метод ``init_translatable_combo`` загального класу ``GenericEditorView``, але будь ласка, введіть його з **presenter **.

source: The **Model** is just an object with known attributes. In this interaction, the **model** is just a passive data container, it does nothing more than to let the **presenter** modify it.
es: El **modelo** es solo un objeto con atributos conocidos. En esta interacción, el **modelo** es solo un contenedor de datos pasiva, no hace nada más que para que el **presentador** modificarlo.
it: Il **modello** è solo un oggetto con attributi noti. In questa interazione, la **modello** è solo un contenitore di dati passiva, che non si fa nulla di più che lasciare che la **presentatore** modificarlo.
ko: ** 모델 **은 알려진 속성을 가진 개체입니다. 이 상호 작용에서 ** 모델 **은 단지 수동적 인 데이터 컨테이너 일 뿐이며 ** 발표자 **가 수정하도록하는 것 이상을 수행하지 않습니다.
uk: **Model** - це лише об'єкт з відомими атрибутами. У цій взаємодії **model** є просто пасивним контейнером даних, це не більше, ніж дозволити **presenter** змінити це.

source: The subclassed **Presenter** defines and implements:
es: El que se crean subclases **presentador** define e implementa:
it: La sottoclasse **Presenter** definisce e implementa:
ko: 서브 클래 싱 된 ** Presenter **는 다음을 정의하고 구현합니다:
uk: Підклас **Presenter** визначає та реалізує:

source: ``widget_to_field_map``, a dictionary associating widget names to name of model attributes,
es: ``widget_to_field_map``, un diccionario de asociar nombres de widget a nombre de los atributos del modelo,
it: 'widget_to_field_map ', un dizionario associando i nomi widget a nome degli attributi di modello,
ko: ``widget_to_field_map '', 위젯 이름을 모델 속성 이름에 연결하는 사전,
uk: ``widget_to_field_map``, словник, що пов'язує імена віджетів з назвою атрибутів моделі,

source: ``view_accept_buttons``, the list of widget names which, if activated by the user, mean that the view should be closed,
es: ``view_accept_buttons``, la lista de nombres de widget que, activado por el usuario, significa que el punto de vista debe ser cerrado,
it: 'view_accept_buttons ', l'elenco dei nomi di widget che, se attivato dall'utente, significa che la vista deve essere chiusa,
ko: ``view_accept_buttons``, 사용자가 활성화하면 뷰를 닫아야 함을 의미하는 위젯 이름 목록,
uk: ``view_accept_buttons``, список імен віджетів, які, якщо вони активуються користувачем, означають, що вигляд повинен бути закритий,

source: all needed callbacks,
es: todos los callbacks, necesarios
it: tutti gli accessori necessari i callback,
ko: 필요한 모든 콜백,
uk: всі необхідні зворотні виклики,

source: optionally, it plays the **model** role, too.
es: Opcionalmente, juega el ** modelo ** papel, demasiado.
it: Facoltativamente, essa svolge la **modello** ruolo, troppo.
ko: 선택적으로 ** 모델 ** 역할도 수행합니다.
uk: за бажанням, це також відтворює **model**.

source: The **presenter** continuously updates the **model** according to changes in the **view**. If the **model** corresponds to a database object, the **presenter** commits all **model** updates to the database when the **view** is closed successfully, or rolls them back if the **view** is canceled. (this behaviour is influenced by the parameter ``do_commit``)
es: El **presentador** actualiza continuamente el **modelo** según los cambios en la **vista**. Si el **modelo** corresponde a un objeto de base de datos, el **presentador** entrega todas actualizaciones en el **modelo** a la base de datos cuando la **vista** se cierra con éxito, o los deshace si la **vista** se cancela. (este comportamiento es influenciado por el parámetro ``do_commit``)
it: Il **presentatore** aggiorna continuamente il **modello** in base alle modifiche nella **vista**. Se la **modello** corrisponde a un oggetto di database, la **presentatore** impegna tutti **modello** aggiornamenti al database quando il **vista** è chiuso correttamente, o il rollback se la **vista** viene annullata. (questo comportamento è influenzato dal parametro ``do_commit``)
ko: ** 발표자 **는 **보기 **의 변경 사항에 따라 ** 모델 **을 지속적으로 업데이트합니다. ** 모델 **이 데이터베이스 개체에 해당하는 경우 ** 발표자 **는 **보기 **가 성공적으로 닫힐 때 모든 ** 모델 ** 업데이트를 데이터베이스에 커밋하거나 **보기 **가 ** 취소됩니다. (이 동작은``do_commit ''매개 변수의 영향을받습니다)
uk: **presenter** постійно оновлює **model** відповідно до змін у **view**. Якщо **model** відповідає об'єкту бази даних, **presenter** зобов'язує всі **model** оновити базу даних, коли **view** успішно закрито або повертається назад, якщо **view** скасовано (ця поведінку залежить від параметра ``do_commit``)

source: If the **model** is something else, then the **presenter** will do something else.
es: Si el ** modelo ** es otra cosa, entonces el ** presentador ** hará algo más.
it: Se il **modello** è un'altra cosa, il **presentatore** farà qualcos'altro.
ko: ** 모델 **이 다른 경우 ** 발표자 **가 다른 작업을 수행합니다.
uk: Якщо **model** є чимось іншим, то **presenter** зробить щось інше.

source: A well behaved **presenter** uses the **view** api to query the values inserted by the user or to forcibly set widget statuses. Please do not learn from the practice of our misbehaving presenters, some of which directly handle fields of ``view.widgets``. By doing so, these presenters prevents us from writing unit tests.
es: Un buen comportamiento ** presentador ** utiliza la ** vista ** api para consultar los valores insertados por el usuario o por la fuerza a establecer Estados de widget. Por favor, no se aprende de la práctica de nuestros presentadores portando mal, algunos que manejar directamente campos de ``view.widgets``. Al hacerlo, estos presentadores nos impide escribir pruebas unitarias.
it: Un **presentatore** ben educato utilizza la API della **vista** per interrogare i valori inseriti dall'utente o per impostare lo stato dei widget. Per favore non imparare dalla pratica dei nostri presentatori anomali, alcuni dei quali direttamente gestire campi di ``view.widgets``. Così facendo, questi presentatori ci impedisce di scrivere unit test.
ko: 잘 작동하는 ** 발표자 **는 ** view ** API를 사용하여 사용자가 삽입 한 값을 쿼리하거나 위젯 상태를 강제로 설정합니다. 일부는``view.widgets`` 필드를 직접 처리하는 오작동하는 발표자의 관행에서 배우지 마십시오. 그렇게함으로써 이러한 발표자는 우리가 단위 테스트를 작성하지 못하게합니다.
uk: Хороша поведінка **presenter** використовує **view** api, щоб запитати значення, вставлені користувачем, або насильно встановити статуси віджетів. Будь ласка, не використовуйте практики наших невірних ведучих, деякі з яких безпосередньо обробляють поля 'view.widgets'. Таким чином, ведучі перешкоджають нам створити одиничні тести.

source: The base class for the presenter, ``GenericEditorPresenter`` defined in ``bauble.editor``, implements many useful generic callbacks. There is a ``MockView`` class, that you can use when writing tests for your presenters.
es: La clase base para el presentador, ``GenericEditorPresenter`` en ``bauble.editor``, implementa muchas devoluciones de llamada genéricos útiles. Hay una clase de ``MockView``, que se puede utilizar al escribir pruebas para sus presentadores.
it: La classe base per il presentatore, ``GenericEditorPresenter`` definito in ``bauble.editor``, implementa molte utili callback generici. C'è una classe di ``MockView``, che è possibile utilizzare durante la scrittura di test per il tuo presentatori.
ko: 발표자의 기본 클래스 인``bauble.editor``에 정의 된``Generic Editor Presenter``는 많은 유용한 일반 콜백을 구현합니다. 발표자를위한 테스트를 작성할 때 사용할 수 있는``MockView ''클래스가 있습니다.
uk: Базовий клас для ведучого, ``GenericEditorPresenter``, визначений у ``bauble.editor``, реалізує багато корисних загальних зворотних викликів. Існує клас ``MockView``, який ви можете використовувати при написанні тестів для своїх ведучих.

source: Examples
es: Ejemplos
it: Esempi
ko: 예
uk: Приклади

source: ``Contact`` and ``ContactPresenter`` are implemented following the above lines. The view is defined in the ``contact.glade`` file.
es: ``Contact`` y ``ContactPresenter`` se implementan siguiendo las líneas de arriba. La vista se define en el archivo ``contact.glade``.
it: ``Contact`` e ``ContactPresenter`` sono implementati seguendo le linee di cui sopra. La visualizzazione è definita nel file ``contact.glade``.
ko: ``Contact ''및``ContactPresenter``는 위의 줄에 따라 구현됩니다. 보기는``contact.glade`` 파일에 정의되어 있습니다.
uk: ``Contact`` та ``ContactPresenter`` реалізуються за наведеними вище рядками. Вид визначається у файлі ``contact.glade``.

source: A good example of Presenter/View pattern (no model) is given by the connection manager.
es: Un buen ejemplo de patrón de vista/presentador (no modelo) está dada por el administrador de conexiones.
it: Un buon esempio di modello di visualizzazione/relatore (nessun modello) è dato dalla gestione connessione.
ko: 발표자 /보기 패턴 (모델 없음)의 좋은 예는 연결 관리자에 의해 제공됩니다.
uk: Хорошим приклад шаблону Presenter/View (без model) надає менеджер з'єднань.
