Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: You may note uncertainty in identification by adding an identification qualifier, at the proper rank, so you can for example have a plant initially identified as *Iris* cf. *florentina* by choosing *Iris florentina* in the taxon name, identification qualifier 'cf.', qualified rank 'species'.
es: Puede exprimir incertidumbre en la identificación mediante la adición de un calificador de identificación, al rango adecuado, para que puedas tener por ejemplo una planta inicialmente identificada como *Iris* cf. *florentina* eligiendo *Iris florentina* en el nombre del taxón, calificador de la identificación 'cf.', aplicándose al rango especie.
it: Si può segnalare l'incertezza nell'identificazione con l'aggiunta di un qualificatore di identificazione, al rango corrispondente, così è possibile ad esempio avere una pianta inizialmente identificata come *Iris* cf *florentina* selezionando *Iris florentina* come specie, e porre come qualificatore di identificazione 'cf', essendo la 'specie' il rango così qualificato.
ko: 식별 한정자를 적절한 순위에서 추가하여 식별의 불확실성을 확인할 수 있으므로, 예를 들어 분류 이름인 식별 한정자 'cf.'에서 *Iris florentina*를 선택하여 *Iris* cf. *forentina*로 처음 식별된 식물을 지정할 수 있다.
uk: Ви можете відзначати невизначеність у ідентифікації, додавши класифікатор ідентифікації у відповідному ранзі, так що ви можете, наприклад, мати рослину, яка спочатку ідентифікувалась, як * Iris * cf. *florentina* вибравши *Iris florentina* в імені таксона, класифікатор ідентифікації 'cf.', кваліфікований ранг 'species'.

source: Type the Accession ID, preferably also the Quantity received.
es: Escriba la ID de la accesión, preferiblemente también la cantidad recibida.
it: Scrivi l'identificativo dell'accessione, e preferibilmente anche la quantità ricevuta.
ko: 등록 ID를 입력합니다. 수신 수량도 입력합니다.
uk: Тип ID приєднання, бажано також Кількість отриманих.

source: Accession Source
es: Fuente de la accesión
it: Fonte dell'Accessione
ko: 소스 가입
uk: Джерело приєднання

source: The source of the accessions lets you add more information about where this accession came from. Select a Contact from the drop-down list, or choose "Garden Propagation", which is placed as a default first item in the list of contacts.
es: La fuente de las accesiones te permite añadir más información sobre de donde vino esta accesión. Seleccione un contacto de la lista desplegable y elija "Propagación de jardín", que se coloca como primer elemento predeterminado en la lista de contactos.
it: La fonte delle accessioni consente di aggiungere ulteriori informazioni sulla provenienza della accessione. Selezionare un contatto dall'elenco a tendina, o scegliere "Propagazione del giardino", primo elemento predefinito nell'elenco dei contatti.
ko: 접근 권한의 원본을 사용하여 접근 권한의 출처 정보를 추가할 수 있습니다. 드롭다운 목록에서 연락처를 선택하거나 연락처 목록에서 기본 첫 번째 항목으로 배치된 "정원 전파"를 선택합니다.
uk: Джерело приєднань дає змогу додавати додаткову інформацію про те, звідки взяли приєднання. Виберіть контакт у розкривному списку або виберіть "Garden Propagation", який розміщений як перший пункт за замовчуванням в списку контактів.

source: A Garden Propagation is the result of successful Propagation.
es: Una propagación de jardín es el resultado de un intento de propagación exitoso.
it: Una propagazione del giardino è il risultato di una propagazione andata a buon fine.
ko: 정원 전파는 성공적인 전파의 결과이다.
uk: Garden Propagation є результатом успішного розповсюдження.

source: When accessing material from a Garden Propagation, you would initially leave the first tab alone (General) and start from the second tab (Source). Select as Contact "Garden Propagation", indicate which plant is the parent plant and choose among the still not completely accessed propagations the one you intend to add as an accession in your database.
es: Al acceder a material de una propagación de jardín, inicialmente se deja la primera pestaña (General) y se empieza de la segunda pestaña (Fuente). Seleccione como contacto "Propagación de jardín", indique cual planta es la planta madre y escoja entre las propagaciones todavía no completamente accesadas, la que usted desea agregar como una accesión en la base de datos.
it: Quando si accessiona materiale di una propagazione di giardino, lascia inizialmente vuota la prima scheda (generale) e inizia dalla seconda scheda (fonte). Seleziona come contatto "Propagazione del Giardino", indicare quale pianta è la pianta madre e scegli tra le propagazioni ancora non completamente accessionate quella che si desidera aggiungere come accessione nel database.
ko: 정원 전파에서 재료에 액세스할 때 처음에는 첫 번째 탭(일반)을 그대로 두고 두 번째 탭(소스)에서 시작합니다. 연락처 "정원 전파"로 선택하고 상위 플랜트인 플랜트를 표시한 다음 데이터베이스에 등록으로 추가하려는 아직 완전히 액세스되지 않은 전파 중 하나를 선택합니다.
uk: При доступі до матеріалу з Garden Propagation, ви спочатку залиште першу вкладку (Загальні) і почніть з другої вкладки (Джерело). Виберіть в якості контакту "Garden Propagation", вкажіть, яка рослина є материнською рослиною і виберіть серед ще не повністю доступних розповсюджень ту, яку ви плануєте додати як приєднання до вашої бази даних.

source: Once you select a propagation, the software will set several fields in the General tab, which you can now review. The Taxon (maybe you managed to obtain something slightly different than the parent plant). The Initial quantity (in case not all plants go in the same accession). The Type of Material, inferred from the propagation type.
es: Cuando seleccione una propagación, el software llena varios campos en la ficha General, que ahora puede revisar. La taxonomía (tal vez se pudo obtener algo ligeramente distinto a la planta madre). La cantidad inicial (en caso que no todas las plantas van en la misma accesión). El Tipo de Material, deducido del tipo de propagación.
it: Una volta che si seleziona una propagazione, il software riempie alcuni campi nella scheda generale, che è ora bene esaminare. Il Taxon (forse sei riuscito a ottenere qualcosa di leggermente diverso da quello della pianta madre). La quantità iniziale (in caso che non tutte le piante vanno nella stessa accessione). Il tipo di materiale, derivato dal tipo di propagazione.
ko: 전파를 선택하면 소프트웨어가 일반 탭에서 여러 필드를 설정할 수 있습니다. 이제 이 필드를 검토할 수 있습니다. Taxon(모공장과는 약간 다른 것을 얻었을 수도 있습니다.) 초기 수량(모든 플랜트가 동일한 등록에 속하지 않는 경우)입니다. 전파 유형에서 유추된 재료 유형입니다.
uk: Після вибору розповсюдження програмне забезпечення встановить декілька полів на вкладці Загальні, які ви можете переглянути. Таксон (можливо, вам вдалося отримати щось дещо інше, ніж материнську рослину). Початкова кількість (у випадку, якщо не всі рослини переходять до одного приєднання). Тип матеріалу, що випливає з типу розповсюдження.

source: Plant
es: Planta
it: Pianta
ko: 식물
uk: Рослина

source: A ``Plant`` in the Ghini database describes an individual plant in your collection. A plant belongs to an accession, and it has a specific location.
es: El la base de datos Ghini una ``Plant`` describe una planta individual en la colección. Una planta pertenece a una accesión, y se encuentra en una ubicación específica.
it: Una ``Plant`` nella base dati Ghini rappresenta un individuo nella collezione fisica. Una pianta appartiene ad un'accessione, ed ha una sua collocazione.
ko: 기니 데이터베이스에 있는 "공장"은 컬렉션에 있는 개별 공장에 대해 설명합니다. 식물은 등록에 속하며, 특정한 위치를 가지고 있다.
uk: ``Plant`` в базі даних Ghini описує окрему рослину у вашій колекції. Рослина належить до приєднання, і вона має своє місце розташування.

source: Creating multiple plants
es: Creación de múltiples plantas
it: Creare più piante allo stesso tempo
ko: 다중 식물 생성
uk: Створення декількох рослин

source: You can create multiple Plants by using ranges in the code entry. This is only allowed when creating new plants and it is not possible when editing existing Plants in the database.
es: Puede crear múltiples plantas mediante el uso de rangos en la entrada de código. Esto sólo es permitido al crear nuevas plantas y no es posible editar las plantas existentes en la base de datos.
it: È possibile creare più di una pianta in una sola volta, specificando un intervallo come codice di pianta. Questa opzione è disponibile solo al momento di inserire una nuova pianta, non quando se ne sta modificando una già presente nella base dati.
ko: 코드 항목의 범위를 사용하여 여러 공장을 생성할 수 있습니다. 이것은 새 식물을 작성할 때만 허용되며 데이터베이스에서 기존 식물을 편집할 때는 허용되지 않습니다.
uk: Ви можете створити кілька рослин з використанням діапазонів в запису коду. Це дозволено тільки при створенні нових рослин, і це не можливо при редагуванні існуючих рослин в базі даних.

source: For example the range, 3-5 will create plant with code 3,4,5. The range 1,4-7,25 will create plants with codes 1,4,5,6,7,25.
es: Por ejemplo la gama, 3-5 se formará planta código 3,4,5. La gama 1.4-7.25 creará plantas con códigos 1,4,5,6,7,25.
it: Per esempio, l'intervallo 3-5 creerà tre piante, con codici rispettivamente 3, 4 e 5. L'intervallo 1,4-7,25 crea sei piante con codici rispettivamente 1, 4, 5, 6, 7 e 25.
ko: 예를 들어, 3-5는 코드 3,4,5로 공장을 만듭니다. 1,4-7,25의 범위는 코드 1,4,5,6,7,25의 식물을 생성할 것이다.
uk: Наприклад, діапазон, 3-5 створить рослину з кодом 3,4,5. Діапазон 1,4-7,25 створюватиме рослини з кодами 1,4,5,6,7,25.

source: When you enter the range in the plant code entry the entry will turn blue to indicate that you are now creating multiple plants. Any fields that are set while in this mode will be copied to all the plants that are created.
es: Al entrar en la gama de la entrada de código de planta la entrada dará vuelta al azul para indicar que ahora está creando múltiples plantas. Los campos que se establecen en este modo se copiará en todas las plantas que se crean.
it: Quando si immette l'intervallo nella voce del codice planting la voce diventa blu per indicare che si stanno ora creando planting multipli. Tutti i campi che sono impostati in questa modalità verranno copiati tutte le piante che vengono create.
ko: 식물코드 항목에 범위를 입력하면 파란색으로 바뀌어 여러 공장을 만들고 있음을 나타냅니다. 이 모드에 있는 동안 설정된 모든 필드는 생성된 모든 식물에 복사됩니다.
uk: При вході в діапазон в запису коду рослин запис буде синіти щоб вказати, що ви зараз створюєте кілька рослин. Будь-які поля, які встановлені в цьому режимі будуть скопійовані для всіх рослин які створюються.

source: Pictures
es: Fotos
it: Fotografie
ko: 사진
uk: Зображення

source: Just as almost all objects in the Ghini database can have *Notes* associated to them, Plants and Species can also have *Pictures*: next to the tab for Notes, the Plant and the Species editors contain an extra tab called "Pictures". You can associate as many pictures as you might need to a plant and to a species object.
es: Como a casi todos los objetos en la basedatos Ghini pueden ser asociadas *notas*,a plantas y alas especies se pueden asociar *fotos*: al lado de la ficha de notas, el editor de plantas contiene una ficha adicional para las fotos. Se pueden asociar tantas fotos quantas usted quiera.
it: Come quasi tutti gli oggetti in un database Ghini possono avere associate *note*, allo stesso modo Piante e Specie possono vedersi associate *immagini*: accanto alla scheda per le note, l'editor delle piante e quello delle specie contengono una scheda aggiuntiva chiamata "Pictures". È possibile associare ad una pianta o ad una specie tante immagini quanto sia necessario.
ko: Ghini 데이터베이스의 거의 모든 개체가 *Notes*와 연결될 수 있듯이, 식물 및 종 편집기도 Notes, 식물 및 종 편집기의 탭 옆에 *Pictures*:를 가질 수 있습니다. "Pictures"라는 추가 탭이 있습니다. 필요한 만큼의 그림을 식물과 종 개체와 연결할 수 있습니다.
uk: Так само, як майже всі об'єкти в базі даних Ghini можуть мати пов'язані з ними *Примітки*, рослини можуть мати *Зображення*: поруч із закладкою Примітки, редактор рослин містить додаткову вкладку під назвою "Зображення". Ви можете пов'язати стільки зображень, скільки може знадобитися для рослини та виду об'єкта.

source: When you associate a picture to an object, the file is copied in the *pictures* folder, and a miniature (500x500) is generated and copied in the `thumbnails` folder inside of the pictures folder.
es: Al momento de asociar una imagen a una planta, el software copia el archivo en la carpeta de fotos, mientras una miniatura (500x500) es generada y copiada en la carpeta 'miniaturas' dentro de la carpeta de fotos.
it: Quando si associa un'immagine ad un oggetto, il file viene copiato nella cartella immagini ed una miniatura (500x500) è generata e copiata nella cartella ``thumbnails`` all'interno della cartella immagini.
ko: 그림을 객체에 연결하면 *그림* 폴더에 파일이 복사되고 사진 폴더 안의 '썸네일' 폴더에 축소판 그림(500x500)이 생성되어 복사됩니다.
uk: Коли ви асоціюєте зображення до об'єкта, файл копіюється в папку *pictures*, а мініатюра (500x500) створюється та копіюється в папку `thumbnails` всередині папки зображень.

source: As of Ghini-1.0.62, Pictures are not kept in the database. To ensure pictures are available on all terminals where you have installed and configured Ghini, you can use a network drive, or a file sharing service like Tresorit or Dropbox.
es: A partir de Ghini-1.0.62, fotos no se mantienen en la base de datos. Para asegurar imágenes están disponibles en todas las terminales donde se han instalado y configurado Ghini, puede utilizar una unidad de red o un servicio como Tresorit o Dropbox para compartir archivos.
it: Con Ghini-1.0.62, le immagini non restano nel database. Per garantire che le immagini siano disponibili su tutti i terminali dove s'è installato e configurato Ghini, è possibile utilizzare una cartella di rete, o un servizio di condivisione di file, come Tresorit o Dropbox.
ko: Ghini-1.0.62 현재, 사진은 데이터베이스에 보관되지 않습니다. Ghini를 설치하고 구성한 모든 터미널에서 사진을 사용할 수 있도록 네트워크 드라이브 또는 Tresorit 또는 Dropbox와 같은 파일 공유 서비스를 사용할 수 있습니다.
uk: З Ghini-1.0.62, зображення не зберігаються в базі даних. Для забезпечення доступності зображень на всіх терміналах, де ви встановили і налаштували Ghini, ви можете використовувати мережний диск або службу спільного використання файлів Tresorit або Dropbox.

source: Remember that you have configured the pictures root folder when you specified the details of your database connection. Again, you should make sure that the pictures root folder is shared with your file sharing service of choice.
es: Recuerde que ha configurado la carpeta de raíz de fotografías cuando usted especifica los detalles de su conexión a la base de datos. Una vez más, debe asegurarse de que la carpeta raíz de cuadros es compartida con el archivo de servicio de la opción de uso compartido.
it: Ricordo di aver configurato la cartella radice di immagini quando specificato i dettagli della connessione di database. Ancora una volta, è necessario assicurarsi che la cartella principale di immagini è condivisa con il vostro servizio di scelta di condivisione di file.
ko: 데이터베이스 연결 세부 정보를 지정할 때 사진 루트 폴더를 구성했다는 점을 기억하십시오. 다시 사진 루트 폴더가 선택한 파일 공유 서비스와 공유되는지 확인해야 합니다.
uk: Пам'ятайте, що ви налаштували кореневу папку зображень, коли вказали деталі налаштування підключення до бази даних. Знову ж таки, ви повинні переконатися, що коренева папка зображень доступна для спільного використання файлів сервіс вибору.

source: When a Plant or a Species in the current selection is highlighted, its pictures are displayed in the pictures pane, the pane left of the information pane. When an Accession in the selection is highlighted, any picture associated to the plants in the highlighted accession are displayed in the pictures pane.
ko: 현재 선택 영역의 식물 또는 종이 강조 표시되면 해당 그림이 정보 창의 왼쪽 창인 사진 창에 표시됩니다. 선택 영역의 등록이 강조 표시되면 강조 표시된 등록의 식물과 관련된 모든 그림이 그림 창에 표시됩니다.
uk: Коли рослину або вид в поточному відборі буде виділено, її зображення відображається в панелі зображень, панель зліва від інформаційної панелі. При приєднанні вибір підсвічуються, будь-яке зображення пов'язане з рослинами в підсвічених приєднаннях відображається в панелі зображень.

source: In Ghini-1.0, pictures are special notes, with category "<picture>", and text the path to the file, relative to the pictures root folder. In the Notes tab, Picture notes will show as normal notes, and you can edit them without limitations.
ko: Ghini-1.0에서는 사진이 특수 노트로, "<그림>" 범주와 함께 사진 루트 폴더에 상대적인 파일 경로를 텍스트로 지정합니다. 노트 탭에서 사진 노트는 일반 노트로 표시되며 제한 없이 편집할 수 있습니다.

source: A Plant is a physical object, so you associate to it pictures taken of that individual plant, taken at any relevant development stage of the plant, possibly helping its identification.
ko: 식물은 물리적인 물체이므로, 여러분은 식물의 모든 관련 개발 단계에서 찍은 개별 식물의 사진을 그것과 연관시켜, 그 식별에 도움을 줄 수 있습니다.
uk: Рослина є фізичним об'єктом, тому ви можете приєднати до неї зображення, взяті цієї індивідуальної рослини, взяті на будь-якій відповідній стадії розвитку рослини, можливо, допомагаючи її ідентифікувати.

source: Species are abstract objects, so you would associate to it pictures showing the characteristic elements of the species, so it makes sense to associate a flora illustration to it. You can also do that by reference: go to the Notes tab, add a note and specify as category "<picture>", then in the text field you type the URL for the illustration of your choice.
ko: 종들은 추상적인 물건들이기 때문에, 여러분은 종의 특징적인 요소들을 보여주는 그림들을 그것과 연관시키게 될 것입니다. 그래서 그것에 동식물 삽화를 연관시키는 것이 타당합니다. 참고: Notes 탭으로 이동하여 메모를 추가한 후 "그림"으로 지정한 다음 텍스트 필드에 선택한 그림의 URL을 입력할 수 있습니다.

source: Locations
es: Ubicaciones
it: Ubicazioni
ko: 위치
uk: Розташування

source: The Location editor
es: Editor de Ubicaciones
it: Editore delle Collocazioni
ko: 위치 편집기
uk: Редактор Розташування

source: danger zone
es: zona de peligro
it: zona di pericolo
ko: 아들 가운데 짝을 고르고 있다
uk: небезпечна зона

source: The location editor contains an initially hidden section named *danger zone*. The widgets contained in this section allow the user to merge the current location into a different location, letting the user correct spelling mistakes or implement policy changes.
es: El editor de ubicación contiene una sección inicialmente oculta llamada * zona de peligro *. Los widgets incluidos en esta sección permiten al usuario combinar la ubicación actual en una ubicación diferente, dejando al usuario corregir errores de ortografía o implementar cambios en la política.
it: L'editor di percorso contiene una sezione inizialmente nascosta denominata * pericolo zona *. I widget contenuti in questa sezione consentono di unire la posizione corrente in un'altra posizione, consentendo all'utente di correggere errori di ortografia o implementare le modifiche dei criteri.
ko: 위치 편집기에는 *위험 영역*이라는 이름의 초기 숨겨진 섹션이 포함되어 있습니다. 이 섹션에 포함된 위젯을 통해 사용자는 현재 위치를 다른 위치로 병합하여 맞춤법 오류를 수정하거나 정책 변경 사항을 구현할 수 있습니다.
uk: Редактор розташування містить спочатку прихований розділ під назвою *небезпечна зона*. Віджети, що містяться в даному розділі, дозволяють користувачеві переводити поточне місце розташування в інше місце, виправляти орфографічні помилки або здійснювати зміну політики.

source: the Ghini family
ko: 기니 가문
uk: Сім'я Ghini

source: Let's start by recalling the composition of the Ghini family, as shown in the diagram:
ko: 다이어그램에 나와 있는 것처럼 Ghini 계열의 구성을 상기하는 것부터 시작하겠습니다:
uk: Почнемо з нагадування про склад сім'ї Ghini, як показано на схемі:

source: You have learned how to use ghini.desktop, here we introduce the other members of the family, and their interaction.
ko: gini.desktop 사용법을 배웠습니다. 여기서는 다른 가족 구성원과 그들의 상호 작용에 대해 소개합니다.
uk: Ви навчилися використовувати ghini.desktop, тут ми вводимо інших членів сім'ї та їх взаємодію.

source: ghini.pocket is an Android app which you can install from the `play store <https://play.google.com/store/apps/details?id=me.ghini.pocket>`_. ghini.pocket is definitely the tool you will use most, next to ghini.desktop.
ko: ghini.pocket은 https://play.google.com/store/apps/details?id=me.ghini.pocket.ghini 플레이스토어에서 설치할 수 있는 안드로이드 앱이다.포켓은 분명히 당신이 가장 많이 사용하게 될 도구입니다, ghini.computer 옆에.
uk: ghini.pocket - це програма для Android, яку ви можете встановити з `play store <https://play.google.com/store/apps/details?id=me.ghini.pocket>`_. ghini.pocket, безумовно, інструмент, який ви будете використовувати найчастіше, поряд з ghini.desktop.

source: With ghini.pocket you always have the latest snapshot of your database with you.
ko: 기니랑.포켓 항상 데이터베이스의 최신 스냅샷을 가지고 있습니다.
uk: З ghini.pocket у вас завжди є останній знімок вашої бази даних з вами.

source: Type an accession number, or scan its barcode or QR label, and you know:
ko: 등록 번호를 입력하거나 바코드 또는 QR 레이블을 스캔합니다:
uk: Введіть номер приєднання або скануйте його штрих-код або мітку QR, і ви взнаєте:

source: the identification of the plant,
ko: 식물의 식별,
uk: ідентифікацію рослини,

source: whether it already has pictures,
ko: 이미 사진이 있든 말든
uk: чи має зображення,

source: when it entered the garden and
ko: 그것이 정원에 들어갔을 때 그리고
uk: коли увійшов до саду і

source: from which source.
ko: 어느 출처에서 왔는지.
uk: з якого джерела.

source: Apart as a quick data viewer, you can use ghini.pocket for...
ko: 빠른 데이터 뷰어 외에도 기니를 사용할 수 있습니다....을 위해 돈을 쓰다.
uk: Крім швидкого перегляду даних, ви можете використовувати ghini.pocket для...

source: data correction
ko: 자료 수정
uk: корекції даних

source: If by your judgement, some of the information is incorrect, or if the plant is flowering and you want to immediately take a picture and store it in the database, you do not need take notes on paper, nor follow convolute procedures: ghini.pocket lets you write your corrections in a log file, take pictures associated to the plant, and you will import this information straight into the database, with further minimal user intervention.
ko: 만약 여러분의 판단으로 일부 정보가 부정확하거나, 식물이 꽃을 피우고 있고, 즉시 사진을 찍어 데이터베이스에 저장하고자 한다면, 여러분은 종이에 필기할 필요도 없고, 모순적인 절차를 따를 필요도 없습니다: 기니.pocket을 사용하면 로그 파일에 수정 사항을 기록하고 공장에 연결된 사진을 찍을 수 있으며, 사용자가 개입하는 것을 최소화하면서 이 정보를 데이터베이스로 직접 가져올 수 있습니다.

source: inventory review
ko: 재고 조사
uk: перегляду інвентаризації

source: The initial idea on which we based ghini.pocket is still one of its functionalities: inventory review.
ko: 기니의 기초가 된 최초의 아이디어.포켓은 여전히 그 기능 중 하나이다: 재고 검토.
uk: Початкова ідея, на якій ми заснували ghini.pocket, як і раніше є однією з його функціональних можливостей: перевірка інвентаризації.

source: Using ghini.pocket, reviewing the inventory of a greenhouse, in particular if you have QR codes on plant labels, goes as fast as you can walk: simply enter the location code of your greenhouse, reset the log, then one by one scan the plant codes of the plants in the greenhouse. No further data collection action is required.
ko: 기니로.포켓, 온실 재고 조사, 특히 식물 라벨에 QR 코드가 있는 경우 걸을 수 있는 한 빨리 진행됩니다: 단순히 온실의 위치 코드를 입력하고 로그를 재설정한 다음, 온실에 있는 식물의 식물 코드를 하나씩 스캔합니다. 추가 데이터 수집 작업은 필요하지 않습니다.
uk: Використовуючи ghini.pocket, перегляд інвентаризації теплиці, зокрема, якщо у вас є QR-коди на етикетках рослин, проходить так само швидко, як ви можете йти: просто введіть код місцеположення вашої теплиці, скиньте журнал, потім один за одним скануйте рослинні коди рослин у теплиці. Немає необхідності в подальшому зборі даних.

source: When you're done, import the log in ghini.desktop. The procedure available in ghini.desktop includes adding unknown but labelled plants in the database, marking as lost/dead all plants that the database reports as alive and present in the inventoried location, but were not found during the inventory.
ko: 작업이 완료되면 로그인 ghini.desktop을 가져옵니다. ghini.desktop에서 사용할 수 있는 절차에는 데이터베이스에 알 수 없지만 라벨이 부착된 플랜트를 추가하고, 데이터베이스가 재고 위치에 존재하며 있다고 보고하지만 재고 조사 중에는 발견되지 않은 모든 플랜트를 분실/사망으로 표시하는 것이 포함됩니다.
uk: Коли ви закінчите, імпортуйте журнал у ghini.desktop. Процедура, доступна в ghini.desktop, включає в себе додавання невідомих, але позначених рослин в базу даних, позначення як загублених / загиблих всіх рослин, що базуються в звітах як живі та присутні в інвентарі, але не були знайдені під час інвентаризації.

source: taxonomic support
ko: 분류학적 지원
uk: таксономічної підтримки
