Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: ``ghini.desktop``, born as ``bauble.classic`` and made a commons by the Belize Botanical Garden. ``ghini.desktop`` has three more components, a pocket data collecting Android app, a Node.js web server, aggregating data from different gardens and presenting it geographically, again a geographic tour app aimed at visitors using the web data aggregator as its data source. You can find every Ghini component on GitHub: http://github.com/Ghini
ko: 벨리즈 식물원이 만든 ``ghini.desktop"은 ``bauble.classic"으로 탄생했다. "ghini.desktop"은 안드로이드 앱, Node.js 웹 서버, 포켓 데이터 수집, 서로 다른 정원의 데이터 수집, 지리적으로 이를 제공하는 세 가지 요소를 더 가지고 있는데, 다시 웹 데이터 집적기를 데이터 소스로 사용하는 방문객을 겨냥한 지리 여행 앱이다. GitHub에서 모든 Ghini 구성 요소를 찾을 수 있습니다. http://github.com/Ghini

source: Specify 6 and 7, made a Commons by the Kansas University. A bit complex to set up, very difficult to configure and tricky to update. The institutions I've met who tried it, only the bigger ones, with in-house software management capabilities manage to successfully use it. They use it for very large collections. Specify is extremely generic, it adapts to herbaria, seed collections, but also to collections of eggs, organic material, fossils, preserved dead animals, possibly even viruses, I'm not sure. It is this extreme flexibility that makes its configuration such a complex task. Specify is also on GitHub: https://github.com/specify and is licensed as GPLv2+.
ko: 6과 7을 지정하십시오. 캔자스 대학교가 만든 커먼스입니다. 설정하기 복잡하고 구성하기도 매우 어렵고 업데이트하기도 까다롭습니다. 제가 만난 기관들은 사내 소프트웨어 관리 기능을 갖춘 대형 기관들만이 성공적으로 이 시스템을 사용할 수 있습니다. 그들은 그것을 매우 많은 수집품에 사용한다. 명세서는 극히 일반적이며, 난자, 유기물, 화석, 보존된 죽은 동물들, 심지어는 바이러스까지 적응합니다. 이렇게 구성이 복잡한 것은 바로 이러한 극단적인 유연성 때문입니다. Specify는 GitHub: https://github.com/specify에도 있으며 GPLv2+로 라이센스가 부여됩니다.

source: Botalista, a French/Swiss cooperation, is GPL as far as rumours go. Its development has yet to go public.
ko: 프랑스/스위스 협력사인 보탈리스타는 소문만큼 GPL이다. 그것의 개발은 아직 공개되지 않았다.

source: ``bauble.web`` is an experimental web server by the author of ``bauble.classic``. ``bauble.classic`` has been included into Ghini, to become ``ghini.desktop``. Bauble uses a very permissive license, making it libre, but not copylefted. As much as 50% of bauble.web and possibly 30% of ghini.desktop is shared between the two projects. Bauble seems to be stagnating, and has not yet reached a production-ready stage.
ko: ''아쉽다''웹닷컴은 "bulble.bulful"의 저자가 개발한 실험용 웹 서버이다. "보블.클래식"이 기니에 포함되어 "기니.데스크톱"이 되었다. 바우블은 관대한 면허증을 사용해서, 그것을 입방아로 만들지만, 복사본은 남기지 않았다. 보블의 50%나 되죠웹과 30%의 ghini.dump가 두 프로젝트 간에 공유됩니다. 보블은 침체된 듯 아직 생산 준비 단계에 이르지 못했다.

source: ``Taxasoft-BG``, by Eric Gouda, a Dutch botanist, specialist in Bromeliaceae, collection manager at the Utrecht botanical garden. It was Mario Frasca who convinced Eric to publish what he was doing, licensing it under the GPL, but the repository was not updated after 2016, April 13th and Eric forgot to explicitly specify the license. You find it on github: https://github.com/Ejgouda/Taxasoft-BG
ko: 네덜란드의 식물학자, 브로멜리아과 전문의, 위트레흐트 식물원 소장 에릭 고다가 쓴 ''Taxasoft-BG''입니다. GPL에 따라 라이센스를 부여하면서 에릭에게 자신이 하고 있는 일을 출판하도록 설득한 사람은 마리오 프라스카였지만, 2016년 4월 13일 이후 저장소는 업데이트되지 않았고 에릭은 라이센스를 명시적으로 지정하는 것을 잊어버렸다. github에서 찾을 수 있습니다. https://github.com/Ejgouda/Taxasoft-BG

source: ``BG-Recorder``, by the BGCI, runs on Windows, and requires Access. Developed mostly between 1997 and 2003, it has not been maintained ever since and isn't actively distributed by the BGCI. I've not managed to find a download link nor its license statement. It is still mentioned as *the free option* for botanic database management.
ko: BGCI의 "BG-Recorder"는 Windows에서 실행되며 액세스가 필요합니다. 대부분 1997년과 2003년 사이에 개발되었으며, 그 이후로 유지되지 않고 있으며 BGCI에 의해 적극적으로 배포되지 않고 있다. 다운로드 링크나 라이센스 명세서를 찾을 수 없습니다. 식물 데이터베이스 관리를 위한 *무료 옵션*으로 여전히 언급되고 있습니다.

source: Of the above, only ``ghini.desktop`` satisfies these conditions: Copylefted, available, documented, maintained, easy to install and configure. Moreover: Cross platform and internationalized.
ko: 위 중 ``ghini.desktop"만이 다음 조건을 충족시킨다. 복사, 사용 가능, 문서화, 유지 관리, 설치 및 구성이 용이합니다. 게다가 플랫폼 간 교차 및 국제화.

source: Welcome to Ghini/Bauble
ko: 기니/바울에 오신 것을 환영합니다

source: Dear new user,
ko: 새로운 사용자님께,

source: Welcome to Ghini/Bauble.
ko: 기니/바울에 오신 것을 환영합니다.

source: As the maintainer, I have received your registration for bauble.classic/ghini.desktop, many thanks for taking your time to fill in the form.
ko: 관리자로서, 저는 당신의 bauble.class/ghini.desktop에 대한 등록을 받았습니다. 양식을 작성하는데 시간을 내주셔서 대단히 감사합니다.

source: I see you are using bauble.classic-1.0.55, whereas 1.0.55 is the last released version of bauble.classic, however, bauble.classic is now unmaintained and superseded by the fully compatible, but slightly aesthetically different ghini.desktop. Install it following the instructions found at http://ghini.rtfd.io
ko: 보블.classic-1.0.55를 사용하고 계신데 반해, 1.0.55는 보블.classic의 마지막 버전입니다. 하지만 보블.classic은 이제 완전히 호환되지만 미학적으로는 약간 다른 기니.데스크톱으로 대체되었습니다. http://ghini.rtfd.io의 지침에 따라 설치합니다

source: The registration service says you're not yet using the newest Python2 version available. As of 2018-05-01, that is 2.7.15. Using any older version does not necessitate problems, but in case anything strange happens, please update your Python (and PyGTK) before reporting any errors.
ko: 등록 서비스에서 사용 가능한 최신 Python2 버전을 아직 사용하지 않고 있다고 합니다. 2018-05-01 현재, 그것은 2.7.15이다. 이전 버전을 사용할 경우 문제가 발생하지 않지만, 이상한 일이 발생할 경우 오류를 보고하기 전에 Python(및 PyGTK)을 업데이트하십시오.

source: Also thank you for enabling the "sentry" errors and warnings handler. With that enabled, Ghini/Bauble will send any error or warning you might encounter to a central server, where a developer will be able to examine it. If the warning was caused by an error in the software, its solution will be present in a subsequent release of the software
ko: 또한 "sentry" 오류 및 경고 처리기를 활성화해 주셔서 감사합니다. 이 기능을 사용하면 Ghini/Bauble에서 발생할 수 있는 오류나 경고를 중앙 서버로 전송하여 개발자가 검사할 수 있습니다. 소프트웨어의 오류로 인해 경고가 발생한 경우 해당 솔루션은 소프트웨어의 후속 릴리스에 표시됩니다

source: If you haven't already, to enable the sentry and warnings handler, open the ":config" page in Ghini and double click on the row "bauble.use_sentry_client".
ko: 아직 Sentry 및 경고 핸들러를 활성화하지 않은 경우 Ghini에서 ":config" 페이지를 열고 "bauable.use_sentry_client" 행을 두 번 클릭합니다.

source: I hope Ghini already matches your expectations, if this is not the case, the whole Ghini community would be very thankful if you took the time to report your experience with it.
ko: 기니가 이미 여러분의 기대에 부응하길 바라며, 만약 그렇지 않다면, 시간을 내어 여러분의 경험을 보고해 주신다면 기니 커뮤니티 전체가 매우 감사할 것입니다.

source: The above is one way to contribute to Ghini's development. Others are: - contribute ideas, writing on the bauble google forum (https://groups.google.com/forum/#!forum/bauble), - contribute documentation, or translations (https://hosted.weblate.org/projects/ghini/), - give private feedback, writing to ghini@anche.no, - rate and discuss Ghini openly, and promote its adoption by other institutions, - open an issue on GitHub (https://github.com/Ghini/ghini.desktop/issues/), - contribute code on GitHub (fork the project on (https://github.com/Ghini/ghini.desktop/), - hire a developer and have a set of GitHub issues solved, per-haps your own - let me include your garden on the still experimental worldmap (http://gardens.ghini.me)
ko: 위의 내용은 기니의 발전에 기여하는 한 가지 방법이다. 다른 것들은 다음과 같습니다. - 아이디어 기고, 구글 포럼에 글쓰기, 문서 기고, 번역기 기고, ghini@anche.no에 글쓰기, ghini@anche.no에 글쓰기, 기니의 평가 및 토론, 다른 기관의 채택 촉진, 개방. GitHub에 대한 발행(https://github.com/Ghini/ghini.desktop/issues/), - GitHub에 대한 기여 코드(https://github.com/Ghini/ghini.desktop/), - 개발자를 고용하고 GitHub 문제를 해결했음) - 아직 실험적인 세계 지도(http://gardens.ghini.me)에 여러분의 정원을 포함시킬 수 있습니다

source: I sincerely hope you will enjoy using this copylefted, libre software
ko: 나는 진심으로 당신이 이 복사된 libre 소프트웨어를 즐겨 사용하길 바란다

source: Best regards, Mario Frasca
ko: Best Greetings, 마리오 프레이스카

source: Do you want to join Ghini?
ko: 기니랑 같이 갈래?

source: I generally send a note similar to the following, to GitHub members who "star" the project, or to WebLate contributors doing more than one line, and at different occasions. If it's from GitHub, and if they stated their geographic location in their profile, I alter the letter by first looking on `institutos botánicos <http://umap.openstreetmap.fr/en/map/institutos-botanicos_47038#2/18.0/12.0>`_ if there's any relevant garden in their neighbourhood.
ko: 프로젝트를 "주연"하는 GitHub 회원이나 WebLate 기고자들이 한 회선 이상 하는 경우, 그리고 다른 경우에, 저는 일반적으로 다음과 유사한 메모를 보냅니다. 만약 GitHub에서 온 것이고, 만약 그들이 그들의 프로필에 지리적 위치를 언급했다면, 나는 먼저 이웃에 관련 정원이 있다면 'botánicos http://umap.openstreetmap.fr/en/map/institutos-botanicos_47038#2/18.0/12.0'을 찾아 편지를 바꾼다.

source: Dear GitHub member, student, colleague, translator, botanist,
ko: GitHub 회원님, 학생, 동료, 번역가, 식물학자님,

source: Thank you warmly for your interest in the Ghini project!
ko: 기니 프로젝트에 관심을 가져주셔서 진심으로 감사드립니다!

source: From your on-line profile on github, I see you're located in Xxxx, is that correct?
ko: github의 온라인 프로필을 보니 Xxx에 있는 것 같은데 맞나요?

source: If you are indeed in Xxxx, you live very close to gardens Yyyy and Zzzz. Maybe you would consider the following proposition? All would start by contacting the botanical garden there, and get to know what software they use (what it offers, and at which price) and if they're interested in switching to ghini.desktop+pocket+tour+web.
ko: 만약 여러분이 Xxxx에 있다면, 여러분은 Yyyy와 Zzz 정원에 매우 가까이 삽니다. 다음 제안을 고려해 보시겠습니까? 먼저 식물원에 연락하여 그들이 사용하는 소프트웨어(그것이 무엇을 제공하는지, 가격은 얼마인지)와 ghini.desktop+pocket+tour+web으로 전환하고 싶은지 알아봅니다.

source: The business model within Ghini is that the software is free and you get it for free, but time is precious and if a garden needs help, they should be ready to contribute. Maybe you already have a full-time job and don't need more things to do, but in case you're interested, or you have friends who would be, I'm sure we can work something out.
ko: 기니의 비즈니스 모델은 소프트웨어가 무료이고 무료로 제공되지만 시간은 소중하며 정원에 도움이 필요하면 언제든지 도움을 줄 수 있어야 합니다. 아마 당신은 이미 정규직이 있고 더 많은 일을 할 필요가 없을지도 모르지만, 만약 당신이 관심이 있거나 친구가 있다면, 우리가 뭔가 해결할 수 있을 거라고 확신해요.

source: Let me know where you stand.
ko: 당신이 어디에 서 있는지 알려주세요.

source: best regards, and again thanks for all your contributed translations.
ko: 안녕히 계십시오, 그리고 다시 한번 당신의 모든 번역에 감사드립니다.

source: Mario Frasca
ko: 마리오 프라스카

source: Quito Botanical Garden
es: Jardín Botánico de Quito
it: Orto botanico di Quito
ko: 키토 식물원
uk: Ботанічний сад Кіто

source: At the JBQ, Quito Botanical Garden, we have adopted the Ghini software in April 2015. Since that time, we have accumulated experience with the program, and we are ourselves in need to document it, in order to secure the knowledge to the institution. We are happy to share it.
es: En el JBQ, Jardín Botánico de Quito, hemos adoptado el software de Ghini en abril de 2015. Desde entonces, hemos ido acumulando experiencia con el programa, y somos nosotros mismos en la necesitad de documentarla, para asegurar el conocimiento a la institución. Estamos encantados de compartirlo.
it: Presso il JBQ, orto botanico di Quito, abbiamo adottato il software Ghini in aprile 2015. Da quel momento, abbiamo accumulato esperienza con il programma, e siamo noi stessi nella necessità di documentare, al fine di assicurare la conoscenza all'istituzione. Siamo felici di condividere.
ko: JBQ, 키토 식물원에서는 2015년 4월에 Ghini 소프트웨어를 채택했습니다. 그 이후로 우리는 그 프로그램에 대한 경험을 축적해 왔고, 그 지식을 기관에 확보하기 위해 그 내용을 문서화해야 할 필요가 있다. 우리는 그것을 공유하게 되어 기쁘다.
uk: У квітні 2015 року у JBQ, Ботанічний сад Кіто, ми прийняли програмне забезпечення Ghini. З того часу ми накопичили досвід роботи з програмою, і ми самі повинні його документувати, щоб забезпечити знання в установі. Ми з радістю поділяємо це.

source: Technical
es: Detalles técnicos
it: Dettagli tecnici
ko: 테크니컬
uk: Технічний

source: We work on GNU/Linux, a platform that many users don't master, and our database is inside of a remote database management system. This implies steps that are not obvious to the casual end user.
es: Trabajamos en GNU/Linux, una plataforma que no muchos usuarios dominan, y nuestra base de datos está dentro de un sistema de gestión de base de datos remota. Esto implica medidas que no son evidentes para la mayoría.
it: Lavoriamo su GNU/Linux, una piattaforma che molti utenti non dominano, e il nostro database è all'interno di un sistema di gestione di database. Ciò implica passaggi che non sono evidenti all'utente finale casuale.
ko: 우리는 많은 사용자들이 마스터하지 못하는 플랫폼인 GNU/Linux에서 일하며, 우리의 데이터베이스는 원격 데이터베이스 관리 시스템의 내부에 있습니다. 이는 일반 사용자에게 명확하지 않은 단계를 의미합니다.
uk: Ми працюємо над GNU/Linux, платформою, якою багато користувачів не оволодіють, і наша база даних знаходиться всередині віддаленої системи управління базами даних. Це означає кроки, які не є очевидними для звичайних кінцевих користувачів.

source: How to start a program
es: Como arrancar un programa
it: Come avviare un programma
ko: 프로그램을 시작하는 방법
uk: Як запустити програму

source: To start a program given its name, hit the |loose_png| key next to Alt, or click on |10000000000000300000002F89E0224ADF9EC09E_png|, then start typing the name of the program, in our case “Ghini” or just click on the program symbol |100000000000003100000031BB54CBDFA885EBAC_png|, appearing near the left margin of your display.
es: Para iniciar un programa dado su nombre, active la tecla |loose_png|, al lado de Alt, o haga clic en |10000000000000300000002F89E0224Adf9ec09e_png|, a continuación, comience a escribir el nombre del programa, en nuestro caso "Ghini", o simplemente haga clic en el símbolo del programa |100000000000003100000031BB54CBDFa885ebac_png|, que aparece cerca de la margen izquierda de la pantalla.
it: per avviare un programma dato il suo nome, premi il tasto |loose_png| accanto ad Alt, o fare clic su |10000000000000300000002F89E0224ADF9EC09E_png|, quindi iniziare a digitare il nome del programma, nel nostro caso "Ghini" o semplicemente cliccare sul simbolo del programma |100000000000003100000031BB54CBDFA885EBAC_png|, che appare al margine sinistro dello schermo.
ko: 이름이 지정된 프로그램을 시작하려면 Alt 옆에 있는 |lose_png| 키를 누르거나 |1000000000000300002F89E0224를 클릭합니다.ADF9EC09E_png|, 그런 다음 프로그램 이름을 입력하기 시작하세요. 우리의 경우 "Ghini" 또는 프로그램 기호 |100000000310000000031BB54를 클릭하세요.CBDFA885EB디스플레이 왼쪽 여백 근처에 나타나는 AC_png|.
uk: Щоб запустити програму із зазначенням її назви, натисніть |loose_png | Клавіша поруч з Alt або клацніть на |10000000000000300000002F89E0224ADF9EC09E_png|, після чого почніть вводити назву програми, у нашому випадку “Ghini” або просто натиснути символ програми |100000000000003100000031BB54CBDFA885EBAC_png|, що з'являється біля лівих крапок вашого дисплея.

source: Database server
es: Servidor de bases de datos
it: Server di database
ko: 데이터베이스 서버
uk: Сервер баз даних

source: We chose for a centralised PostgreSQL database server. This way we are protected from concurrent conflicting changes, and all changes are simultaneously available on all ghini clients. We did need to outsource database server management.
es: Elegimos para un servidor de bases de datos centralizado PostgreSQL. Así estamos protegidos de conflictos entre cambios concurrentes, y todos los cambios están disponibles simultáneamente en todos los clientes de ghini. Tenemos, porsupuesto, que externalizar la gestión del servidore de bases de datos.
it: Abbiamo scelto un server centralizzato di database PostgreSQL. In questo modo siamo protetti da conflitti fra modifiche simultanee, e tutte le modifiche sono disponibili simultaneamente su tutti i client ghini. Abbiamo però bisogno di esternalizzare la gestione del server di database.
ko: 중앙 집중식 Postgre를 선택했습니다.SQL 데이터베이스 서버. 이렇게 하면 동시 충돌 변경으로부터 보호되며 모든 변경 사항이 모든 기니 클라이언트에서 동시에 제공됩니다. 데이터베이스 서버 관리를 아웃소싱해야 했습니다.
uk: Ми обрали для централізованого сервера баз даних PostgreSQL. Таким чином, ми захищені від одночасних конфліктуючих змін, і всі зміни одночасно доступні для всіх клієнтів ghini. Нам потрібно було використовувати аутсорсинг керування сервером бази даних.

source: adding a new user
es: Agregar un nuevo usuario
it: Creare un nuovo utente
ko: 새 사용자 추가
uk: додавання нового користувача

source: Ghini keeps track of the user performing all sort of edits to the database, and at the garden, apart from the stable users, we have all sorts of temporary users writing to the database, that we decided we would let Ghini help us keep track of database events.
es: En el registro de los cambios a la base de datos, Ghini también graba el nombre de usuario. En nuestro jardín, aparte de los usuarios institucionales, tenemos usuarios temporales habilitados a la escritura a la base de datos. Esto nos hizo decidir que mejor permitimos a Ghini tener un registro completo de los eventos de base de datos.
it: Ghini tiene traccia dell'utente che esegue qualsiasi modifica al database. Nel nostro giardino, a parte gli utenti stabili, abbiamo spesso utenti temporanei abilitati alla scrittura nel database. Abbiamo deciso lasciarci aiutare da Ghini a tenere traccia degli eventi del database.
ko: Ghini는 데이터베이스에 대한 모든 종류의 편집을 수행하는 사용자를 추적합니다. 그리고 정원에 있는 안정적인 사용자들을 제외하고, 우리는 모든 종류의 임시 사용자가 데이터베이스에 쓰도록 합니다. 우리는 Ghini가 데이터베이스 이벤트를 추적하도록 돕기로 결정했습니다.
uk: Ghini відстежує користувача, який виконує всі види редагування в базі даних, і в саду, крім постійних користувачів, у нас є всілякі тимчасові користувачі, які пишуть в базу даних, і ми вирішили дозволити Ghini допомогти нам стежити за подіями бази даних.

source: Since we work using PostgreSQL, the users that Ghini stores in the database history are the database users, not the system users.
es: Dado que trabajamos usando PostgreSQL, los usuarios grabados por Ghini en el historial son los usuarios de la base de datos, no los del sistema.
ko: Postgre를 사용하여 작업하기 때문에Ghini가 데이터베이스 기록에 저장하는 사용자는 시스템 사용자가 아니라 데이터베이스 사용자입니다.
uk: Оскільки ми працюємо з PostgreSQL, користувачі, яких зберігає Ghini в історії бази даних, є користувачі бази даних, а не користувачі системи.

source: Each user knows their own password, and only knows that one. Our super-user, responsible for the database content, also has the ``bauble`` fictional user password, which we only only use to create other users.
es: Cada usuario conoce su propia contraseña, y sólo conoce la suya. El responsable del contenido de la base datos también tiene la contraseña del usuario ``bauble``, que sólo lo usamos para crear usuarios.
ko: 각 사용자는 자신의 암호를 알고 있으며 이 암호만 알고 있습니다. 데이터베이스 콘텐츠를 담당하는 우리의 수퍼유저도 다른 사용자를 만들기 위해서만 사용하는 "보글" 가상 사용자 암호를 가지고 있다.
uk: Кожен користувач знає свій пароль, і тільки він знає його. Наш суперкористувач, який відповідає за вміст бази даних, також має ``bauble`` вигаданий пароль користувача, який ми використовуємо лише для створення інших користувачів.

source: We do not use account names like ``voluntario``, because such accounts do not help us associate the name to the person.
es: No utilizamos nombres de cuenta como ``voluntario``, porque tales cuentas no nos ayudan asociar el nombre a la persona.
ko: 우리는 ``볼런타리오"와 같은 계정 이름을 사용하지 않는데, 그러한 계정은 우리가 그 사람과 이름을 연관시키는 데 도움이 되지 않기 때문이다.
uk: Ми не використовуємо назви облікових записів, як ``voluntario``, оскільки такі облікові записи не допомагають нам пов'язувати ім'я з особами.

source: — adding a new system user (linux/osx)
es: — Agregar un nuevo usuario de sistema (linux/osx)
it: — Creare un nuovo utente di sistema
ko: — 새 시스템 사용자 추가(리눅스/osx)
uk: — додавання нового користувача системи (linux/osx)

source: Adding a system user is not strictly necessary, as ghini does not use it in the logs, however, adding a system user allows for separation of preferences, configured connections, search history. On some of our systems we have a single shared account with several configured connections, on other systems we have one account per user.
es: Agregar un usuario del sistema es no es estrictamente necesario, pues ghini no los usa en los registros, sin embargo, hacerlo permite la separación de las preferencias, configuración de conexiones, historial de búsqueda. En algunos de nuestros sistemas contamos con una sola cuenta compartida, con varias conexiones configuradas, en otros sistemas tenemos una cuenta por usuario.
ko: 기니가 로그에서 시스템 사용자를 사용하지 않기 때문에 시스템 사용자를 추가할 필요가 없지만 시스템 사용자를 추가하면 기본 설정, 구성된 연결, 검색 기록을 분리할 수 있습니다. 일부 시스템에서는 여러 연결이 구성된 단일 공유 계정이 있고, 다른 시스템에서는 사용자당 하나의 계정이 있습니다.
uk: Додавання системного користувача не є обов'язково необхідним, оскільки ghini не використовує його в журналах, однак додавши, що системний користувач дозволяє розділити налаштування, налаштовані з'єднання, історію пошуку. У деяких наших системах ми маємо єдиний загальний обліковий запис з кількома налаштованими з'єднаннями, в інших системах ми маємо один обліковий запис для кожного користувача.

source: On systems with one account per user, our users have a single configured connection, and we hold the database password in the ``/home/<account>/.pgpass`` file. This file is only readable for the ``<account>`` owner.
es: En sistemas con una cuenta por cada usuario, nuestros usuarios tienen una sola conexión configurada, y tenemos la contraseña de la base de datos en el archivo ``home/<account>/.pgpass``. Este archivo sólo es legible para el usuario ``<account>``.
ko: 기니가 로그에서 시스템 사용자를 사용하지 않기 때문에 시스템 사용자를 추가할 필요가 없지만 시스템 사용자를 추가하면 기본 설정, 구성된 연결, 검색 기록을 분리할 수 있습니다. 일부 시스템에서는 여러 연결이 구성된 단일 공유 계정이 있고, 다른 시스템에서는 사용자당 하나의 계정이 있습니다.
uk: На системах з одним обліковим записом для кожного користувача наші користувачі мають одне налаштоване з'єднання, і ми зберігаємо пароль бази даних у файлі ``/home/<account>/.pgpass``. Цей файл є лише читабельним для власника ``<account>``.

source: On systems with a shared account, the user must select their own connection and type the corresponding password.
es: En sistemas con una cuenta compartida, el usuario tiene que seleccionar su conexión propia y escribir la contraseña correspondiente.
ko: 공유 계정이 있는 시스템에서는 사용자가 직접 연결을 선택하고 해당 암호를 입력해야 합니다.
uk: У системах із загальним обліковим записом користувач повинен вибрати своє власне з'єднання та ввести відповідний пароль.

source: These are the steps to add system users::
es: Estos son los pasos para agregar usuarios del sistema::
ko: 다음은 시스템 사용자를 추가하는 단계입니다::
uk: Ось кроки для додавання користувачів системи::

source: — adding a new database user
es: — Agregar un nuevo usuario de base de datos
it: — aggiungere un utente del database
ko: — 새 데이터베이스 사용자 추가
uk: — додавання нового користувача бази даних

source: Ghini has a very minimal interface to user management, it only works with postgresql and it very much lacks maintainance. We have opened issues that will allow us use it, for the time being we use the ``create-role.sh`` script::
es: Ghini tiene una interfaz muy simple para la gestión de usuarios, que solo funciona con postgresql y mucho carece de mantenimiento. Hemos abierto *issues* esperando poderla utilizar, por el momento usamos el script ``create-role.sh``::
ko: Ghini는 사용자 관리에 대한 인터페이스가 매우 적으며 postgresql에서만 작동하며 유지관리가 매우 부족합니다. 우리는 당분간 그것을 사용할 수 있는 문제들을 열어 왔다.shipper 스크립트::
uk: Ghini має дуже мінімальний інтерфейс для управління користувачами, він працює тільки з postgresql, і його дуже не вистачає. Ми відкрили питання, які дозволять нам використовувати його, поки що ми використовуємо сценарій ``create-role.sh``::

source: The redundant ``alter role`` following the ``create role`` lets us apply the same script also for correcting existing accounts.
es: El ``alter role`` siguiente el ``create role`` es redundante, pero nos permite aplicar la misma secuencia de comandos para la corrección de cuentas existentes.
ko: ``역할 만들기"에 이어 중복된 ``역할 바꾸기"를 통해 기존 계정 수정에도 동일한 스크립트를 적용할 수 있다.
uk: Надлишкова ``alter role`` після `` create role`` дозволяє застосовувати один і той же сценарій для виправлення існуючих облікових записів.
