Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: You can associate notes to plants, accessions, species, .... Notes can be categorized and used in searches or reports.
es: A practicamente todos objectos en la base de datos es posible asociar notas. Las notas se pueden categorizar y por supuesto utilizar en búsquedas.
it: È possibile associare note piante, accessioni, specie,... Note possono essere categorizzati e utilizzati nei rapporti o ricerche.
ko: 노트를 식물, 접근권, 종, ..에 연결할 수 있습니다. 노트를 분류하여 검색 또는 보고서에 사용할 수 있습니다.
uk: Ви можете додати примітки до рослин, приєднань, видів, .... Примітки можуть бути класифіковані і використані для пошуку або звітів.

source: garden or herbarium
es: jardines o herbarios
it: giardino o erbario
ko: 정원이나 허바리움
uk: сад або гербарій

source: Management of plant locations.
es: manejo de ubicaciones de plantas.
it: Gestione delle posizioni di pianta.
ko: 발전소 위치 관리.
uk: Управління розташуванням рослин.

source: database history
es: historial de la base de datos
it: cronologia del database
ko: 데이터베이스 기록
uk: історія бази даних

source: All changes in the database is stored in the database, as history log. All changes are 'signed' and time-stamped. Ghini makes it easy to retrieve the list of all changes in the last working day or week, or in any specific period in the past.
es: Todos los cambios en la base de datos se almacenan en un log. Todos los cambios son 'firmados' y sellados temporalmente. Ghini hace fácil la recuperación de todos los cambio en el último día o semana, o en un período especifico del pasado.
it: Tutte le modifiche nel database viene memorizzato nel database, come log di cronologia. Tutte le modifiche sono 'firmate' e timestamp. Ghini rende facile per recuperare l'elenco di tutte le modifiche nell'ultima giornata di lavoro o settimana, o in qualsiasi periodo specifico in passato.
ko: 데이터베이스의 모든 변경사항은 데이터베이스에 기록 로그로 저장됩니다. 모든 변경 사항은 '서명' 및 시간 스탬프로 표시됩니다. 기니는 마지막 근무일이나 주, 또는 과거의 특정 기간에 대한 모든 변경사항 목록을 쉽게 검색할 수 있도록 합니다.
uk: Всі зміни в базі даних зберігаються в базі даних, як журнал історії. Всі зміни 'підписані' і з відміткою часу. Ghini дозволяє легко отримати список всіх змін в останній робочий день або тиждень, або в будь-який певний період в минулому.

source: simple and powerful search
es: búsquedas sencillas o complejas
it: ricerca semplice e potente
ko: 간단명료한 수색
uk: простий і потужний пошук

source: Ghini allows you search the database using simple keywords, e.g.: the name of the location or a genus name, or you can write more complex queries, which do not reach the complexity of SQL but allow you a decent level of detail localizing your data.
es: Ghini le permite consultar la base de datos empleando palabras clave sencillas, p.e.: el nombre del lugar o un nombre de género, o puede escribir consultas más complejas, que no llegarán a la complejidad de SQL paro que le permitirán localizar sus datos con un nivel de detalle aceptable.
it: Ghini ti permette di effettuare ricerche nel database utilizzando semplici parole chiave, ad esempio: il nome della posizione o un nome del genere o si può scrivere query più complesse, che non raggiungono la complessità di SQL ma consentono un buon livello di dettaglio dei dati di localizzazione.
ko: Ghini는 간단한 키워드(예: 위치의 이름 또는 속 이름)를 사용하여 데이터베이스를 검색하거나, SQL의 복잡성에 도달하지는 않지만 데이터를 로컬라이징하는 적절한 수준의 세부 정보를 허용하는 더 복잡한 쿼리를 작성할 수 있습니다.
uk: Ghini дозволяє шукати в базі даних, використовуючи прості ключові слова, наприклад: назва місця або ім'я роду, або ви можете написати більш складні запити, які не досягають складності SQL, але дозволять вам гідний рівень деталізації локалізованих даних.

source: database agnostic
es: en su propia base de datos
it: indipendente dal database
ko: 데이터베이스 불가지론
uk: агностична база даних

source: Ghini is not a database management system, so it does not reinvent the wheel. It works storing its data in a SQL database, and it will connect to any database management system which accepts a SQLAlchemy connector. This means any reasonably modern database system and includes MySQL, PostgreSQL, Oracle. It can also work with sqlite, which, for single user purposes is quite sufficient and efficient. If you connect Ghini to a real database system, you can consider making the database part of a LAMP system (Linux-Apache-MySQL-Php) and include your live data on your institution web site.
es: Ghini no es un sistema de gestión de base de datos, ni intenta serlo. Ghini guarda la colección en una base de datos SQL, y se puede conectar a virtualmente cualquier sistema SQL para que exista un conector SQLAlchemy. En práctica esto incluye todos los más modernos sistemas relacionales, como MySQL, PostgreSQL, Oracle. También puede trabajar con SQLite, que, para usuarios independientes es un sistema muy eficiente y por supuesto más que suficiente. En combinación con un sistema de gestión SQL, es posible construir un sistema LAMP (Linux-Apache-MySQL-Php) o similar, e incluir la colección actualizada en el sitio web de su institución.
ko: Ghini는 데이터베이스 관리 시스템이 아니므로 운영 환경을 혁신하지 않습니다. 데이터를 SQL 데이터베이스에 저장하고 SQL 스키마 커넥터를 허용하는 데이터베이스 관리 시스템에 연결합니다. 이는 합리적인 최신 데이터베이스 시스템을 의미하며 MySQL, Postgre를 포함합니다.SQL, Oracle. 또한 sqlite와 함께 사용할 수 있습니다. sqlite는 단일 사용자 목적을 위해 매우 충분하고 효율적입니다. Ghini를 실제 데이터베이스 시스템에 연결하는 경우 데이터베이스를 LAMP 시스템(Linux-Apache-MySQL-Php)의 일부로 만들고 라이브 데이터를 기관 웹 사이트에 포함할 수 있습니다.
uk: Ghini не є системою управління базами даних, щоб не вигадувати знову колесо. Вона працює зберігаючи свої дані в базі даних SQL, і буде підключатися до будь-якої системи управління базами даних, яка приймає роз'єм SQLAlchemy. Це означає будь-яку досить сучасну систему управління базами даних і включає в себе MySQL, PostgreSQL, Oracle. Вона також може працювати з sqlite, що для цілей окремих користувачів цілком достатньо і ефективно. Якщо підключити Ghini до реальної системи бази даних, ви можете розглянути можливість зробити базу даних частиною системи LAMP (Linux-Apache-MySQL-Php) і включити ваші дані в реальному часі на вашому веб-сайті установи.

source: language agnostic
es: en su propio idioma
it: lingua agnostico
ko: 언어에 구애받지 않는
uk: агностична мова

source: The program was born in English and all its technical and user documentation is first written in that language. Both technical and user documentation use ``gettext``, an advanced tool for semi-automatic translation.
ko: 이 프로그램은 영어로 작성되었으며 모든 기술 및 사용자 설명서가 해당 언어로 작성되었습니다. 기술 문서와 사용자 문서 모두 반자동 번역을 위한 고급 도구인 "gettext"를 사용한다.

source: The program has been translated and can be used in various other languages, including Spanish (97%), French (82%), Portuguese (71%), to name some Southern American languages, as well as Ukrainian (100%) and Czech (71%).
ko: 이 프로그램은 번역되었으며 스페인어(97%), 프랑스어(82%), 포르투갈어(71%), 우크라이나어(100%), 체코어(71%) 등 다양한 언어로 사용될 수 있다.

source: Translation of documentation goes a bit slower, with only Ukrainian, Spanish and Italian at more than 50%.
ko: 문서 번역은 우크라이나어, 스페인어, 이탈리아어만 50%가 넘는 등 다소 더디게 진행되고 있습니다.

source: platform agnostic
es: en su propia plataforma software
it: indipendente dalla piattaforma
ko: 플랫폼에 구애받지 않는
uk: агностична платформа

source: Installing Ghini on Windows is an easy and linear process, it will not take longer than 10 minutes. Ghini was born on Linux and installing it on ubuntu, fedora or debian is consequently even easier. MacOSX being based on unix, it is possible to successfully run the Linux installation procedure on any recent Apple computer, after a few preparation steps.
es: Instalación de Ghini en Windows es un proceso fácil y lineal, no tarda más de 10 minutos. Ghini nació en Linux y lo instale en ubuntu, fedora o debian es por lo tanto más fácil. MacOSX se basa en unix, es posible ejecutar correctamente el procedimiento de instalación de Linux en cualquier ordenador Apple reciente, después de unos pasos de la preparación.
it: Installazione di Ghini su Windows è un processo semplice e lineare, ci vorranno non più di 10 minuti. Ghini nasce su Linux e installarlo su ubuntu, fedora o debian è di conseguenza ancora più facile. MacOSX essendo basato su unix, è possibile eseguire correttamente la procedura di installazione di Linux su qualsiasi computer Apple recenti, dopo alcuni passaggi di preparazione.
ko: Windows(윈도우)에 기니를 설치하는 것은 쉽고 선형적인 프로세스로, 10분 이상 걸리지 않습니다. 기니는 리눅스에서 태어났고 우분투, 페도라, 데비안에 설치하는 것이 결과적으로 훨씬 더 쉬워졌다. MacOSX는 유닉스 기반이므로 몇 가지 준비 단계를 거쳐 최신 Apple 컴퓨터에서 Linux 설치 절차를 성공적으로 실행할 수 있습니다.
uk: Встановлення Ghini в Windows - це простий і лінійний процес, займе не більше 10 хвилин. Ghini народився в Linux і встановити його на ubuntu, fedora або debian ще простіше. MacOSX заснований на unix, можна успішно запустити процедуру встановлення Linux на будь-якому нещодавньому комп'ютері Apple, після кількох кроків підготовки.

source: easily updated
es: facil puesta al día
it: facilmente aggiornabile
ko: 쉽게 업데이트되는
uk: легко оновлюється

source: The installation process will produce an updatable installation, where updating it will take less than one minute. Depending on the amount of feedback we receive, we will produce updates every few days or once in a while.
es: El proceso de instalación produce una instalación que, si deseado, se puede poner al día en menos que un minuto. Dependiendo de la cantidad de respuesta recibida, quien trabaja en Ghini produce una nueva distribución cada par de días o de vez en cuando.
it: Il processo di installazione produrrà un'installazione aggiornabile, dove l'aggiornamento avrà meno di un minuto. A seconda della quantità di feedback che riceviamo, produrremo aggiornamenti ogni pochi giorni o una volta in un po ' di tempo.
ko: 설치 프로세스에서는 업데이트 가능한 설치가 생성되며, 여기서 업데이트하는데 1분도 걸리지 않습니다. 피드백의 양에 따라 며칠에 한 번 또는 가끔씩 업데이트를 제공합니다.
uk: Процес установки буде створювати оновлювану установку, де оновлення займе менше ніж одну хвилину. Залежно від величини зворотного зв'язку, яку ми отримуємо, ми будемо проводити оновлення через кожні кілька днів або один раз в певний час.

source: unit tested
es: garantizado por pruebas unitarias
it: unit testata
ko: 단위 시험
uk: протестовані

source: Ghini is continuously and extensively unit tested, something that makes regression of functionality close to impossible. Every update is automatically quality checked, on the Travis Continuous Integration service. Integration of TravisCI with the github platform will make it difficult for us to release anything which has a single failing unit test.
es: Ghini es continuamente y unidad probado extensivamente, lo que hace la regresión de la funcionalidad cerca de imposible. Cada actualización es automáticamente calidad comprobado, en el servicio de integración continua de Travis. Integración de TravisCI con la plataforma de github resultará difícil para nosotros liberar todo lo que tiene una sola falla prueba.
it: Ghini è continuamente e ampiamente testato unità, qualcosa che rende la regressione di funzionalità quasi impossibile. Ogni aggiornamento è automaticamente qualità selezionata, il servizio di Travis Continuous Integration. Integrazione di TravisCI con la piattaforma github renderà difficile per noi a rilasciare qualcosa che ha un'unità singola in mancanza di prova.
ko: 기니는 지속적이고 광범위하게 유닛 테스트를 거쳤으며, 이는 기능 회귀를 거의 불가능하게 만드는 것이다. 모든 업데이트는 Travis Continuous Integration 서비스에서 자동으로 품질 검사를 받습니다. 트라비스의 통합github 플랫폼이 있는 CI는 단일 장애 장치 테스트를 가진 모든 것을 출시하는 것을 어렵게 만들 것입니다.
uk: Ghini постійно та екстенсивно перевіряється, дещо, що робить регрес функціональності близьким до неможливості. Кожне оновлення автоматично перевіряється, на Travis Continuous Integration службі. Інтеграція TravisCI з платформою github ускладнить для нас випуск будь-якого матеріалу, що має єдиний тест на несправність.

source: Most changes and additions we make, come with some extra unit test, which defines the behaviour and will make any undesired change easily visible.
es: Virtualmente cada cambio y extención que se hace en Ghini, va acompañada por unas nuevas pruebas unitarias, que define el comportamiento y evidenciará en el futuro cualquier cambio no deseado.
it: La maggior parte delle modifiche e aggiunte noi fare, venire con alcuni test di unità extra, che definisce il comportamento e farà qualsiasi cambiamento indesiderato facilmente visibile.
ko: 우리가 수행하는 대부분의 변경사항과 추가사항은 추가적인 단위 테스트를 동반하며, 이는 동작을 정의하고 원하지 않는 변경을 쉽게 눈에 띄게 한다.
uk: Більшість змін і доповнень, які ми робимо, приходять з деяким додатковим модульним тестуванням, яке визначає поведінку і робить будь-які небажані зміни добре видимі.

source: customizable/extensible
es: adaptable/extensible
ko: 맞춤화/사용할 수 없는
uk: настроюємий/розширяємий

source: Ghini is extensible through plugins and can be customized to suit the needs of the institution.
es: Ghini puede ser expandido a través de complementos (plugin), y puede ser adaptado según lo que necesite la institución que lo adopte.
it: Ghini è estensibile tramite plugin e può essere personalizzato per soddisfare le esigenze dell'istituzione.
ko: 기니는 플러그인을 통해 확장 가능하며 기관의 필요에 따라 맞춤화할 수 있다.
uk: Ghini розширюється за допомогою плагінів і може бути налаштований відповідно до потреб установи.

source: Importing and Exporting Data
es: Importación y exportación
it: Importare ed esportare dati
ko: 데이터 가져오기 및 내보내기
uk: Імпорт та експорт даних

source: Although Ghini can be extended through plugins to support alternate import and export formats, by default it can only import and export comma separated values files or CSV.
es: Aunque Ghini puede extenderse a través de complementos para soportar formatos alternativos de importación y exportación, por defecto sólo puede importar y exportar archivos de valores separados por comas o CSV.
it: Anche se Ghini può essere ampliato tramite plugin, così da poter supportare formati alternativi per importare ed esportare dati, per impostazione predefinita può solo importare ed esportare file di valori separati da virgola o CSV.
ko: Ghini는 플러그인을 통해 확장되어 대체 가져오기 및 내보내기 형식을 지원할 수 있지만 기본적으로 쉼표로 구분된 값 파일 또는 CSV만 가져오고 내보낼 수 있습니다.

source: There is some support for exporting to the Access for Biological Collections Data it is limited.
es: Hay algún apoyo para exportarlo al acceso de datos de colecciones biológicas es limitada.
it: C'è qualche supporto per l'esportazione dell'accesso per dati biologici collezioni è limitato.
ko: 제한된 생물학적 수집 데이터에 대한 액세스 권한으로 내보낼 수 있습니다.

source: There is also limited support for exporting to an XML format that more or less reflects exactly the tables and row of the database.
es: También hay soporte limitado para exportar a un formato XML que refleja más o menos exactamente las tablas y una fila de la base de datos.
it: C'è anche un supporto limitato per l'esportazione in formato XML che più o meno riflette esattamente le tabelle e la riga del database.
ko: 또한 데이터베이스의 테이블과 행을 정확히 반영하는 XML 형식으로 내보낼 수 있는 지원도 제한됩니다.
uk: Існує також обмежена підтримка експорту в форматі XML, який більш-менш точно відображає таблиці та рядки бази даних.

source: Exporting ABCD and XML will not be covered here.
es: Exportación de ABCD y XML será no cubierto aquí.
it: Esportazione di ABCD e XML non sono coperti qui.
ko: ABCD 및 XML 내보내기는 여기에서 다루지 않습니다.
uk: Експорт ABCD і XML не будуть тут розглядатися.

source: Importing files will most likely destroy any data you have in the database so make sure you have backed up your data.
es: Importación de archivos probablemente destruirá los datos que tienes en la base de datos, así que asegúrese de que usted tiene copia de sus datos.
it: Importazione di file molto probabilmente distruggerà tutti i dati che avete nel database in modo assicurarsi che avete eseguito il backup dei dati.
ko: 파일을 가져오면 데이터베이스에 있는 모든 데이터가 삭제될 가능성이 높으므로 데이터를 백업했는지 확인합니다.

source: Importing from CSV
es: Importar desde CSV
it: Importazione da
ko: CSV에서 가져오기

source: In general it is best to only import CSV files into Ghini that were previously exported from Ghini. It is possible to import any CSV file but that is more advanced that this doc will cover.
es: En general es mejor sólo importar archivos CSV a Ghini previamente exportados de Ghini. Es posible importar cualquier archivo CSV pero que está más avanzada que cubrirá este doc.
it: In generale è meglio solo importare i file CSV in Ghini che sono stati precedentemente esportati da Ghini. È possibile importare qualsiasi file CSV ma che è più avanzato che coprirà questo doc.
ko: 일반적으로 이것은 단지 Ghini 이전에 Ghini에서 외국으로 수출에 CSV파일을 가져오는 것이 가장 좋다.그것은 어떤 CSV파일을 가져오지만 그에게는 더 이렇습니다를 해결할 것이다 진보된 가능성이 있다.

source: To import CSV files into Ghini select :menuselection:`Tools-->Export-->Comma Separated Values` from the menu.
es: Para importar archivos CSV en Ghini seleccione :seleccione menú:`Herramientas - >Exportar-->Valores Separados por Comas " en el menú.
it: Per importare file CSV in Ghini selezionare :menuselection:`Strumenti--> esportazione--> valori separati da virgola` dal menu.
ko: CSV 파일을 Gini로 가져오려면 다음을 선택합니다. 메뉴 선택:메뉴에서 'Tools-->Export-->Comma Separated Values'를 선택합니다.

source: After clicking OK on the dialog that ask if you are sure you know what you're doing a file chooser will open. In the file chooser select the files you want to import.
es: Tras pulsar OK en el diálogo que solicita confirmación de la acción, se abrirá un selector de fichero. Seleccione los ficheros que desee importar en el selector de ficheros.
it: Dopo facendo clic su OK nella finestra di dialogo che chiede se sei sicuro di che sapere quello che stai facendo si aprirà una finestra di selezione file. Nella finestra selezione file selezionare i file che si desidera importare.
ko: 대화 상자에서 [확인]을 클릭하면 파일 선택기가 열립니다. 파일에서 가져올 파일을 선택합니다.

source: Exporting to CSV
es: Exportar a CSV
it: Esportazione in CSV
ko: CSV로 내보내기

source: To export the Ghini data to CSV select :menuselection:`Tools-->Export-->Comma Separated Values` from the menu.
es: Para exportar los datos de Ghini en formato CSV, seleccionar en el menu :menuselection:`Tools-->Export-->Comma Separated Values`
it: Per esportare i dati di Ghini in formato CSV selezionare :menuselection:`Strumenti--> esportazione--> valori separati da virgola` dal menu.
ko: Ghini 데이터를 CSV로 내보내려면 다음을 선택합니다. 메뉴 선택:메뉴에서 'Tools-->Export-->Comma Separated Values'를 선택합니다.

source: This tool will ask you to select a directory to export the CSV data. All of the tables in Ghini will be exported to files in the format tablename.txt where tablename is the name of the table where the data was exported from.
es: Esta herramienta le pedirá que seleccione un directorio para exportar los datos CSV. Todas las tablas en Ghini se exportarán a los archivos en el formato tablename.txt donde NombreTabla es el nombre de la tabla donde los datos se exportan desde.
it: Questo strumento vi chiederà di selezionare una directory per esportare i dati in CSV. Tutte le tabelle in Ghini verranno esportate ai file in tablename.txt il formato dove tablename è il nome della tabella dove è stati esportati i dati da.
ko: 이 툴은 디렉터리는 CSV데이터를 내보낼 선택하라고 물어볼 것입니다.모든 Ghini의 표의 파일로 형식을 tablename에 수출될 것이다.Txt 데이터가 어디에서 내보내던 테이블의 tablename의 이름이다.

source: Importing from JSON
es: Importación de JSON
it: Importare da JSON
ko: JSON에서 가져오기
uk: Імпорт з JSON

source: This is *the* way to import data into an existing database, without destroying previous content. A typical example of this functionality would be importing your digital collection into a fresh, just initialized Ghini database. Converting a database into bauble json interchange format is beyond the scope of this manual, please contact one of the authors if you need any further help.
es: Es * la * manera de importar datos en una base de datos existente, sin destruir el contenido anterior. Un ejemplo típico de esta funcionalidad sería importar su colección digital en una base de datos de Ghini fresco, sólo inicializado. Convertir una base de datos en formato de intercambio de json de adorno es más allá del alcance de este manual, por favor contacto uno de los autores si usted necesita cualquier ayuda adicional.
it: Questo è * il * modo per importare dati in un database esistente, senza distruggere il contenuto precedente. Un tipico esempio di questa funzionalità potrebbe essere importazione tua collezione digitale in un database di Ghini fresco, appena inizializzato. Conversione di un database in formato di interscambio di json Bauble esula dall'ambito del presente manuale, si prega contattare uno degli autori se avete bisogno di ulteriore aiuto.
ko: 이것은*the* 방법 기존 데이터베이스에 등록하고, 이전의 내용을 파괴하지 않고 데이터 가져올 수 없습니다.이 기능성의 전형적인 예는 신선한, 단지 초기화되 Ghini 데이터베이스에 디지털 컬렉션 많이 수입하게 될 것이다.싸구려 보석json 교환 형식에 데이터베이스 변환 이 매뉴얼의 범위 밖이다 만약 추가 도움이 필요하면 하나를 작가로 연락하십시오.
uk: Цей *the * спосіб для імпорту даних в існуючу базу даних, не руйнуючи попередній вміст. Типовий приклад цієї функції буде імпорт вашої цифрової колекції в нові, тільки розміщені бази даних Ghini. Перетворення бази даних в bauble json формат обміну виходить за рамки даного керівництва, будь ласка, зв'яжіться з одним з авторів, якщо вам потрібна додаткова допомога.

source: Using the Ghini json interchange format, you can import data which you have exported from a different Ghini installation.
es: Utilizando el formato de intercambio de json Ghini, puede importar datos que han exportado desde una instalación diferente de Ghini.
it: Utilizzando il formato di scambio JSON, è possibile esportare dati da una versione di Ghini ed importarli in una versione differente.
ko: Ginijson 교환 형식을 사용하면 다른 Gini 설치에서 내보낸 데이터를 가져올 수 있습니다.
uk: Використовуючи формат обміну Ghini json, ви можете імпортувати дані, які ви експортували з іншої установки Ghini.

source: Exporting to JSON
es: Exportación a JSON
it: Esportare verso JSON
ko: JSON으로 내보내기
uk: Експорт у JSON

source: This feature is still under development.
es: Esta función está todavía en desarrollo.
it: Questo è ancora “lavori in corso”.
ko: 이 기능은 아직 개발 중입니다.

source: when you activate this export tool, you are given the choice to specify what to export. You can use the current selection to limit the span of the export, or you can start at the complete content of a domain, to be chosen among Species, Accession, Plant.
es: al activar esta herramienta de exportación, le dan la opción para especificar qué exportar. Puede usar la selección actual a limitar la duración de la exportación, o puede empezar en el contenido completo de un dominio a elegir entre especies, accesión, planta.
it: Quando si attiva questo strumento di esportazione, si è data la scelta di specificare cosa esportare. È possibile utilizzare la selezione corrente per limitare l'intervallo di esportazione, oppure è possibile avviare il contenuto completo di un dominio, a scelta tra specie, accessione, pianta.
ko: 이 내보내기 도구를 활성화하면 내보낼 항목을 지정할 수 있습니다. 현재 선택 항목을 사용하여 내보내기 범위를 제한하거나, 종, 등록, 식물 중에서 선택할 도메인의 전체 내용에서 시작할 수 있습니다.
uk: коли ви активуєте цей інструмент експорту, вам надається право вибору експорту. Ви можете використовувати поточний вибір щоб обмежити діапазон експорту, або ви можете почати з повним змістом домену, вибравши серед видів, приєднань, рослин.
