Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Queries allow the most control over searching. With queries you can search across relations, specific columns, combine search criteria using boolean operators like ``and``, ``or``, ``not`` (and their shorthands ``&&``, ``||``, ``!``), enclose them in parentheses, and more.
es: Las consultas "Query" permiten el máximo control de búsqueda. Con consultas usted puede buscar a través de las relaciones, columnas específicas, combinar criterios de búsqueda utilizando operadores booleanos como ``and``, ``or``, ``not``, y sus abreviaciones ``&&``, ``||``, ``!``, encerrar en paréntesis, y más.
it: Le query consentono il massimo controllo su ricerca. Con le query è possibile cercare attraverso relazioni, colonne specifiche, combinare i criteri di ricerca utilizzando gli operatori booleani come ``and``, ``or``, ``not`` (e loro rispettiva abbreviazioni ``&&``, ``||``, ``!``).
ko: 쿼리를 사용하면 검색을 최대한 제어할 수 있습니다. 여러 관계에 걸쳐 검색할 수 있는 질의와 함께 특정 열을 검색하고 ``and", "or", "not", "not" 등의 부울 연산자를 사용하여 검색 기준을 결합할 수 있으며, 이들의 속어인 "&&&n't"("|", "!")는 괄호 안에 묶을 수 있다.
uk: Запити дозволяють максимально контролювати пошук. За допомогою запитів ви можете здійснювати пошук по відношенню до певних стовпчиків, комбінуючи критерії пошуку за допомогою логічних операторів, таких як ``and``, ``or``, ``not`` (і їх скорочення ``&&``, ``||``, ``!``) додайте їх у дужки, та багато іншого.

source: Please contact the authors if you want more information, or if you volunteer to document this more thoroughly. In the meanwhile you may start familiarizing yourself with the core structure of Ghini's database.
es: Póngase en contacto con los autores si desea más información, o si usted voluntario para documentar esto más a fondo. Mientras tanto pueden empezar a familiarizarse con la estructura de base de base de datos de Ghini.
it: Se volete maggiori informazioni, o volontariare per documentare questo più a fondo, si prega di contattare gli autori. Nel frattempo si può iniziare a familiarizzare con la struttura di base del database di Ghini.
ko: 더 많은 정보를 원하거나 이 내용을 더 철저히 문서화할 경우 작성자에게 문의하십시오. 그 동안 여러분은 기니의 데이터베이스의 핵심 구조를 익히기 시작할 수 있습니다.
uk: Будь ласка, зв'яжіться з авторами, якщо ви хочете отримати додаткову інформацію, або якщо ви добровільно документуєте це докладніше. Тим часом ви можете почати ознайомитися з основною структурою бази даних Ghini.

source: A few examples:
es: Para nombrar algunos ejemplos:
it: Alcuni esempi:
ko: 몇 가지 예:
uk: Кілька прикладів:

source: plantings of family Fabaceae in location Block 10::
es: plantaciones de la familia Fabaceae en ubicación bloque 10::
it: piante della famiglia delle Fabaceae in posizione Blocco 10::
ko: 위치 블록 10에 있는 파바과(Fabaceae) 패밀리의 심기:
uk: насадження сімейства Fabaceae в місці розташування Блок 10::

source: locations that contain no plants::
es: lugares que no contienen plantas::
it: posizioni che non contengono piante::
ko: 발전소가 없는 위치:
uk: місця, де немає рослин::

source: accessions associated to a species of known binomial name (e.g.: Mangifera indica)::
es: accesiones, asociados a una especie de conocido nombre binomial (p. ej.: Mangifera indica)::
it: accessioni associate ad una specie dal nome binomiale noto (es.: Mangifera indica)::
ko: 알려진 이항 이름의 종과 관련된 접근법(예: 망기페라 표시기::
uk: приєднання, пов'язані з видом відомих біномічних назв (наприклад, Mangifera indica)::

source: accessions we propagated in the year 2016::
es: accesiones propagó en el año 2016::
it: accessioni propagate nell'anno 2016::
ko: 2016년에 전파된 액세스:
uk: приєднання ми поширювали в 2016 році::

source: accessions we modified in the last three days::
es: accesiones que modificó en los últimos tres días::
it: accessioni modificate negli ultimi tre giorni::
ko: 지난 3일 동안 수정한 액세스 권한:
uk: приєднання, які ми змінили за останні три дні::

source: Searching with queries requires some knowledge of a little syntax and an idea of the extensive Ghini database table structure. Both you acquire with practice, and with the help of the Query Builder.
es: Búsqueda con las consultas requiere algunos conocimientos de la sintaxis un poco y una idea de la extensa estructura de tabla de base de datos de Ghini. Ambos adquieren con la práctica y con la ayuda del generador de consultas.
it: Ricerca per query richiede qualche conoscenza della sintassi ed un'idea della estesa struttura del database Ghini. Entrambe si acquisiscono con la pratica e magari con l'aiuto del Generatore di Query.
ko: 쿼리를 사용하여 검색하려면 약간의 구문과 광범위한 Ghini 데이터베이스 테이블 구조에 대한 아이디어가 필요합니다. 두 가지 모두 연습과 쿼리 작성기의 도움을 통해 습득합니다.
uk: Пошук за запитами вимагає певних знань про маленький синтаксис та ідеї про велику структуру таблиці Ghini. Обидва ви придбаєте з практикою і за допомогою Query Builder.

source: The Query Builder
es: El generador de consultas
it: Generatore di Query
ko: 쿼리 작성기
uk: Query Builder

source: Ghini offers a Query Builder, that helps you build complex search queries through a point and click interface. To open the Query Builder click the |querybuilder| icon to the left of the search entry or select :menuselection:`Tools-->Query Builder` from the menu.
es: Ghini ofrece un generador de consultas, que le ayuda a construir consultas complejas de búsqueda a través de un punto y haga clic en interfaz. Para abrir el clic Query Builder el | querybuilder | icono a la izquierda de la entrada de búsqueda o seleccione: menuselection: 'Herramientas--> generador de consultas' en el menú.
it: Ghini offre un generatore di Query, una interfaccia grafica che aiuta a costruire query di ricerca anche complesse. Per aprire il Generatore di Query fare clic sull'icona |querybuilder| a sinistra della voce di ricerca o selezionare :menuselection:`Strumenti-->Query Builder` dal menu.
ko: Ghini는 포인트와 클릭 인터페이스를 통해 복잡한 검색 쿼리를 만들 수 있는 쿼리 작성기를 제공합니다. 쿼리 작성기를 열려면 검색 항목 왼쪽에 있는 |querybuilder| 아이콘을 클릭하거나 : 메뉴 선택:메뉴에서 'Tools-->Query Builder'를 선택합니다.
uk: Query Builder дозволяє будувати складні пошукові запити через вказування і натискання в інтерфейсі. Для того, щоб відкрити Query Builder натисніть |querybuilder| іконку зліва від входу пошуку або виберіть :menuselection:`Tools-->Query Builder` в меню.

source: A window will show up, which will lead you through all steps necessary to construct a correct query that is understood by Ghini's Query Search Strategy.
es: Una ventana aparecerá, que le llevará a través de todos los pasos necesarios para construir una consulta correcta que se entiende por estrategia de búsqueda de consulta de Ghini.
it: Una finestra apparirà, che vi guiderà attraverso tutti i passaggi necessari per creare una query corretta che sarà compresa dalla strategia di Ricerca per Query di Ghini.
ko: Ghini의 쿼리 검색 전략에 의해 이해되는 올바른 쿼리를 구성하는 데 필요한 모든 단계를 안내하는 창이 나타납니다.
uk: З'явиться вікно, яке веде вас до всіх кроків, необхідних для побудови правильного запиту, який розуміється в стратегії пошуку запиту Ghini.

source: First of all you indicate the search domain, this will allow the Query Builder complete its graphical user interface, then you add as many logical clauses as you need, connecting them with a ``and`` or ``or`` binary operator.
es: En primer lugar indica el dominio de búsqueda, esto permitirá que el generador de consultas completo su interfaz gráfica de usuario, luego añades tantas cláusulas lógicas como usted necesita, conectándolas con una '' y '' o '' o '' operador binario.
it: Prima di tutto si indica il dominio di ricerca, questo vi permetterà il generatore di Query completa la sua interfaccia grafica, quindi si aggiunge il numero di clausole logico necessario, collegandoli con operatore binario ``and`` o ``or``.
ko: 먼저 검색 도메인을 나타내면 쿼리 작성기가 그래픽 사용자 인터페이스를 완료할 수 있으며, 필요한 만큼 논리 절을 추가하여 "and" 또는 "or" 이진 연산자와 연결합니다.
uk: Насамперед, ви вказуєте пошуковий домен, це дозволить Query Builder завершити свій графічний інтерфейс, після чого ви додасте стільки логічних статей, скільки потрібно, підключаючи їх ``and`` або ``or`` бінарним оператором.

source: Each clause is formed of three parts: a property that can be reached from the starting search domain, a comparison operator that you select from the drop-down list, a value that you can either type or select from the list of valid values for the field.
es: Cada apartado está formado por tres partes: una propiedad que se puede llegar desde el inicial dominio de búsqueda, un operador de comparación que seleccione de la lista desplegable, un valor que puede escribir o seleccionar de la lista de valores válidos para el campo.
it: Ogni clausola è formata da tre parti: una proprietà che può essere raggiunto dal dominio di ricerca iniziale, un operatore di confronto che si seleziona dall'elenco a discesa, un valore che è possibile digitare o selezionare dall'elenco di valori validi per il campo.
ko: 먼저 검색 도메인을 나타내면 쿼리 작성기가 그래픽 사용자 인터페이스를 완료할 수 있으며, 필요한 만큼 논리 절을 추가하여 "and" 또는 "or" 이진 연산자와 연결합니다.
uk: Кожен розділ складається з трьох частин: властивості, які можна отримати з початкового домену пошуку, оператор зіставлення, який ви вибираєте з розкривного списку, значення, яке ви можете ввести або вибрати зі списку дійсних значень для поля.

source: Add as many search properties as you need, by clicking on the plus sign. Select and/or next to the property name to choose how the clauses will be combined in the search query.
es: Agregar muchos buscar propiedades como usted necesita, haciendo clic en el signo más. Seleccione o próximo al nombre de propiedad para elegir cómo se combinarán las cláusulas en la consulta de búsqueda.
it: Aggiungere altrettante proprietà di ricerca quante necessarie, facendo clic sul segno più. Selezionare ``and`` / ``or`` al lato dal nome della proprietà, per scegliere come combinare le clausole nella query.
ko: 더하기 기호를 클릭하여 필요한 만큼의 검색 속성을 추가합니다. 속성 이름 옆에 및/또는 항목을 선택하여 검색 질의에서 절의 결합 방법을 선택합니다.
uk: Додайте якомога більше властивостей пошукових систем, натиснувши знак плюс. Виберіть та/або біля назви властивості, щоб вибрати, які об'єкти будуть об'єднані в пошуковому запиті.

source: When you are done building your query click OK to perform the search.
es: Cuando haya terminado de construir la consulta haga clic en Aceptar para realizar la búsqueda.
it: Quando si è finito di costruire la query fare clic su OK per eseguire la ricerca.
ko: 쿼리를 작성했으면 확인을 클릭하여 검색을 수행합니다.
uk: Коли ви закінчите створення свого запиту натисніть кнопку OK, щоб виконати пошук.

source: At this point the Query Builder writes the query in the search entry, and executes it. You may now edit the string as if you had typed it yourself. Notice how the left hand side values are interpreted by the query builder and enclosed in single quotes if recognized as strings, left alone if they look like numbers or the two reserved words ``None`` and ``Empty``. You may edit the query and insert quotes if you need them, eg if you need to literally look for the string ``Empty``.
es: En este momento el generador de consultas escribe la consulta en el campo de búsqueda y la ejecuta. Ahora puedes editar la secuencia como si hubiera escrito usted mismo. Observe cómo los valores de lado de mano derecha son interpretados por el generador de consultas y encerrados en comillas simples si los reconoce como cadenas, dejados como están si se ven como números ó son uno de los dos textos reservados ``None`` o ``Empty``. Usted puede editar la consulta e insertar comillas si necesita, por ejemplo, si usted necesita buscar literalmente la cadena ``Empty``.
it: A questo punto il generatore di Query scrive la query nella voce Cerca e lo esegue. Adesso si può editare la stringa come fosse stata inserita manualmente. Si noti come i valori alla sinistra vengono interpretati dal generatore di query e racchiusi tra virgolette singole se riconosciuto come stringhe, o lasciati senza virgolette se sono numeri o i due riservati parole ``None`` e ``Empty``. Si può modificare la query e inserire virgolette se necessario, ad esempio se avete bisogno di cercare letteralmente la stringa ``Empty``.
ko: 이때 쿼리 작성기는 검색 항목에 쿼리를 작성하고 실행합니다. 이제 문자열을 직접 입력한 것처럼 편집할 수 있습니다. 왼쪽 값은 쿼리 작성기에 의해 해석되고 문자열로 인식되면 작은 따옴표로 묶이고 숫자처럼 보이면 내버려 두거나 "없음"과 "비어 있음"이라는 두 개의 예약된 단어이다. 문자 그대로 "빈" 문자열을 찾아야 하는 경우 등 필요한 경우 쿼리를 편집하고 따옴표를 삽입할 수 있습니다.
uk: На цьому етапі конструктор запитів записує запит у записі пошуку та виконує його. Тепер ви можете редагувати рядок так, ніби ви набрали його самостійно. Зверніть увагу, як значення інтер'єру лівої сторони інтерпретуються забудовником запиту та додаються в окремі лапки, якщо вони визнані як рядки, залишатись окремо, якщо вони виглядають як цифри або два зарезервовані слова ``None`` та ``Empty``. Ви можете відредагувати запит і вставляти лапки, якщо вони вам потрібні, наприклад, якщо вам потрібно буквально шукати рядок ``Empty``.

source: ``None`` is the value of an empty field. It is not the same as the zero lenght string ``''`` nor the numeric ``0`` nor the boolean ``False`` nor the set ``Empty``, it indicates that the field has no value at all.
es: ``None`` es el valor de un campo vacío. No es lo mismo que la cadena larga cero ``''`` ni el numérico ``0`` ni el boolean ``False`` ni el set ``Empty``: ``None`` indica que el campo no tiene valor en absoluto.
it: ``None`` è il valore di un campo vuoto. Non è la stessa che la stringa di lunghezza zero ``''`` né il numero ``0`` né il booleano ``False`` né l'insieme ``Empty``: ``None`` indica che al campo non è associato alcun valore.
ko: "없음"은 빈 필드의 값입니다. 제로라이트 문자열 ''''''도 숫자 ''0''도 부울 '거짓'도 '빈'도 아닌 이 분야는 전혀 가치가 없음을 나타낸다.
uk: ``None`` - це значення порожнього поля. Це не те ж саме, що рядок нульової довжини ``''``, ані числове ``0``, ані логічне ``False``, ані встановлення ``Empty``, це означає, що поле не має значення Все.

source: ``Empty`` is the empty set. Being it a set, it can be matched against sets (eg: plants of an accession, or accessions of a species), not against elements (eg: quantity of a plant or description of a location). However, the Query Builder does not let you choose a left hand side value stopping at a set, it expects you to select a field. Choose just any field: at the moment of producing the query, when the Query Builder meets a clause with right hand side value the literal string ``Empty``, it will drop the field name and let you compare the set on the left with ``Empty`` on the right.
es: ``Empty`` es el conjunto vacío. Siendo un conjunto, puede ser comparado con otros conjuntos (por ejemplo: todas plantas de una accesión o todas accesiones de una especie), no con elementos (por ejemplo: cantidad de una planta, que es un número, o una descripción de un lugar, que es un texto). Sin embargo, el generador de consultas no le permite elegir un valor de lado de mano izquierda en un conjunto, sino que espera la selección de un campo. Escoja cualquier campo: en el momento de producción de la consulta, cuando el generador de consultas se encuentra con una cláusula con valor de lado de mano derecha el literal ``Empty``, el nombre del campo es ignorado y le permite comparar el conjunto de la izquierda con el ``Empty`` de la derecha.
ko: '텅 빈'은 빈 집합이다. 집합이기 때문에 요소(예: 식물의 양 또는 위치의 설명)가 아닌 집합(예: 등록의 식물 또는 종의 접근)과 일치할 수 있다. 그러나 쿼리 작성기는 집합에서 중지되는 왼쪽 값을 선택할 수 있도록 하지 않으며 필드를 선택할 것으로 예상합니다. 임의의 필드만 선택하십시오. 쿼리를 생성하는 순간에 쿼리 작성기가 오른쪽 문자열이 "비어 있음"인 절을 만나면 필드 이름이 삭제되고 왼쪽에 있는 집합을 오른쪽의 "비어 있음"과 비교할 수 있습니다.
uk: ``Empty`` є порожнім набором. Будучи набором, він може бути узгоджений з наборами (наприклад: рослини приєднання або приєднання одного виду), не проти елементів (наприклад, кількість рослини або опис місця розташування). Тим не менш, Query Builder не дозволяє вибирати зупинку значень лівої сторони при встановленні, він сподівається, що ви виберете поле. Виберіть будь-яке поле: на момент створення запиту, коли Builder Query відповідає умовам з правою частиною значення буквеного рядка ``Empty``, він виведе поле назви і дозволить вам порівняти набір зліва з ``Empty`` справа.

source: We have no literals ``False`` and ``True``. These are typed values, and the Query Builder does not know how to produce them. Instead of ``False`` type ``0``, and instead of ``True`` type ``1``.
es: No tenemos literales ``False`` y ``True``. Estos son valores con tipo, y el generador de consultas no sabe cómo producirlos. En lugar de ``False`` escriba ``0`` y en lugar de ``True`` escriba ``1``.
ko: 우리에게는 문자 그대로의 '거짓'과 '참'이 없다. 이 값은 입력된 값이며 쿼리 작성기는 해당 값을 생성하는 방법을 알지 못합니다. '거짓'이 아닌 '0', '진실'이 아닌 '1'이다.
uk: У нас немає друкарських букв ``False`` і ``True``. Це типи значення, і Query Builder не вміє їх випускати. Замість ``False`` введіть ``0``, а замість ``True`` ``1`` тип.

source: For those who don't fear a bit of formal precision, the following BNF code gives you a rather precise idea of the grammar implemented by the Query Search Strategy. Some grammatical categories are informally defined; any missing ones are left to your fertile imagination; literals are included in single quotes; the grammar is mostly case insensitive, unless otherwise stated::
es: Para los que no temen un poco de precisión formal, el código siguiente BNF te da una idea bastante precisa de la gramática aplicada la estrategia de búsqueda de la consulta. Informalmente se definen algunas categorías gramaticales; cualquier falta que quedan a su fértil imaginación; los literales se incluyen comillas simples; la gramática es sobre todo mayúsculas y minúsculas, a menos que se indique lo contrario::
it: Per coloro che non temono un po' di precisione formale, il codice BNF seguente vi dà un'idea piuttosto precisa della grammatica implementata dalla strategia di Ricerca per Query. Alcune categorie grammaticali sono informalmente definite; alcune mancano e sono lasciate alla vostra fertile immaginazione; i valori letterali sono inclusi tra virgolette singole; la grammatica non fa differenza tra maiuscole e minuscole, se non diversamente indicato::
ko: 공식적인 정밀도를 조금도 두려워하지 않는 사람들을 위해, 다음의 BNF 코드는 질의 검색 전략에 의해 구현된 문법에 대한 다소 정확한 아이디어를 제공한다. 일부 문법 범주는 비공식적으로 정의되고, 누락된 범주는 여러분의 풍부한 상상력에 맡겨집니다. 리터럴은 작은 인용문에 포함되어 있습니다. 문법은 다음과 같은 경우를 제외하고 대부분 대소문자를 구분하지 않습니다::
uk: Для тих, хто не боїться дещо формальної точності, наступний код BNF дає точне уявлення про граматику, яку реалізує Стратегія пошуку запитів. Деякі граматичні категорії визначаються неформально; будь-які зниклі з них залишаються у вашій родючій уяві; літери беруться в одинарні лапки; граматика в основному нечутлива, якщо не вказано інше::

source: Please be aware that Ghini's Query language is quite a bit more complex than what the Query Builder can produce: Queries you can build with the Query Builder form a proper subset of the queries recognized by the software::
es: Tenga en cuenta que el lenguaje de consulta de Ghini es bastante un poco más complejo que lo que puede producir el generador de consultas: las consultas se pueden construir con el generador de consultas forman un subconjunto apropiado de consulta reconocido por el software::
it: Si prega di essere consapevoli del fatto che il linguaggio di Query di Ghini è più complesso di quello descritto dal Generatore di Query: le query costruibili con il Generatore di Query costituiscono un sottoinsieme proprio delle query riconosciute dal software::
ko: Ghini의 Query 언어는 Query Builder가 생성할 수 있는 것보다 훨씬 더 복잡합니다. 쿼리 작성기로 작성할 수 있는 쿼리는 소프트웨어가 인식하는 쿼리의 적절한 하위 집합을 구성합니다::
uk: Будь ласка, пам'ятайте, що мова запиту Ghini є набагато складнішою, ніж те, що може створити Query Builder: запити, які ви можете побудувати за допомогою Query Builder, є правильною підмножиною запитів, визнаних програмним забезпеченням::

source: Initial Configuration
es: Configuración Inicial
it: Configurazione iniziale
ko: 초기 구성
uk: Початкова конфігурація

source: After a successful installation, more complex organizations will need configure their database, and configure Ghini according to their database configuration. This page focuses on this task. If you don't know what this is about, please do read the part relative to SQLite.
es: Después de una instalación exitosa, las organizaciones más complejas necesitarán configurar su base de datos y por consecuencia Ghini. Esta página se enfoca en esta tarea. Si no tiene ni idea de qué estamos hablando, por favor siga no más con la parte relativa a SQLite.
it: Dopo una corretta installazione, organizzazioni più complesse vorranno configurare il loro database e configurare Ghini secondo la loro configurazione del database. Questa pagina si concentra su questo compito. Se non hai idea di cosa si tratti, meglio continuare la lettura con la parte relativa a SQLite.
ko: 설치가 성공적으로 완료되면 보다 복잡한 조직에서 데이터베이스를 구성하고 데이터베이스 구성에 따라 Ghini를 구성해야 합니다. 이 페이지는 이 작업에 초점을 맞춥니다. 무슨 내용인지 모르면 SQLite 관련 부분을 읽어주세요.
uk: Після успішної установки більш складні організації повинні налаштувати свою базу даних і налаштувати Ghini відповідно до їх конфігурації. Ця сторінка зосереджена на цьому завданні. Якщо ви не знаєте, чого це стосується, будь ласка, прочитайте частину щодо SQLite.

source: Should you SQLite?
es: Que tal SQLite?
it: E se fosse SQLite?
ko: SQLite를 해야 합니까?
uk: У вас SQLite?

source: Is this the first time you use Ghini, are you going to work in a stand-alone setting, you have not the faintest idea how to manage a database management system? If you answered yes to any of the previous, you probably better stick with SQLite, the easy, fast, zero-administration file-based database.
es: ¿Esta es la primera vez que utiliza Ghini? ; ¿trabaja usted sólo en su ordenador personal? ; ¿no tiene ni la menor idea de cómo manejar un sistema de gestión de base de datos? ; Si respondiste sí a cualquiera de las anteriores, probablemente mejor quédese con SQLite, la base de datos fácil, rápida, cero administración basada en un sólo archivo.
it: Questa è la prima volta che si utilizza Ghini, sono stai andando a lavorare in un ambiente autonomo, avete non la più pallida idea come gestire un sistema di gestione di database? Se avete risposto sì a uno qualsiasi dei precedenti, è probabilmente meglio restare con SQLite, il database facile, veloce, senza doveri di amministrazione, tutto basato su file, il database più diffuso al mondo.
ko: Ghini를 처음 사용하는 경우, 독립 실행형 환경에서 작업할 예정인데 데이터베이스 관리 시스템을 관리하는 방법을 전혀 모르십니까? 이전에 "예"라고 대답한 경우 쉽고 빠른 제로 관리 파일 기반 데이터베이스인 SQLite를 사용하는 것이 좋습니다.
uk: Це вперше ви використовуєте Ghini, ви збираєтеся працювати в автономному режимі, у вас немає найменшої ідеї управління системою керування базою даних? Якщо ви відповіли так на будь-який з запитань, вам, напевно, краще дотримуватися бази даних на базі файлів SQLite, легкої, швидкої, з нульовою адміністрацію.

source: With SQLite, you do not need any preparation and you can continue with `connecting`_.
es: Con SQLite, no hace falta preparar nada y puede seguir con `connecting`_.
it: Con SQLite non c'è bisogno di preparare altro e si può proseguire con `connecting`_.
ko: SQLite를 사용하면 아무런 준비도 필요하지 않으며 '연결'을 계속할 수 있습니다.
uk: З SQLite, вам не потрібно ніякої підготовки, і ви можете продовжити `connecting`_.
