Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: We use the same architectural pattern for non-database interaction, by setting the presenter also as model. We do this, for example, for the JSON export dialog box. The following command will give you a list of ``GenericEditorView`` instantiations::
es: Se utiliza el mismo patrón arquitectónico de interacción no-base de datos, estableciendo el presentador también como modelo. Para ello, por ejemplo, el cuadro de diálogo de exportación JSON. El siguiente comando le dará una lista de instancias de ``GenericEditorView``::
it: Usiamo lo stesso schema architettonico per l'interazione non di database, impostando il presentatore anche come modello. Facciamo questo, ad esempio, per la finestra di dialogo Esporta JSON. Il seguente comando vi darà un elenco di istanze di ``GenericEditorView``::
ko: 발표자를 모델로 설정하여 데이터베이스가 아닌 상호 작용에 동일한 아키텍처 패턴을 사용합니다. 예를 들어 JSON 내보내기 대화 상자에 대해이 작업을 수행합니다. 다음 명령은``GenericEditorView ''인스턴스화 목록을 제공합니다::
uk: Ми використовуємо той самий архітектурний шаблон для взаємодії, що не пов'язаний з базою даних, шляхом встановлення ведучого також як модель. Ми робимо це, наприклад, для діалогового вікна експорту JSON. Наступна команда дасть вам список ``GenericEditorView`` інстанцій::

source: Extending Ghini with Plugins
es: Ghini extensible con Plugins
it: Tavolo allungabile Ghini con plugin
ko: 플러그인으로 Ghini 확장
uk: Розширення Ghini з плагінами

source: Nearly everything about Ghini is extensible through plugins. Plugins can create tables, define custom searchs, add menu items, create custom commands and more.
es: Casi todo en Ghini es extensible mediante plugins. Un Plugin puede crear tablas, definir búsquedas personalizadas, agregar elementos de menú, crear comandos personalizados y mucho más.
it: Quasi tutto di Ghini è estensibile tramite plugin. Plugin può creare tabelle, definire ricerche personalizzate, aggiungere voci di menu, creare comandi personalizzati e altro ancora.
ko: Ghini에 관한 거의 모든 것은 플러그인을 통해 확장 할 수 있습니다. 플러그인은 테이블 생성, 사용자 지정 검색 정의, 메뉴 항목 추가, 사용자 지정 명령 생성 등을 수행 할 수 있습니다.
uk: Майже все Ghini розширюється за допомогою плагінів. Плагіни можуть створювати таблиці, визначати власні пошукові запити, додавати пункти меню, створювати власні команди та багато іншого.

source: To create a new plugin you must extend the ``bauble.pluginmgr.Plugin`` class.
es: Para crear un nuevo plugin debe extender la clase de ``bauble.pluginmgr.Plugin``.
it: Per creare un nuovo plugin è necessario estendere la classe ``bauble.pluginmgr.Plugin``.
ko: 새 플러그인을 생성하려면``bauble.pluginmgr.Plugin ''클래스를 확장해야합니다.
uk: Щоб створити новий плагін вам необхідно розширити ``bauble.pluginmgr.Plugin`` клас.

source: The ``Tag`` plugin is a good minimal example, even if the ``TagItemGUI`` falls outside the Model-View-Presenter architectural pattern.
es: La ``Tag`` es un ejemplo mínimo, incluso si el ``TagItemGUI`` cae fuera el patrón de arquitectura Model-View-Presenter.
it: Il plugin ``Tag`` è un buon esempio minimo, anche se il ``TagItemGUI`` rientra il pattern architetturale Model-View-Presenter.
ko: ``Tag ''플러그인은``TagItemGUI``가 Model-View-Presenter 아키텍처 패턴을 벗어나더라도 좋은 최소한의 예입니다.
uk: Плагін ``Tag`` є гарним мінімальним прикладом, навіть якщо ``TagItemGUI`` виходить за рамки моделі архітектури Model-View-Presenter.

source: Plugins structure
es: Estructura de plugins
it: Struttura del plugin
ko: 플러그인 구조
uk: Структура плагінів

source: Ghini is a framework for handling collections, and is distributed along with a set of plugins making Ghini a botanical collection manager. But Ghini stays a framework and you could in theory remove all plugins we distribute and write your own, or write your own plugins that extend or complete the current Ghini behaviour.
es: Ghini es un marco para el manejo de colecciones y se distribuye junto con un conjunto de plugins haciendo Ghini un gerente de colección botánica. Pero Ghini mantiene un marco y podría en teoría quitar todos los plugins que distribuir y escribir su propio, o escribir tus propios plugins que ampliar o completar el actual comportamiento de Ghini.
it: Ghini è un framework per la gestione delle collezioni e viene distribuito insieme a una serie di plugin rendendo Ghini un manager collezione botanica. Ma Ghini rimane un quadro e si potrebbe in teoria rimuovere tutti i plugin distribuiamo e Scrivi la tua, o scrivere il proprio plugin che estendono o completare il comportamento attuale di Ghini.
ko: Ghini는 컬렉션을 처리하기위한 프레임 워크이며 Ghini를 식물 컬렉션 관리자로 만드는 플러그인 세트와 함께 배포됩니다. 그러나 Ghini는 프레임 워크로 남아 있으며 이론적으로 우리가 배포하는 모든 플러그인을 제거하고 직접 작성하거나 현재 Ghini 동작을 확장하거나 완료하는 자체 플러그인을 작성할 수 있습니다.
uk: Ghini є основою для обробки колекцій, і поширюється разом із набором плагінів, що робить Ghini ботанічним менеджером збору. Але Ghini залишається рамкою, і ви могли б теоретично видалити всі плагіни, які ми поширюємо та пишемо власноруч, або напишіть свої власні плагіни, які розширять чи завершать поточну поведінку Ghini.

source: Once you have selected and opened a database connection, you land in the Search window. The Search window is an interaction between two objects: SearchPresenter (SP) and SearchView (SV).
es: Una vez que ha seleccionado y abre una conexión de base de datos, aterrizas en la ventana de búsqueda. La ventana de búsqueda es una interacción entre dos objetos: SearchPresenter (SP) y vista búsqueda (SV).
it: Una volta che avete selezionato e aperto una connessione al database, si terra nella finestra ricerca. La finestra di ricerca è un'interazione tra due oggetti: SearchPresenter (SP) e SearchView (SV).
ko: 데이터베이스 연결을 선택하고 열면 검색 창으로 이동합니다. 검색 창은 SearchPresenter (SP)와 SearchView (SV)라는 두 개체 간의 상호 작용입니다.
uk: Після того як ви вибрали та відкрили з'єднання з базою даних, ви виходите в вікно пошуку. Вікно пошуку - це взаємодія між двома об'єктами: SearchPresenter (SP) та SearchView (SV).

source: SV is what you see, SP holds the program status and handles the requests you express through SV. Handling these requests affect the content of SV and the program status in SP.
es: SV es lo que ves, SP contiene el estado del programa y encarga de las peticiones que expresan a través de SV. Manejo de estas solicitudes afectan el contenido del SV y la situación del programa en SP.
it: SV è quello che vedete, SP detiene lo status di programma e gestisce le richieste che si esprimono attraverso SV. Gestire queste richieste influenzano il contenuto di SV e lo stato del programma in SP.
ko: SV는 당신이 보는 것, SP는 프로그램 상태를 보유하고 SV를 통해 표현한 요청을 처리합니다. 이러한 요청을 처리하면 SV의 내용과 SP의 프로그램 상태에 영향을줍니다.
uk: SV - це те, що ви бачите, SP зберігає стан програми та обробляє запити, які ви висловлюєте через SV. Обробка цих запитів впливає на вміст SV та статус програми в SP.

source: The search results shown in the largest part of SV are rows, objects that are instances of classes registered in a plugin.
es: Resultados de la búsqueda se muestra en la parte más grande de SV son filas, objetos que son instancias de clases registradas en un plugin.
it: I risultati di ricerca illustrati nella parte più larga della SV sono righe, oggetti che sono istanze di classi registrate in un plugin.
ko: SV의 가장 큰 부분에 표시되는 검색 결과는 플러그인에 등록 된 클래스의 인스턴스 인 행, 객체입니다.
uk: Результати пошуку, відображені у більшій частині SV, є рядками, об'єктами, що є класами, зареєстрованими у плагіні.

source: Each of these classes must implement an amount of functions in order to properly behave within the Ghini framework. The Ghini framework reserves space to pluggable classes.
es: Cada una de estas clases debe implementar una cantidad de funciones para comportarse adecuadamente en el marco de Ghini. El marco de Ghini Reserva espacio para clases de acoplamiento.
it: Ciascuna di queste classi deve implementare un preciso insieme di funzioni per poter correttamente operare all'interno di Ghini. Ghini riserva spazio alle classi dei *plugin*.
ko: 이러한 각 클래스는 Ghini 프레임 워크 내에서 제대로 작동하기 위해 많은 기능을 구현해야합니다. Ghini 프레임 워크는 플러그 가능한 클래스를위한 공간을 예약합니다.
uk: Кожне з цих класів повинно реалізовувати певну кількість функцій, щоб правильно поводитися в рамці Ghini. Система Ghini зберігає простір для підключених класів.

source: SP knows of all registered (plugged in) classes, they are stored in a dictionary, associating a class to its plugin implementation. SV has a slot (a gtk.Box) where you can add elements. At any time, at most only one element in the slot is visible.
es: SP sabe de todas las clases (enchufadas) registradas, que son almacenados en un diccionario, asociar una clase a su implementación del plugin. SV tiene una ranura (un gtk. De la caja) donde usted puede agregar elementos. En cualquier momento, a lo sumo sólo un elemento en la ranura es visible.
it: SP sa di tutte le classi registrate (contenute nei plugin), sono memorizzate in un dizionario, che associa ciascuna classe alla relativa implementazione di plugin. SV ha uno slot (un ``gtk.Box``) dove è possibile aggiungere elementi. In qualsiasi momento, al massimo un solo un elemento nello slot è visibile.
ko: SP는 등록 된 (플러그인 된) 모든 클래스를 알고 있으며 사전에 저장되어 클래스를 플러그인 구현에 연결합니다. SV에는 요소를 추가 할 수있는 슬롯 (gtk.Box)이 있습니다. 언제든지 슬롯에서 최대 하나의 요소 만 표시됩니다.
uk: SP знає всі зареєстровані (підключені) класи, вони зберігаються в словнику, асоціюючи клас із його реалізацією плагінів. SV має слот (gtk.Box), де ви можете додати елементи. У будь-який час, максимум лише один елемент у слоті видно.

source: A plugin defines one or more plugin classes. A plugin class plays the role of a partial presenter (pP - plugin presenter) as it implement the callbacks needed by the associated partial view fitting in the slot (pV - plugin view), and the MVP pattern is completed by the parent presenter (SP), again acting as model. To summarize and complete:
es: Un plugin define una o más clases de plugin. Una clase de plugin desempeña el papel de presentador parcial (pP - plugin presentador) implementar las devoluciones de llamadas necesitadas el vista parcial asociada en la ranura (pV - plugin view), y el patrón MVP es completado por el presentador de padre (SP), otra vez actuando como modelo. Resumir y completar:
it: Un plugin definisce una o più classi di plugin. Una classe di plugin svolge il ruolo di un presentatore parziale (pP - plugin presenter) come implementare i callback necessari per la visualizzazione parziale associata raccordo nello slot (pV - plugin vista), e il modello MVP è completato dal presentatore padre (SP), ancora una volta funge da modello. Vediamo di riassumere e completare:
ko: 플러그인은 하나 이상의 플러그인 클래스를 정의합니다. 플러그인 클래스는 슬롯 (pV-플러그인보기)에 맞는 관련 부분보기에 필요한 콜백을 구현하므로 부분 발표자 (pP-플러그인 발표자)의 역할을하며 MVP 패턴은 상위 발표자 (SP ), 다시 모델 역할을합니다. 요약하고 완료하려면 :
uk: Плагін визначає один або кілька класів плагінів. Клас плагіна відіграє роль часткового ведучого (pP - плагін-ведучий), оскільки він реалізує зворотні виклики, необхідні для відповідного приєднання часткового вигляду в слоті (pV-plugin view), а шаблон MVP завершується батьківським ведучим (SP ), знову діючи як модель. Підсумувати і завершити:

source: SP acts as model,
es: SP actúa como modelo,
it: SP funge da modello,
ko: SP는 모델 역할을하며
uk: SP виступає як модель,

source: the pV partial view is defined in a glade file.
es: la vista parcial de pV se define en un archivo de glade.
it: la visualizzazione parziale di pV è definita in un file glade.
ko: pV 부분보기는 glade 파일에 정의되어 있습니다.
uk: частковий вигляд pV визначається у glade файлі.

source: the callbacks implemented by pP are referenced by the glade file.
es: las devoluciones de llamadas implementadas por pP se hace referencia en el archivo de glade.
it: i callback implementati da pP sono nominati e riferiti nel file glade.
ko: pP에 의해 구현 된 콜백은 glade 파일에 의해 참조됩니다.
uk: зворотні зв'язки, реалізовані за допомогою pP, посилаються на glade файл.

source: a context menu for the SP row,
es: un menú contextual para la fila de SP,
it: un menu di scelta rapida per la riga di SP,
ko: SP 행에 대한 컨텍스트 메뉴
uk: контекстне меню для рядка SP,

source: a children property.
es: una característica de los niños.
it: una proprietà dipendente.
ko: 어린이 재산.
uk: дочірні власності.

source: when you register a plugin class, the SP:
es: Cuando se registra una clase de plugin, el SP:
it: Quando si registra una classe di plugin, la SP:
ko: 플러그인 클래스를 등록하면 SP :
uk: коли ви реєструєте клас плагіна, SP:

source: adds the pV in the slot and makes it non-visible.
es: agrega el pV en la ranura y hace no visible.
it: aggiunge il pV nello slot e lo rende invisibile.
ko: 슬롯에 pV를 추가하고 보이지 않게 만듭니다.
uk: додає pV в слот і робить його невидимим.

source: adds an instance of pP in the registered plugin classes.
es: agrega una instancia del pP en las clases de plugin registrados.
it: aggiunge un'istanza di pP nelle classi plugin registrati.
ko: 등록 된 플러그인 클래스에 pP 인스턴스를 추가합니다.
uk: додає екземпляр pP у зареєстровані класи плагінів.

source: tells the pP that the SP is the model.
es: dice el pP que el SP es el modelo.
it: informa il pP che il modello è SP.
ko: SP가 모델임을 pP에 알립니다.
uk: повідомляє pP, що SP є моделлю.

source: connects all callbacks from pV to pP.
es: conecta todas las devoluciones de llamada de pV pP.
it: collega tutte le richiamate dal pV a pP.
ko: pV에서 pP로 모든 콜백을 연결합니다.
uk: з'єднує всі виклики від pV до pP.

source: when an element in pV triggers an action in pP, the pP can forward the action to SP and can request SP that it updates the model and refreshes the view.
es: Cuando un elemento en pV desencadena una acción en el pP, el pP podrá enviar la acción a SP y puede solicitar SP que actualiza el modelo y actualiza la vista.
it: Quando un elemento in pV genera un'azione in pP, pP può inoltrare l'azione a SP e può richiedere che SP aggiorni il modello e di conseguenza la vista.
ko: pV의 요소가 pP에서 작업을 트리거하면 pP는 작업을 SP로 전달할 수 있으며 SP에 모델을 업데이트하고보기를 새로 고치도록 요청할 수 있습니다.
uk: коли елемент у тригерах pV викликає дію в pP, pP може передати дію SP і може запитати SP, що він оновлює модель та оновлює представлення даних.

source: When the user selects a row in SP, SP hides everything in the pluggable slot and shows only the single pV relative to the type of the selected row, and asks the pP to refresh the pV with whatever is relative to the selected row.
es: Cuando el usuario selecciona una fila en SP, SP oculta todo en la ranura de acoplamiento y muestra sólo el pV solo en relación con el tipo de la fila seleccionada y pide al pP para refrescar el pV con lo que es relativo a la fila seleccionada.
it: Quando l'utente seleziona una riga in SP, SP nasconde tutto nello slot pluggable e mostra solo il pV corrispondente al tipo della riga selezionata e chiede al pP di aggiornare il pV con tutto ciò che è relativo alla riga selezionata.
ko: 사용자가 SP에서 행을 선택하면 SP는 플러그 형 슬롯의 모든 항목을 숨기고 선택한 행의 유형과 관련된 단일 pV 만 표시하고 선택한 행과 관련된 항목으로 pV를 새로 고치도록 pP에 요청합니다.
uk: Коли користувач вибирає рядок в SP, SP ховає все в сполученому слоті і показує лише один pV відносно типу вибраного рядка, і запитує pP, щоб оновити pV з будь-яким параметром відносно вибраного рядка.

source: Apart from setting the visibility of the various pV, nothing needs be disabled nor removed: an invisible pV cannot trigger events!
es: Aparte de establecer la visibilidad de la pV varios, nada necesita discapacitado ni quitado: un pV invisible no puede desencadenar eventos!
it: Oltre a impostare la visibilità del pV vari, niente deve essere disabilitato né rimosso: un pV invisibile non può innescare eventi!
ko: 다양한 pV의 가시성을 설정하는 것 외에는 비활성화하거나 제거 할 필요가 없습니다. 보이지 않는 pV는 이벤트를 트리거 할 수 없습니다!
uk: Окрім встановлення видимості різних pV, нічого не потрібно відключати чи видаляти: невидиме pv не може викликати події!

source: bug solving workflow
es: error solución de flujo de trabajo
it: flusso di lavoro per risolvere bug
ko: 버그 해결 워크 플로우
uk: робочий процес над помилками

source: normal development workflow
es: flujo de trabajo de desarrollo normal
it: flusso di lavoro in condizioni normali
ko: 정상적인 개발 워크 플로우
uk: нормальний робочий процес розробки

source: while using the software, you notice a problem, or you get an idea of something that could be better, you think about it good enough in order to have a very clear idea of what it really is, that you noticed. you open an issue and describe the problem. someone might react with hints.
es: si al usar el software, usted nota un problema, o se le occurre de como mejorar algo, pienselo lo suficiente para perfeccionar su idea de lo que realmente es, lo que ha notado. Abra un tema y nos comparta su idea. Alguien podría reaccionar con notas.
it: durante l'utilizzo del software, è possibile notare un problema, o si ottiene un'idea di qualcosa che potrebbe essere meglio, pensate a questo proposito abbastanza buono per avere un'idea molto chiara di quello che realmente è, che notato. si apre un problema e descrive il problema. qualcuno potrebbe reagire con sentori.
ko: 소프트웨어를 사용하는 동안 문제를 발견하거나 더 나을 수있는 것에 대한 아이디어를 얻었을 때, 당신이 발견 한 것이 실제로 무엇인지에 대한 매우 명확한 아이디어를 얻기 위해 충분히 좋은 생각을합니다. 문제를 열고 문제를 설명합니다. 누군가 힌트로 반응 할 수 있습니다.
uk: під час користування програмним забезпеченням, ви помічаєте проблеми, або ви отримаєте уявлення про те, що може бути краще, ви думаєте про це, достатньо для того, щоб мати дуже чітке уявлення про це. Ви відкриваєте випуск і описуєте проблему. Хтось може реагувати на це.

source: you open the issues site and choose one you want to tackle.
es: puede visitar el sitio de temas y eligir uno que desea abordar.
it: si apre il sito di problemi e scegliere uno che si vuole affrontare.
ko: 문제 사이트를 열고 해결하려는 사이트를 선택합니다.
uk: ви відкриваєте сайт випусків і вибираєте один який ви хочете вирішувати.

source: assign the issue to yourself, this way you are informing the world that you have the intention to work at it. someone might react with hints.
es: asigne el tema a si mismo, de esta manera informa al mundo que tiene la intención de trabajar en ello. alguien podría reaccionar con notas.
it: assegnare il problema a se stessi, in questo modo che si è informare il mondo che avete intenzione di lavorare a questo. qualcuno potrebbe reagire con sentori.
ko: 문제를 자신에게 할당하면 문제를 해결할 의사가 있음을 세상에 알릴 수 있습니다. 누군가 힌트로 반응 할 수 있습니다.
uk: призначити цей випуск для себе, таким чином, ви інформуєте спільноту, що у вас є намір працювати над ним.

source: optionally fork the repository in your account and preferably create a branch, clearly associated to the issue.
es: Opcionalmente el repositorio en su cuenta de la bifurcación y preferiblemente crear una rama, claramente asociada a la cuestión.
it: Facoltativamente Forkare il repository nel tuo account e preferibilmente creare un ramo, chiaramente associato al problema.
ko: 선택적으로 계정에서 저장소를 포크하고 문제와 명확하게 관련된 브랜치를 만드는 것이 좋습니다.
uk: за потреби, розгалуження сховища у вашому обліковому записі бажано створити гілку, безспірно пов'язану до випуску.

source: write unit tests and commit them to your branch (please do not push failing unit tests to github, run ``nosetests`` locally first).
es: escribir pruebas unitarias y consignar a su rama (preferiblemente, no empuje a github pruebas unitarias fallando, ejecute ``nosetests`` localmente primero).
it: scrivere unit test e loro si impegnano a tua filiale (per favore non spingere in mancanza di unit test per github, eseguire prima la ``nosetests`` localmente).
ko: 단위 테스트를 작성하고 브랜치에 커밋하십시오 (실패한 단위 테스트를 github에 푸시하지 말고 로컬에서 먼저``nosetests``를 실행하십시오).
uk: написати одиничні тести і передати їх у свою гілку (не надавайте несправні тести на github, спочатку запустіть ``nosetests``).

source: write more unit tests (ideally, the tests form the complete description of the feature you are adding or correcting).
es: escribir mas pruebas unitarias (idealmente, las pruebas forman la descripción completa de la función que está agregando o corrigiendo).
it: scrivere più unit test (idealmente, le prove formano la descrizione completa della funzionalità aggiunta o correzione).
ko: 더 많은 단위 테스트를 작성합니다 (이상적으로는 테스트가 추가하거나 수정하는 기능에 대한 완전한 설명을 형성합니다).
uk: написати додатковий блок тестів (в ідеалі, тести утворюють повний опис функції, ви це додаєте або коректуєте).

source: make sure the feature you are adding or correcting is really completely described by the unit tests you wrote.
es: Asegúrese de que la función que se agrega o corrige es realmente completamente descrita por las pruebas unitarias que usted escribió.
it: Assicurarsi che la funzionalità che si desidera aggiungere o correggere è davvero completamente descritto dagli unit test che hai scritto.
ko: 추가하거나 수정하는 기능이 작성한 단위 테스트에서 완전히 설명되었는지 확인하십시오.
uk: переконайтеся, що функція, яку ви додаєте або коректуєте дійсно повністю описує блок тестів, які ви написали.

source: make sure your unit tests are atomic, that is, that you test variations on changes along one single variable. do not give complex input to unit tests or tests that do not fit on one screen (25 lines of code).
es: Asegúrese de que las pruebas de unidad son atómicas, es decir, que cada una controle efectos de cambios relativos a una sola variable. no le dé a pruebas unitarias valores de entrada complejos o pruebas que no caben en una sola pantalla (25 líneas de código).
it: Assicurarsi che gli unit test sono atomici, cioè verificare variazioni sui cambiamenti lungo una singola variabile. non dare input complesso di unit test o test che non si adattano su uno schermo (25 righe di codice).
ko: 단위 테스트가 원자 적이어야합니다. 즉, 하나의 단일 변수를 따라 변경 사항에 대한 변형을 테스트해야합니다. 한 화면 (코드 25 줄)에 맞지 않는 단위 테스트 또는 테스트에 복잡한 입력을 제공하지 마십시오.
uk: переконайтеся, що блок тестів є простим, тобто, що ви тестуєте варіації змін по одній змінній. не додають введення складних для блоку тестів або тестів які не поміщаються на одному екрані (25 рядків в коді).

source: write the code that makes your tests succeed.
es: Escriba el código que hace que las pruebas tengan éxito.
it: scrivere il codice che effettua i test riescono.
ko: 테스트를 성공시키는 코드를 작성하십시오.
uk: написати код, який робить тести успішними.

source: update the i18n files (run ``./scripts/i18n.sh``).
es: actualizar los archivos de i18n (ejecutar ''./scripts/i18n.sh'').
it: aggiornare i file i18n (Esegui ``./scripts/i18n.sh``).
ko: i18n 파일을 업데이트합니다 (``. / scripts / i18n.sh`` 실행).
uk: оновити файли i18n (запустити ``./scripts/i18n.sh``).

source: whenever possible, translate the new strings you put in code or glade files.
es: siempre que sea posible, traducir las cadenas nuevo que pones en archivos de código o glade.
it: Quando possibile, tradurre le nuove stringhe che metti nei file di codice o radura.
ko: 가능하면 코드 또는 glade 파일에 넣은 새 문자열을 번역하십시오.
uk: всякий раз, коли це можливо, переведіть нові рядки які ви вставляєте в код або glade файли.

source: when you change strings, please make sure that old translations get re-used.
es: cuando modifique cadenas, por favor, asegúrese de que las traducciones antiguas siguen aplicandose.
it: quando cambi qualche stringa, assicurati che le sue vecchie traduzioni vengano ancora utilizzate.
ko: 문자열을 변경할 때 이전 번역이 다시 사용되는지 확인하십시오.
uk: коли ви змінюєте рядки, переконайтеся, що старі переклади повторно використовуються.

source: commit your changes.
es: cometer los cambios.
it: confermare le modifiche.
ko: 변경 사항을 커밋하십시오.
uk: зафіксувати зміни.

source: push to github.
es: empuje a github.
it: spingere a github.
ko: github로 푸시하십시오.
uk: передати github.

source: open a pull request.
es: abrir una solicitud de extracción.
it: aprire una richiesta di pull.
ko: 풀 리퀘스트를 엽니다.
uk: відкрити пул запиту.

source: publishing to production
es: publicar en la linea de producción
it: pubblicazione in produzione
ko: 프로덕션에 게시
uk: публікація продукту
