Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: To run a script, first make sure you note down the name of the directory to which you have downloaded the script, then you open a terminal window and in that window you type `bash` followed by a space and the complete name of the script including directory name, and hit on the enter key.
es: Para ejecutar una secuencia de comandos, asegúrese de que anotar el nombre del directorio a los que han descargado el script, luego abres una ventana de terminal y en que ventana tipo 'bash' seguido de un espacio y el nombre completo de la escritura incluido nombre y pulsar en la tecla enter.
it: Per eseguire uno script, in primo luogo assicurarsi che avete segnato il nome della directory in cui avete scaricato lo script, quindi si apre una finestra di terminale e in quella finestra si digita 'bash' seguita da uno spazio e il nome completo dello script incluso nome directory e colpire il tasto di invio.
ko: 스크립트를 실행하려면 먼저 스크립트를 다운로드한 디렉토리의 이름을 적어 놓은 다음 터미널 창을 열고 그 창에서 '배시'를 입력한 다음 디렉터리 이름을 포함한 스크립트의 전체 이름과 공백을 입력하고 Enter 키를 누릅니다.
uk: Щоб запустити скрипт, спершу переконайтеся, що ви помітили назву каталогу, до якого ви завантажили скрипт, після чого ви відкриваєте вікно термінала, і в цьому вікні набираєте `bash`, після чого пробіл і повне ім'я сценарію включаючи ім'я каталогу, і натисніть клавішу Enter.

source: technical note
es: nota técnica
it: nota tecnica
ko: 기술 노트
uk: технічна примітка

source: You can study the script to see what steps if runs for you.
ko: 스크립트를 검색하여 실행할 경우 어떤 단계를 실행할지 확인할 수 있습니다.

source: In short it will install dependencies which can't be satisfied in a virtual environment, then it will create a virtual environment named ``ghide``, use git to download the sources to a directory named ``~/Local/github/Ghini/ghini.desktop``, and connect this git checkout to the ``ghini-1.0`` branch (this you can consider a production line), it then builds ghini, downloading all remaining dependencies in the virtual environment, and finally it creates the ``ghini`` startup script.
ko: 간단히 말해서 가상 환경에서 만족할 수 없는 종속성을 설치한 다음 가상 환경을 만들고, git를 사용하여 소스를 ''~~/local/github/Ghini/ghini.desktop'' 디렉토리에 다운로드하고, 이 git 체크 아웃을 ``ghini-1.0" 지점에 연결한다. 가상 환경에 남아 있는 모든 종속성을 다운로드하면서 ghini를 빌드하고 마지막으로 ''ghini' 시작 스크립트를 생성합니다.

source: If you have ``sudo`` permissions, it will be placed in ``/usr/local/bin``, otherwise in your ``~/bin`` folder.
ko: "sudo" 권한이 있으면 "/usr/local/bin"에, 그렇지 않으면 "~bin" 폴더에 배치됩니다.

source: Next...
es: Siguiente...
it: Prossimo...
ko: 다음...
uk: Далі...

source: Installing on MacOSX
es: Instalar en MacOSX
it: L'installazione su MacOSX
ko: MacOSX에 설치
uk: Установка на MacOSX

source: Being macOS a unix environment, most things will work the same as on GNU/Linux (sort of).
ko: macOS는 유닉스 환경이기 때문에 대부분의 작업은 GNU/리눅스(일부)에서와 동일하게 동작한다.
uk: Будучи macOS в середовищі unix, більшість речей буде працювати так само, як на GNU/Linux (різновид).

source: First of all, you need things which are an integral part of a unix environment, but which are missing in a off-the-shelf mac:
es: Primer paso, construir en MacOSX un entorno reconocible como unix:
it: Prima di tutto, avete bisogno di cose che sono parte integrante di un ambiente unix, ma che mancano in un mac disponibile immediatamente:
ko: 먼저, 유닉스 환경의 필수적인 부분이지만 기성품인 Mac에는 없는 것들이 필요합니다.:
uk: Перш за все, вам потрібно речі, які є невід'ємною частиною unix середовища, але які відсутні в off-the-shelf mac:

source: developers tools: xcode. check the wikipedia page for the version supported on your mac.
es: herramienta de desarrollo: xcode. por favor averigue en la wikipedia cual es la versión de xcode adapta a su mac.
it: strumenti per gli sviluppatori: xcode. controllare la pagina di wikipedia per la versione supportata sul vostro mac.
ko: 개발자 도구: xcode. Mac에서 지원되는 버전의 위키백과 페이지를 확인하십시오.
uk: інструменти розробника: xcode. перевірте сторінку Вікіпедії яка версія підтримується на mac.

source: package manager: homebrew (tigerbrew for older OSX versions).
es: gestor de paquetes: homebrew (o si utiliza un sistema más viejo, tigerbrew).
it: Gestione pacchetti: homebrew (tigerbrew per le vecchie versioni OSX).
ko: 패키지 관리자: 홈브루(이전 OSX 버전의 경우 타이거브루).
uk: менеджер пакетів: homebrew (tigerbrew для старих версій OSX).

source: Installation on older macOS.
ko: 이전 MacOS에 설치.
uk: Встановлення на старіші MacOS.

source: Every time we tested, we could only solve all dependencies on the two or three most recent macOS versions. In April 2015 this excluded macOS 10.6 and older. In September 2017 this excluded macOS 10.8 and older. We never had a problem with the lastest macOS.
ko: 테스트를 할 때마다 가장 최신의 두 세 개의 MacOS 버전에 대한 모든 종속성만 해결할 수 있었습니다. 2015년 4월, 이것은 macOS 10.6 이상을 제외했다. 2017년 9월에는 맥 OS 10.8 이상을 제외하였다. 최신 MacOS에는 문제가 없었습니다.

source: The problem lies with homebrew and some of the packages we rely on. The message you have to fear looks like this::
ko: 문제는 홈브루와 우리가 의지하는 일부 소포에 있다. 두려워해야 할 메시지는 다음과 같습니다.::

source: The only solution I can offer is: please update your system.
ko: 제가 제시할 수 있는 유일한 해결책은: 시스템을 업데이트하십시오.

source: On the bright side, if at any time in the past you did install ghini.desktop on your older and now unsupported macOS, you will always be able to update ghini.desktop to the latest version.
ko: 긍정적인 측면에서는 과거에 이전 MacOS에서 지원되지 않는 ghini.desktop을 설치했다면 항상 ghini.desktop을 최신 버전으로 업데이트할 수 있습니다.

source: With the above installed, open a terminal window and run::
ko: 위 내용이 설치된 상태에서 터미널 창을 열고 다음을 실행합니다.::
uk: З встановленим вище, відкрийте вікно термінала і запустіть:

source: make sure you understand the problems it reports, and correct them. pygtk will need xquartz and brew will not solve the dependency automatically. either install xquartz using brew or the way you prefer::
es: asegúrese de haber entendido los problemas que serás reportados, y corríjalos. pygtk necesita xquartz y brew no puede solucionar la dependencia en manera automatica. instale xquartz utilizando brew::
it: Assicurarsi di che comprendere i problemi segnala e correggerli. PyGTK dovrà xquartz e brew non risolverà automaticamente la dipendenza. installare xquartz utilizzando brew o il modo che preferisci::
ko: 보고되는 문제를 이해하고 수정해야 합니다. pygtk는 xquartz가 필요하며 brew는 의존성을 자동으로 해결하지 않습니다. brew를 사용하거나 원하는 방식으로 xquartz를 설치합니다.::
uk: переконайтеся, що ви розумієте виявлені проблеми, і виправте їх. pygtk знадобиться xquartz і brew не дозволить залежність автоматично. або встановіть xquartz, використовуючи brew або якщо ви вважаєте за краще::

source: then install the remaining dependencies::
es: y finalmente instalar las últimas dependencias::
it: quindi installare le dipendenze rimanenti::
ko: 그런 다음 나머지 종속성을 설치합니다.::
uk: тоді встановіть решту залежностей::

source: follow all instructions on how to activate what you have installed.
es: siga las instrucciones relativas a como activar lo que acaba de instalar.
it: seguire tutte le istruzioni su come attivare ciò che avete installato.
ko: 설치된 항목을 활성화하는 방법에 대한 모든 지침을 따르십시오.
uk: дотримуватися всіх інструкцій про те, як активувати то, що ви встановили.

source: In particular, make sure you read and understand all reports starting with ``If you need to have this software``.
ko: 특히 "이 소프트웨어가 필요한 경우"로 시작하는 모든 보고서를 읽고 이해해야 합니다.

source: You will need at least the following four lines in your ``~/.bash_profile``::
ko: "~/.bash_profile"에는 다음 네 줄 이상이 필요합니다::

source: Activate the profile by sourcing it::
ko: 프로파일을 소싱하여 활성화합니다::

source: Before we can run ``devinstall.sh`` as on GNU/Linux, we still need installing a couple of python packages, globally. Do this::
es: Antes de poder ejecutar ``devinstall.sh`` como en GNU/Linux, todavía necesitamos instalar un par de paquetes de python, a nivel global. Lo hacemos así::
it: Prima di poter correre ' devinstall.sh ' come su GNU/Linux, abbiamo ancora bisogno di installare un paio di pacchetti python, a livello globale. A tale scopo::
ko: "devinstall"을 실행하기 전에.GNU/리눅스에서와 마찬가지로 세계적으로도 파이썬 패키지를 몇 개 설치해야 합니다. 다음 작업을 수행합니다::
uk: Перш ніж ми можемо запустити ``devinstall.sh`` як на GNU / Linux, нам все ще потрібно встановити пару пакетів python, глобально. Зробити це::

source: The rest is just as on a normal unix machine. Read the above GNU/Linux instructions, follow them, enjoy.
es: ahora puede seguir como en una normal máquina unix, y para eso tenemos un archivo de instalación. Lea las instrucciones para GNU/Linux, las siga, y disfrute.
it: Il resto è proprio come su una normale macchina unix. Leggere le istruzioni di GNU/Linux sopra, li seguono, godere.
ko: 나머지는 일반 유닉스 시스템과 동일합니다. 위의 GNU/리눅스 지침을 읽고, 따르고, 즐기세요.
uk: Інше - так само, як на звичайній машині Unix. Прочитайте наведені вище інструкції GNU/Linux, дотримуйтесь їх, насолоджуйтеся.

source: As an optional aesthetical step, consider packaging your ``~/bin/ghini`` script in a `platypus <https://github.com/sveinbjornt/Platypus>`_ application bundle. The ``images`` directory contains a 128×128 icon.
ko: 선택적인 미학적 단계로 ''~/bin/ghini 스크립트'를 'platypus https://github.com/sveinbjornt/Platypus'_ 애플리케이션 번들로 패키징하는 것을 고려하십시오. ''images'' 디렉터리에는 128x128 아이콘이 포함되어 있습니다.

source: Installing on Windows
es: Instalar en Windows
it: installazione su Windows
ko: Windows에 설치
uk: Установка на Windows

source: The steps described here instruct you on how to install Git, Gtk, Python, and the python database connectors. With this environment correctly set up, the Ghini installation procedure runs as on GNU/Linux. The concluding steps are again Windows specific.
es: Los pasos descritos aquí les enseñan cómo instalar Git, Gtk, Python, y los conectores python para base de datos. Una vez correctamente configurato este entorno, el procedimiento de instalación de Ghini funciona como en GNU/Linux. Los pasos finales son otra vez específicos de Windows.
it: La procedura descritta qui le istruzioni su come installare Git, Gtk, Python, e il pitone database connettori. Con questo ambiente impostato correttamente, la procedura di installazione di Ghini viene eseguito come su GNU/Linux. Le fasi conclusive sono nuovamente Windows specifico.
ko: 여기서 설명하는 단계에서는 Git, Gtk, Python 및 Python 데이터베이스 커넥터를 설치하는 방법에 대해 설명합니다. 이 환경을 올바르게 설정하면 GNU/Linux에서와 같이 Ghini 설치 절차가 실행됩니다. 결론 단계는 Windows에 따라 다릅니다.
uk: Нижче описані кроки допоможуть вам встановити Git, Gtk, Python та консолі бази даних Python. При правильному настроюванні цього середовища процедура встановлення Ghini працює як на GNU/Linux. Завершальні кроки знов є специфічними для Windows.

source: Ghini has been tested with and is known to work on W-XP, W-7 up to W-10. Although it should work fine on other versions Windows it has not been thoroughly tested.
ko: Ghini는 W-XP, W-7에서 W-10까지 테스트를 거친 것으로 알려져 있다. 다른 버전의 Windows(윈도우)에서는 잘 작동해야 하지만 완전히 테스트되지는 않았습니다.
uk: Ghini був протестований і, як відомо, працює на W-XP, W-7 до W-10. Хоча це має працювати чудово на інших версіях Windows, він не був ретельно протестований.

source: The installation steps on Windows:
es: Los pasos de instalación en Windows:
it: La procedura di installazione su Windows:
ko: Windows의 설치 단계:
uk: Кроки по установці на Windows:

source: download and install ``git`` (comes with a unix-like ``sh`` and includes ``vi``). Grab it from `the Git download area <https://git-scm.com/download/win>`_.
ko: 다운로드 및 설치 "git (" (유닉스와 같은 "sh and"와 함께 제공되고 "vi``"를 포함한다.) Git download area https://git-scm.com/download/win에서 가져옵니다.
uk: завантажити і встановити ``git`` (поставляється з unix-like ``sh`` і включає ``vi``). Візьміть його з `Git завантаження <https://git-scm.com/download/win>`_.

source: all default options are fine, except we need git to be executable from the command prompt:
es: todas opciones por defecto están bien, excepto que queremos poder encontrar git desde la línea de mando Windows:
it: tutte le opzioni predefinite sono corrette, tranne che abbiamo bisogno di git per essere eseguibile dal prompt dei comandi:
ko: 명령 프롬프트에서 실행할 수 있는 git가 필요한 경우를 제외하고 모든 기본 옵션은 괜찮습니다:
uk: всі опції за замовчуванням в порядку, за винятком git повинен бути виконуваним з командного рядка:

source: download and install Python 2.x (32bit). Grab it from the `Python official site <http://www.python.org>`_.
ko: Python 2.x(32비트)를 다운로드하여 설치합니다. 파이썬 공식 사이트 http://www.python.org에서 받아보세요.

source: When installing Python, do put Python in the PATH:
ko: Python을 설치할 때 PATH에 PYthon을 넣으십시오:
uk: Під час встановлення Python вставте Python в PATH:

source: download ``pygtk`` from `the official source <http://ftp.gnome.org/pub/GNOME/binaries/win32/pygtk/>`_. (this requires 32bit python). be sure you download the "all in one" version.
ko: '공식 소스 http://ftp.gnome.org/pub/GNOME/binaries/win32/pygtk/'에서 ''pygtkips''를 다운로드한다. (이를 위해서는 32비트 파이썬이 필요하다.) "all in one" 버전을 다운로드해야 합니다.
uk: завантажити ``pygtk`` з `офіційного джерела <http://ftp.gnome.org/pub/GNOME/binaries/win32/pygtk/>`_. (для цього потрібно 32-бітний python). Переконайтеся що завантажте версію "все в одній".

source: Make a complete install, selecting everything:
ko: 모든 항목을 선택하고 설치를 완료합니다:
uk: Зробіть повну установку, вибравши все:

source: (Possibly necessary, maybe superfluous) install lxml, you can grab this from `the pypi archives <https://pypi.python.org/pypi/lxml/3.4.4>`_
ko: (필요할 수도 있고, 불필요할 수도 있음) install lxml, 당신은 "https://pypi.python.org/pypi/lxml/3.4.4"에서 이것을 잡을 수 있다.

source: Remember you need the 32 bit version, for Python 2.7.
es: Recuerde que usted necesita la versión de 32 bits, para Python 2.7.
it: Ricordate che avete bisogno della versione a 32 bit, per Python 2.7.
ko: 파이썬 2.7의 경우 32비트 버전이 필요합니다.
uk: Пам'ятайте, вам потрібна 32-бітова версія для Python 2.7.

source: (definitely optional) download and install a database connector other than ``sqlite3``.
ko: (확실히 선택 사항임) "sqlite3" 이외의 데이터베이스 커넥터를 다운로드하여 설치합니다.
uk: (за бажанням), завантажте та встановіть конектор бази даних, відмінний від ``sqlite3``.

source: If you plan using PostgreSQL, the best Windows binary library for Python is `psycopg and is Made in Italy <http://initd.org/psycopg/docs/install.html>`_.
ko: Postgre를 사용할 계획인 경우파이썬을 위한 최고의 윈도 바이너리 라이브러리인 SQL은 사이콥스(sycopg)이며 이탈리아에서 만들어졌다(http://initd.org/psycopg/docs/install.html).

source: **REBOOT**
es: **REINICIALICE**
it: **RIAVVIA**
ko: **재부팅**
uk: **ПЕРЕЗАВАНТАЖЕННЯ**

source: hey, this is Windows, you need to reboot for changes to take effect!
es: así es Windows, cambió cosas en el sistema, tiene que reiniciar!
it: Ehi, questo è per Windows, è necessario riavviare per rendere effettive le modifiche!
ko: Windows입니다. 변경 내용을 적용하려면 재부팅해야 합니다!
uk: Гей, це Windows, вам необхідно перезавантажити, щоб зміни вступили в силу!

source: We're done with the dependecies, now we can download and run the batch file:
ko: 이제 종속성 작업을 마쳤으므로 배치 파일을 다운로드하고 실행할 수 있습니다:

source: Please don't just follow the above link. Instead: right click, save link as...
ko: 위의 링크만 따르지 말아 주세요. 대신: 마우스 오른쪽 단추를 클릭하고 링크를 ...로 저장합니다.

source: Also make sure you don't let Windows convert the script to a text document.
ko: 또한 Windows에서 스크립트를 텍스트 문서로 변환하지 않도록 하십시오.

source: Now **Open** the script to run it. Please note: in the below image, we have saved the file twice, once letting Windows convert it to a text document, and again as a Windows Batch File. Opening the batch file will run the script. Opening the text document will show you the code of the batch file, which isn't going to lead us anywhere.
ko: 이제 **열기** 스크립트를 실행하여 실행합니다. 참고: 아래 이미지에서는 파일을 두 번 저장하여 Windows에서 텍스트 문서로 변환한 후 다시 Windows 배치 파일로 변환합니다. 배치 파일을 열면 스크립트가 실행됩니다. 텍스트 문서를 열면 배치 파일의 코드가 표시되며, 이 코드는 우리를 어디로도 이끌지 못합니다.

source: If you installed everything as described here, the first thing you should see when you start the installation script is a window like this, and your computer will be busy during a couple of minutes, showing you what it is doing.
ko: 여기에 설명된 대로 모든 것을 설치한 경우 설치 스크립트를 시작할 때 가장 먼저 표시되는 창은 다음과 같습니다. 그러면 몇 분 동안 컴퓨터가 사용 중이어서 작업이 어떻게 진행되는지 알 수 있습니다.

source: Running ``devinstall.bat`` will pull the ``ghini.desktop`` repository from github to your home directory, under ``Local\github\Ghini``, checkout the ``ghini-1.0`` production line, create a virtual environment and install ghini into it.
ko: "devinstall.bat"을 실행하면 ``ghini.desktop" 저장소가 "Local\github\" 아래에 있는 홈 디렉토리로 이동하게 된다.'기니-1.0' 생산라인을 점검한 기니는 가상 환경을 조성하고 기니를 설치한다.

source: You can also run ``devinstall.bat`` passing it as argument the numerical part of the production line you want to follow.
ko: 또한 이를 인수로 전달하는 ''devinstall.bat''을 실행할 수 있습니다.
uk: Ви також можете запустити ``devinstall.bat``, передаючи його як аргумент числовій частині виробничої лінії, якої ви хочете дотримуватися.

source: This is the last installation step that depends, heavily, on a working internet connection.
ko: 이 단계는 작동하는 인터넷 연결에 크게 좌우되는 마지막 설치 단계입니다.
uk: Це останній етап інсталяції, який сильно залежить від робочого підключення до Інтернету.

source: The operation can take several minutes to complete, depending on the speed of your internet connection.
ko: 인터넷 연결 속도에 따라 작업을 완료하는 데 몇 분이 걸릴 수 있습니다.
uk: Операція може зайняти декілька хвилин, залежно від швидкості вашого інтернет-з'єднання.

source: the last installation step creates the Ghini group and shortcuts in the Windows Start Menu, for all users. To do so, you need run a script with administrative rights. The script is called ``devinstall-finalize.bat``, it is right in your HOME folder, and has been created at the previous step.
es: la última etapa de instalación crea el grupo Ghini y accesos directos en el menú de inicio de Windows, para todos los usuarios. Para ello, necesita ejecutar una secuencia de comandos con derechos administrativos. El script se llama '' devinstall-finalize.bat'', es derecho en su carpeta de inicio y se ha creado en el paso anterior.
it: l'ultimo passo di installazione crea il gruppo Ghini ed i collegamenti nel Menu Start di Windows, per tutti gli utenti. A tale scopo, è necessario eseguire uno script con diritti amministrativi. Lo script si chiama ' devinstall-finalize.bat ', è proprio nella tua cartella HOME ed è stato creato nel passaggio precedente.
ko: 마지막 설치 단계는 모든 사용자에 대한 Windows 시작 메뉴에 Ghini 그룹 및 바로 가기를 만듭니다. 이렇게 하려면 관리 권한이 있는 스크립트를 실행해야 합니다. 이 스크립트는 ''devinstall-finalize''라고 불린다."bat"은(는) 홈 폴더에 있으며 이전 단계에서 작성되었습니다.
uk: Останній етап установки створює групу Ghini і ярлики в меню Пуск Windows для всіх користувачів. Для цього вам потрібно запустити скрипт із правами адміністратора. Сценарій називається ``devinstall-finalize.bat``, він прямо в папці HOME, і був створений на попередньому кроці.

source: Right-click on it, select run as administrator, confirm you want it to make changes to your computer. These changes are in the Start Menu only: create the Ghini group, place the Ghini shortcut.
ko: 마우스 오른쪽 단추를 클릭하고 관리자로 실행을 선택한 후 컴퓨터를 변경할지 확인합니다. 이러한 변경 사항은 시작 메뉴에만 있습니다. Ghini 그룹을 생성하고 Ghini 바로 가기를 배치합니다.
uk: Клацніть правою кнопкою миші на ньому, виберіть запустити як адміністратор, підтвердити, що хочете внести зміни в свій комп'ютер. Ці зміни знаходяться тільки в меню Пуск: створіть групу Ghini, помістіть ярлик Ghini.

source: download the batch file, it will help you staying up-to-date:
ko: 배치 파일을 다운로드하면 최신 상태를 유지할 수 있습니다.

source: `ghini-update.bat <https://raw.githubusercontent.com/Ghini/ghini.desktop/ghini-1.0-dev/scripts/ghini-update.bat>`_
ko: - 업데이트 해주세요. Stanfin: https://raw.githubusercontent.com/Ghini/ghini.desktop/ghini-1.0-dev/scripts/ghini-update.bat (https://raw.githubusercontent.com/Ghini/ghini.desktop/ghini-1.0-dev/scripts/ghini-update.bat)

source: If you are on a recent Ghini installation, each time you start the program, Ghini will check on the development site and alert you of any newer ghini release within your chosen production line.
ko: 최근 Ghini 설치를 진행 중인 경우 프로그램을 시작할 때마다 Ghini가 개발 사이트를 확인하고 선택한 생산 라인 내에서 최신 Ghini 릴리스에 대해 알려줍니다.

source: Any time you want to update your installation, just run the ``ghini-update.bat`` script, it will hardly take one minute.
ko: 최근 Ghini 설치를 진행 중인 경우 프로그램을 시작할 때마다 Ghini가 개발 사이트를 확인하고 선택한 생산 라인 내에서 최신 Ghini 릴리스에 대해 알려줍니다.

source: How to save a batch file, and how to run it: check the the quite detailed instructions given for ``devinstall.bat``.
ko: 배치 파일을 저장하는 방법 및 실행하는 방법: ''devinstall.bat''에 대해 주어진 매우 상세한 지시사항을 확인한다.

source: If you need to generate PDF reports, you can use the XLS based report generator and you will need to download and install `Apache FOP <http://xmlgraphics.apache.org/fop/>`_. After extracting the FOP archive you will need to include the directory you extracted to in your PATH.
ko: PDF 보고서를 생성해야 하는 경우 XLS 기반 보고서 생성기를 사용할 수 있으며 Apache FOP http://xmlgraphics.apache.org/fop/'을 다운로드하여 설치해야 합니다. FOP 아카이브를 추출한 후에는 추출한 디렉터리를 PATH에 포함해야 합니다.

source: If you choose for PostScript reports, you can use the Mako based report generator and there are no further dependencies.
ko: PostScript 리포트를 선택하는 경우 Mako 기반 리포트 생성기를 사용할 수 있으며 추가 종속성은 없습니다.

source: Installing on Android
ko: Android에서 설치

source: ``ghini.desktop`` is a desktop program, obviously you don't install it on a handheld device, but we do offer the option, for your Android phone or tablet, to install ``ghini.pocket``.
ko: "ghini.desktop"은 데스크탑 프로그램으로, 휴대용 장치에 설치하지 않는 것은 분명하지만, 우리는 여러분의 안드로이드 폰이나 태블릿에 "ghini"를 설치할 수 있는 옵션을 제공합니다.호주머니에 넣다.

source: ``ghini.pocket`` is a small data viewer, it comes handy if you want to have a quick idea of a plant species, its source, and date it entered the garden, just by scanning a plant label.
ko: ''기니''포켓몬스터란 작은 데이터 뷰어로서 식물 종과 그 근원, 그리고 식물 라벨 스캔만으로 정원에 들어온 날짜를 간단히 알 수 있으면 편리합니다.

source: Installation is as easy as it can be: just `look for it in Google Play <https://play.google.com/store/apps/details?id=me.ghini.pocket>`_, and install it.
ko: 구글플레이(https://play.google.com/store/apps/details?id=me.ghini.pocket)에서 찾아 설치하면 된다.

source: Export the data from ``ghini.desktop`` to pocket format, copy it to your device, enjoy.
ko: 데이터를 "ghini.desktop"에서 포켓 포맷으로 내보내고 장치에 복사하여 즐기십시오.

source: Dealing with Propagations
es: Tratar con propagaciones
it: Si occupano di propagazioni
ko: 전파 처리
uk: Робота з розповсюдженням

source: Ghini offers the possibility to associate Propagations trials to Plants and to document their treatments and results. Treatments are integral parts of the description of a Propagation trial. If a Propagation trial is successful, Ghini lets you associate it to a new Accession. You can only associate one Accession to a Propagation Trial.
es: Ghini ofrece la posibilidad de asociar ensayos de propagación a las plantas y para documentar sus tratamientos y resultados. Los tratamientos son parte integrante de la descripción de una prueba de propagación. Si un ensayo de propagación tiene éxito, Ghini le permite asociarla a una nueva accesión. Sólo puede asociar una accesión a un ensayo de propagación.
it: Ghini offre la possibilità di associare prove di propagazioni di piante e di documentare i loro trattamenti e risultati. Trattamenti sono parte integrante della descrizione di una prova di propagazione. Se una prova di propagazione è successo, Ghini consente di associarla a una nuova accessione. È possibile associare solo una accessione ad una prova di propagazione.
ko: Ghini는 전파 실험을 식물과 연관시키고 그 치료와 결과를 문서화할 수 있는 가능성을 제공한다. 치료는 전파 평가판에 대한 설명에서 필수적인 부분입니다. 전파 평가판이 성공하면 Ghini를 통해 새 등록에 연결할 수 있습니다. 하나의 등록만 전파 평가판에 연결할 수 있습니다.
uk: Ghini пропонує можливість асоціювати дослідження розповсюдження на рослини та документувати їх трактування та результати. Трактування є невід'ємною частиною опису розповсюдження. Якщо дослідження про розповсюдження є успішним, Ghini дозволяє пов'язати його з новим приєднанням. Ви можете приєднати лише одне приєднання до пробної версії.

source: Here we describe how you use this part of the interface.
es: Aquí describimos cómo usar esta parte de la interfaz.
it: Qui descriviamo come si utilizza questa parte dell'interfaccia.
ko: 여기서는 인터페이스의 이 부분을 사용하는 방법에 대해 설명합니다.
uk: Тут ми описуємо, як ви використовуєте цю частину інтерфейсу.
