Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: We all agree that in theory theory and practice match perfectly and that one first writes the tests, then implements the function. In practice, however, practice does not match theory and we have been writing tests after writing and even publishing the functions.
es: Todos estamos de acuerdo que en teoría de la teoría y la práctica coinciden perfectamente y que uno escribe las pruebas primero implementa la función. En la práctica, sin embargo, práctica no coincide con la teoría y nos hemos estado escribiendo pruebas después de escribir y publicar incluso las funciones.
it: Siamo tutti d'accordo che in teoria teoria e pratica corrispondono perfettamente e che uno prima scrive i test, quindi implementa la funzione. In pratica, tuttavia, pratica non corrisponde a teoria e noi abbiamo scritto test dopo scrivendo e pubblicando anche le funzioni.
ko: 우리 모두는 이론과 실습에서 완벽하게 일치하고 먼저 테스트를 작성한 다음 기능을 구현한다는 데 동의합니다. 그러나 실제로 실습은 이론과 일치하지 않으며 함수를 작성하고 게시 한 후 테스트를 작성했습니다.
uk: Ми всі погоджуємося, що в теорії теорія та практика ідеально узгоджуються, і що спочатку пишуть тести, потім реалізують функцію. На практиці, однак, практика не збігається з теорією, і ми писали тести після написання та навіть публікації функцій.

source: This section describes the process of adding unit tests for ``bauble.plugins.plants.family.remove_callback``.
es: Esta sección describe el proceso de agregar pruebas unitarias para ``bauble.plugins.plants.family.remove_callback``.
it: In questa sezione viene descritto il processo di aggiunta di unit test per ``bauble.plugins.plants.family.remove_callback``.
ko: 이 섹션에서는``bauble.plugins.plants.family.remove_callback``에 대한 단위 테스트를 추가하는 프로세스를 설명합니다.
uk: Цей розділ описує процес додавання одиночних тестів для ``bauble.plugins.plants.family.remove_callback``.

source: What to test
es: Para probar
it: Elementi di cui eseguire il test
ko: 테스트 할 내용
uk: Що для тесту

source: First of all, open the coverage report index, and choose a file with low coverage.
es: En primer lugar, abra el índice del informe de cobertura y eliga un archivo con baja cobertura.
it: Prima di tutto, aprire l'indice del rapporto di copertura e scegliere un file con bassa copertura.
ko: 먼저 커버리지 보고서 색인을 열고 커버리지가 낮은 파일을 선택합니다.
uk: Перш за все, відкрийте індекс звіту про охоплення та виберіть файл з низьким рівнем охоплення.

source: For this example, run in October 2015, we landed on ``bauble.plugins.plants.family``, at 33%.
es: Para este ejemplo, en octubre de 2015, aterrizamos en ``bauble.plugins.plants.family``, en el 33%.
it: In questo esempio, eseguire in ottobre 2015, siamo sbarcati su ``bauble.plugins.plants.family``, al 33%.
ko: 2015 년 10 월에 실행 된 이 예제의 경우 33 %로``bauble.plugins.plants.family``에 도달했습니다.
uk: Для цього прикладу, починаючи з жовтня 2015 року, ми приземлилися на ``bauble.plugins.plants.family``, на 33%.

source: The first two functions which need tests, ``edit_callback`` and ``add_genera_callback``, include creation and activation of an object relying on a custom dialog box. We should really first write unit tests for that class, then come back here.
es: Las dos primeras funciones que necesitan pruebas, ``edit_callback`` y ``add_genera_callback``, incluyen la creación y activación de un objeto depende de un cuadro de diálogo personalizado. Debe realmente primeras pruebas de unidad de escritura para esa clase y luego volver aquí.
it: Le prime due funzioni che hanno bisogno di prove, di ``edit_callback`` e ``add_genera_callback``, includono la creazione e l'attivazione di un oggetto basandosi su una finestra di dialogo personalizzata. Ci dovrebbe davvero prima scrivere unit test per tale classe, poi torna qui.
ko: 테스트가 필요한 처음 두 함수 인``edit_callback ''및``add_genera_callback ''에는 사용자 지정 대화 상자에 의존하는 개체의 생성 및 활성화가 포함됩니다. 먼저 해당 클래스에 대한 단위 테스트를 작성한 다음 여기로 돌아와야합니다.
uk: Перші дві функції, які потребують тестів, ``edit_callback`` і ``add_genera_callback``, включають створення та активацію об'єкта, що спирається на спеціальне діалогове вікно. Ми повинні спочатку написати одиничні тести для цього класу, а потім повернутися сюди.

source: The next function, ``remove_callback``, also activates a couple of dialog and message boxes, but in the form of invoking a function requesting user input via yes-no-ok boxes. These functions we can easily replace with a function mocking the behaviour.
es: La siguiente función, ``remove_callback``, también activa un par de cuadros de diálogo y mensajes, pero en la forma de invocar una función de solicitud de entrada del usuario mediante cajas de sí-no-ok. Estas funciones podemos reemplazar fácilmente con una función de burlarse de la conducta.
it: La funzione successiva, ``remove_callback``, attiva anche un paio di finestre di dialogo e il messaggio, ma in forma di richiamo di una funzione che richiede l'input dell'utente tramite caselle di sì-no-ok. Queste funzioni possiamo facilmente sostituire con una funzione beffardo il comportamento.
ko: 다음 기능인``remove_callback ''은 대화 상자와 메시지 상자 두 개를 활성화하지만 예-아니오 상자를 통해 사용자 입력을 요청하는 기능을 호출하는 형태입니다. 이러한 함수는 동작을 조롱하는 함수로 쉽게 대체 할 수 있습니다.
uk: Наступна функція ``remove_callback`` також активує пару діалогових вікон і повідомлень, але у формі виклику функції, що запитує вхід користувача через поля yes-no-ok. Ці функції ми можемо легко замінити функцією, що висміює поведінку.

source: how to test
es: Cómo se hace
it: Come provare
ko: 테스트 방법
uk: як протестувати

source: So, having decided what to describe in unit test, we look at the code and we see it needs discriminate a couple of cases:
es: Así, después de haber decidido qué describir en prueba de la unidad, nos fijamos en el código y vemos que es necesario discriminar un par de casos:
it: Così, dopo aver deciso cosa descrivere nello unit test, guardiamo il codice e vediamo che ha bisogno di discriminare un paio di casi:
ko: 따라서 단위 테스트에서 무엇을 설명할지 결정한 후 코드를 살펴보면 몇 가지 경우를 구별해야합니다:
uk: Отже, вирішивши, що описувати в одиничному тесті, ми розглянемо код, і бачимо, що це потребує дискримінації пари випадків:

source: **parameter correctness**
es: ** parámetro corrección **
it: **correttezza dei parametri**
ko: ** 매개 변수 정확성 **
uk: ** коректність параметра **

source: the list of families has no elements.
es: la lista de familias no tiene elementos.
it: l'elenco delle famiglie non ha elementi.
ko: 과 목록에는 요소가 없습니다.
uk: у списку сімей немає елементів.

source: the list of families has more than one element.
es: la lista de familias tiene más de un elemento.
it: l'elenco delle famiglie ha più di un elemento.
ko: 과 목록에는 요소가 없습니다.
uk: список сімей містить більше одного елемента.

source: the list of families has exactly one element.
es: la lista de las familias tiene exactamente un elemento.
it: l'elenco delle famiglie ha esattamente un elemento.
ko: 과 목록에는 정확히 하나의 요소가 있습니다.
uk: список сімей має рівно один елемент.

source: **cascade**
ko: **종속**
uk: **каскад**

source: the family has no genera
es: la familia no tiene géneros
it: la famiglia non ha nessun generi
ko: 과는 속이 없다
uk: у сім'ї немає родів

source: the family has one or more genera
es: la familia tiene uno o más géneros
it: la famiglia ha uno o più generi
ko: 과에 하나 이상의 속이 있습니다
uk: у сім'ї один чи більше родів

source: **confirm**
es: **confirmar**
ko: ** 확인 **
uk: **підтвердити**

source: the user confirms deletion
es: el usuario confirma la eliminación
it: l'utente conferma eliminazione
ko: 사용자가 삭제를 확인
uk: користувач підтверджує видалення

source: the user does not confirm deletion
es: el usuario no confirma la eliminación
it: l'utente non confermare l'eliminazione
ko: 사용자가 삭제를 확인하지 않음
uk: користувач не підтверджує видалення

source: **deleting**
es: **borrar**
ko: ** 삭제 **
uk: **видалення**

source: all goes well when deleting the family
es: todo va bien al eliminar la familia
it: tutto va bene quando si elimina la famiglia
ko: 속을 삭제할 때 모든 것이 잘됩니다
uk: при видаленні сім'ї все пройшло добре

source: there is some error while deleting the family
es: hay un error al eliminar la familia
it: C'è qualche errore durante l'eliminazione della famiglia
ko: 과를 삭제하는 동안 약간의 오류가 있습니다
uk: під час видалення сім'ї виникає помилка

source: I decide I will only focus on the **cascade** and the **confirm** aspects. Two binary questions: 4 cases.
es: Decidir sólo se centrará en la ** cascada ** y el ** confirmar ** aspectos. Dos preguntas binarias: 4 casos.
it: Decido che mi concentrerò solo sugli aspetti **cascata** e **confermare**. Due domande binarie: 4 casi.
ko: ** 캐스케이드 ** 및 ** 확인 ** 측면에만 집중하기로 결정했습니다. 2 개의 이진 질문 : 4 개의 경우.
uk: Я вирішу зосередитись лише на аспектах **каскад** і **підтвердити**. Два бінарних питання: 4 випадки.

source: where to put the tests
es: donde poner las pruebas
it: dove mettere i test
ko: 테스트를 둘 위치
uk: де поставити тести

source: Locate the test script and choose the class where to put the extra unit tests.
es: Localizar el script de prueba y elija la clase donde poner las pruebas de unidad extra.
it: Individuare lo script di test e scegliere la classe dove mettere i test di unità extra.
ko: 테스트 스크립트를 찾고 추가 단위 테스트를 넣을 클래스를 선택합니다.
uk: Знайдіть тестовий скрипт і виберіть клас, де слід поставити додаткові одиничні тести.

source: what about skipped tests
es: que se hace con las pruebas ignoradas
it: che fare con i test disattivati
ko: 건너 뛴 테스트는 어떻습니까
uk: що про пропущені тести

source: The ``FamilyTests`` class contains a skipped test, implementing it will be quite a bit of work because we need rewrite the FamilyEditorPresenter, separate it from the FamilyEditorView and reconsider what to do with the FamilyEditor class, which I think should be removed and replaced with a single function.
es: La clase de ``FamilyTests`` contiene una prueba omitida, implementarlo a ser un poco de trabajo porque necesitamos reescribir la FamilyEditorPresenter, la separan de la FamilyEditorView y reconsiderar qué hacer con la clase FamilyEditor, que creo que debe eliminado y reemplazado con una sola función.
it: La classe ``FamilyTests`` contiene un test saltato, attuarlo sarà essere un po' di lavoro perché abbiamo bisogno di riscrivere il FamilyEditorPresenter, separarla dalla FamilyEditorView e riconsiderare ciò che a che fare con la classe FamilyEditor, che credo dovrebbe essere rimosso e sostituito con una singola funzione.
ko: ``Family Tests ''클래스에는 건너 뛴 테스트가 포함되어 있습니다. Family Editor Presenter를 다시 작성하고이를 Family Editor View에서 분리하고 제거해야 한다고 생각하는 Family Editor 클래스로 수행 할 작업을 다시 고려해야 하기 때문에 구현하는 작업이 상당히 많을 것입니다. 단일 기능으로 대체되었습니다.
uk: Клас ``FamilyTests`` містить пропущене тестування, і його реалізація займе дещо час, тому що нам потрібно переписати FamilyEditorPresenter, відокремити його від FamilyEditorView і переглянути, що робити з класом FamilyEditor, який, на мою думку, повинен бути вилучений і замінений однією функцією.

source: writing the tests
es: las pruebas de la escritura
it: le prove di scrittura
ko: 테스트 작성
uk: написання тестів

source: After the last test in the FamilyTests class, I add the four cases I want to describe, and I make sure they fail, and since I'm lazy, I write the most compact code I know for generating an error::
es: Después de la última prueba en la clase de FamilyTests, añadir los cuatro casos que quiero describir, y aseguro que no, y como soy perezosa, escribo el código más compacto que conozco para generar un error::
it: Dopo l'ultimo test nella classe FamilyTests, aggiungere i quattro casi che voglio descrivere, e mi assicuro che falliscono, e dato che io sono pigro, scrivo il codice più compatto so per la generazione di un errore::
ko: FamilyTests 클래스의 마지막 테스트 후에 설명하고 싶은 네 가지 사례를 추가하고 실패하는지 확인하고 게으르기 때문에 오류 생성에 대해 알고 있는 가장 간단한 코드를 작성합니다::
uk: Після останнього тесту в класі FamilyTests я додаю чотири випадки, які я хочу описати, і я переконаний, що вони завершаться невдачею, і оскільки я ледачий, я пишу найбільш компактний код, який я знаю, для генерації помилки::

source: One test, step by step
es: Una prueba, paso a paso
it: Una prova, passo dopo passo
ko: 단계별 테스트
uk: Один тест, крок за кроком

source: Let's start with the first test case.
es: Vamos a empezar con el primer caso de prueba.
it: Cominciamo con il primo test case.
ko: 첫 번째 테스트 케이스부터 시작하겠습니다.
uk: Почнемо з першого тесту.

source: When writing tests, I generally follow the pattern:
es: Al escribir ensayos, generalmente siguen el patrón:
it: Durante la scrittura di test, seguono in genere il modello:
ko: 테스트를 작성할 때 일반적으로 다음 패턴을 따릅니다:
uk: Під час написання тестів я зазвичай дотримуюсь зразка:

source: T₀ (initial condition),
es: T₀ (condición inicial),
it: T₀ (condizione iniziale),
ko: T₀ (초기 조건),
uk: T₀ (початковий стан),

source: action,
es: acción,
it: azione,
ko: 동작,
uk: дія,

source: T₁ (testing the result of the action given the initial conditions)
es: T₁ (prueba el resultado de la acción dada las condiciones iniciales)
it: T₁ (test il risultato dell'azione data le condizioni iniziali)
ko: T₁ (초기 조건이 주어진 경우 작업 결과 테스트)
uk: T₁ (тестування результату дії з урахуванням початкових умов)

source: what's in a name — unit tests
es: ¿qué hay en un nombre — las pruebas unitarias
it: la ragione di un nome — test unitari
ko: 이름에있는 것 — 단위 테스트
uk: що в імені - одиничні тести

source: There's a reason why unit tests are called unit tests. Please never test two actions in one test.
es: Hay una razón por la cual las pruebas unitarias se llaman pruebas unitarias. Por favor, nunca pruebe dos acciones en una prueba.
it: C'è una ragione perché unit test sono chiamati unit test. Si prega di test mai due azioni in un test.
ko: 단위 테스트를 단위 테스트라고 부르는 데에는 이유가 있습니다. 한 번의 테스트에서 두 가지 작업을 테스트하지 마십시오.
uk: Є причина, чому одиничні тести називаються одиничними тестами. Будь-ласка, ніколи не перевіряйте дві дії в одному тесті.

source: So let's describe T₀ for the first test, a database holding a family without genera::
es: Así que vamos a describir T₀ de la primera prueba, una base de datos manteniendo una familia sin géneros::
it: Quindi cerchiamo di descrivere T₀ per il primo test, un database che tiene una famiglia senza generi::
ko: 그럼 첫 번째 테스트의 T₀에 대해 설명해 봅시다. 속이없는 가족을 포함하는 데이터베이스 :
uk: Тож давайте опишемо T₀ для першого тесту, бази даних, що містить родину без родів::

source: We do not want the function being tested to invoke the interactive ``utils.yes_no_dialog`` function, we want ``remove_callback`` to invoke a non-interactive replacement function. We achieve this simply by making ``utils.yes_no_dialog`` point to a ``lambda`` expression which, like the original interactive function, accepts one parameter and returns a boolean. In this case: ``False``::
es: No queremos que la función está probadaspara para invocar la función interactiva ``utils.yes_no_dialog``, queremos ``remove_callback`` para invocar una función de reemplazo no interactivo. Ello simplemente haciendo punto de ``utils.yes_no_dialog`` a una expresión de ``lambda`` que, al igual que la original función interactiva, acepta un parámetro y devuelve un valor booleano. En este caso: ``False``::
it: Non vogliamo che la funzione in fase di test per richiamare la funzione interattiva ``utils.yes_no_dialog``, ``remove_callback`` vogliamo di richiamare una funzione di sostituzione non interattiva. Raggiungiamo questo obiettivo semplicemente facendo punto di ``utils.yes_no_dialog`` in un'espressione ``lambda`` che, come l'originale funzione interattiva, accetta un parametro e restituisce un valore booleano. In questo caso: ``False``::
ko: 테스트중인 함수가 대화 형``utils.yes_no_dialog ''함수를 호출하는 것을 원하지 않고,``remove_callback``이 비대화 형 대체 함수를 호출하도록합니다. ``utils.yes_no_dialog``가 원래의 대화 형 함수와 마찬가지로 하나의 매개 변수를 받아들이고 부울을 반환하는``람다 ''표현식을 가리 키도록 만들기 만하면됩니다. 이 경우 :``False ''::
uk: Ми не хочемо, щоб тестована функція викликала інтерактивну функцію ``utils.yes_no_dialog``, а хочемо викликати неінтерактивну функцію заміни ``remove_callback``. Ми досягаємо цього просто, зробивши вираз ``utils.yes_no_dialog`` виразом ``lambda``, який, як і початкова інтерактивна функція, приймає один параметр і повертає логічний. У цьому випадку: ``False``::

source: Next we test the result.
es: A continuación probamos el resultado.
it: Successivamente abbiamo il risultato del test.
ko: 다음으로 결과를 테스트합니다.
uk: Далі ми перевіряємо результат.

source: Well, we don't just want to test whether or not the object Arecaceae was deleted, we also should test the value returned by ``remove_callback``, and whether ``yes_no_dialog`` and ``message_details_dialog`` were invoked or not.
es: Bueno, no sólo queremos prueba si o no el objeto Arecaceae fue suprimida, nosotros también debemos el valor devuelto por ``remove_callback``, y si ``yes_no_dialog`` y ``message_details_dialog`` se invocaron o no.
it: Beh, non vogliamo solo testare o meno l'oggetto è stato eliminato Arecaceae, ci dovremmo prova anche il valore restituito da 'remove_callback ', e se ``yes_no_dialog`` e ``message_details_dialog`` sono stati richiamati o non.
ko: 음, 우리는 Arecaceae 개체가 삭제되었는지 여부를 테스트하는 것이 아니라``remove_callback ''에서 반환 된 값과``yes_no_dialog ''및``message_details_dialog ''가 호출되었는지 여부도 테스트해야합니다. .
uk: Що ж, ми не хочемо просто перевірити, чи був об'єкт Arecaceae видалений, чи ні, ми також повинні перевірити значення, яке повертає ``remove_callback``, і чи ``yes_no_dialog`` і `` message_details_dialog`` були викликані чи ні .

source: A ``lambda`` expression is not enough for this. We do something apparently more complex, which will make life a lot easier.
es: Una expresión de ``lambda`` no es suficiente para esto. Hacemos algo aparentemente más complejo, que hará la vida mucho más fácil.
it: Un'espressione ``lambda`` non è sufficiente per questo. Facciamo qualcosa di apparentemente più complesso, che renderà la vita molto più facile.
ko: ``람다 ''표현만으로는 충분하지 않습니다. 우리는 분명히 더 복잡한 일을하여 삶을 훨씬 더 쉽게 만듭니다.
uk: Для цього не вистачає виразу ``lambda``. Ми робимо щось набагато складніше, що зробить життя набагато простіше.

source: Let's first define a rather generic function::
es: Primero definamos una función más bien genérica::
it: Innanzitutto definiamo una funzione piuttosto generica::
ko: 먼저 다소 일반적인 함수를 정의 해 보겠습니다::
uk: Давайте спочатку визначимо досить загальну функцію::

source: and we grab ``partial`` from the ``functools`` standard module, to partially apply the above ``mockfunc``, leaving only ``msg`` unspecified, and use this partial application, which is a function accepting one parameter and returning a value, to replace the two functions in ``utils``. The test function now looks like this::
es: y ``parcial`` del ``functools`` módulo estándar, parcialmente aplicar arriba ``mockfunc``, dejando sólo ``mensaje`` no se especifica, y utilizar esta aplicación parcial, que es una función que acepta un parámetro y devuelve un valor, para reemplazar las dos funciones en ``utils``. La función de prueba ahora se ve así::
it: e possiamo importare ``partial`` dal modulo standard ``functools``, applicarlo parzialmente alla ``mockfunc``, lasciando solo ``msg`` non vincolato, ed applicare ed utilizzare questa applicazione parziale, che è una funzione che accetta un parametro e restituisce un valore, per sostituire le due funzioni in ``utils``. La funzione di test ora assomiglia a questo::
ko: 그리고 우리는``functools ''표준 모듈에서``partial ''을 가져 와서 위의``mockfunc ''를 부분적으로 적용하고``msg ''만 지정하지 않고이 부분 응용 프로그램을 사용합니다. 매개 변수와 값을 반환하여``utils ''의 두 함수를 대체합니다. 이제 테스트 기능은 다음과 같습니다::
uk: і ми захоплюємо ``partial`` з стандартного модуля ``functools``, частково застосувати вищенаведене `` mockfunc``, залишивши тільки ``msg`` невизначеним, і використовуйте цю часткову програму, яка є функцією, що приймає один параметр і повертає значення, замінити дві функції в ``utils``. Тестова функція тепер виглядає так:

source: The test section checks that ``message_details_dialog`` was not invoked, that ``yes_no_dialog`` was invoked, with the correct message parameter, that Arecaceae is still there::
es: La sección de prueba comprueba que no se invocó el ``message_details_dialog``, que ``yes_no_dialog`` fue invocado, con el parámetro de mensaje correcto, que existe todavía la Arecaceae::
it: La sezione test controlla che ``message_details_dialog`` non è stato richiamato, che ``yes_no_dialog`` è stato richiamato, con il parametro di messaggio corretto, che Arecaceae è ancora lì::
ko: 테스트 섹션은``message_details_dialog``가 호출되지 않았는지,``yes_no_dialog``가 올바른 메시지 매개 변수와 함께 호출되었는지, Arecaceae가 아직 거기에 있는지 확인합니다::
uk: Тестовий розділ перевіряє, що `message_details_dialog`` не було викликано, що ``yes_no_dialog`` було викликано, з правильним параметром повідомлення, що Arecaceae все ще існує::

source: And so on
es: Etcétera
it: E così via
ko: 등등
uk: І так далі

source: `there are two kinds of people, those who complete what they start, and so on`
es: "hay dos clases de personas, aquellos que terminan lo que empiezan y así sucesivamente"
it: 'ci sono due tipi di persone, coloro che completano quello che iniziano e così via'
ko: `시작한 것을 완수하는 두 종류의 사람들이있다`
uk: 'Є два види людей, ті, хто завершує те, що вони починають, і так далі'

source: Next test is almost the same, with the difference that the ``utils.yes_no_dialog`` should return ``True`` (this we achieve by specifying ``result=True`` in the partial application of the generic ``mockfunc``).
es: Próxima prueba es casi lo mismo, con la diferencia que el ``utils.yes_no_dialog`` debe volver ``True`` (esto logramos especificando ``resultado = True`` en la aplicación parcial de la genérico ``mockfunc``).
it: Prossimo test è quasi la stessa, con la differenza che il ``utils.yes_no_dialog`` deve restituire ``True`` (questo raggiungiamo specificando ``result=True`` nell'applicazione parziale della ``mockfunc`` generica).
ko: 다음 테스트는``utils.yes_no_dialog``가``True ''를 반환해야한다는 차이점을 제외하면 거의 동일합니다 (일반``mockfunc ''의 부분 응용 프로그램에서``result = True``를 지정하여 달성합니다. `).
uk: Наступне тестування майже однакове, з тією різницею, що ``utils.yes_no_dialog`` повинен повертати ``True`` (це ми досягаємо, вказавши ``result = True`` в частковому застосуванні загальної форми ``mockfunc`` `).

source: With this action, the value returned by ``remove_callback`` should be ``True``, and there should be no Arecaceae Family in the database any more::
es: Con esta acción, el valor devuelto por ``remove_callback`` debe ser ``True``, y no debe haber ninguna familia Arecaceae en la base de datos más::
it: Con questa azione, il valore restituito da ``remove_callback`` dovrebbe essere ``True``, e non ci dovrebbe essere nessuna famiglia Arecaceae nel database più::
ko: 이 작업을 통해``remove_callback``에서 반환 된 값은``True ''여야하며 데이터베이스에 Arecaceae Family가 더 이상 없어야합니다::
uk: За допомогою цієї дії значення, яке повертає ``remove_callback``, має бути ``True``, і не повинно більше бути сім'ї Arecaceae в базі даних::

source: have a look at commit 734f5bb9feffc2f4bd22578fcee1802c8682ca83 for the other two test functions.
es: Echa un vistazo en 734f5bb9feffc2f4bd22578fcee1802c8682ca83 commit para las otras dos funciones de la prueba.
it: Date un'occhiata al commit 734f5bb9feffc2f4bd22578fcee1802c8682ca83 per le altre due funzioni di prova.
ko: 다른 두 테스트 기능에 대한 커밋 734f5bb9feffc2f4bd22578fcee1802c8682ca83을 살펴보십시오.
uk: подивіться на commit 734f5bb9fffc2f4bd22578fcee1802c8682ca83 для двох інших тестових функцій.

source: Testing logging
es: Pruebas y Registro
it: Prova registrazione
ko: 로깅 테스트
uk: Реєстрація тестування
