Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: In ghini, we keep speaking of ›Plants‹, ›Locations‹, while such user groups focus on ›Seeds‹ and ›Jars‹ and ›Drawers‹ and ›Boxes‹ and ›Envelopes‹. So people wonder whether ghini could be adapted to their use case, or for directions on how to develop their own database.
ko: 인히니에서는, 우리는 계속해서 "식물", "위치"에 대해 말하는 반면, 그러한 사용자 그룹은 "씨앗", "자르스", "드로어", "상자", "엔볼프"에 초점을 맞추고 있다. 그래서 사람들은 기니가 그들의 사용 사례에 적응할 수 있을지 아니면 그들 자신의 데이터베이스를 개발하는 방법에 대한 방향을 정할 수 있을지 궁금해 한다.

source: Does ghini need being adapted for such a seed database?
ko: 이러한 시드 데이터베이스를 위해 기니를 개조해야 합니까?

source: no it doesn't need any adaptation, it's just that you need to read some of its terms differently.
ko: 적응할 필요가 없습니다. 단지 일부 용어를 다르게 읽을 필요가 있을 뿐입니다.

source: the taxonomy part is just taxonomy, plant species information, no need to explain that, no way to interpret it otherwise.
ko: 분류학 부분은 단지 분류학, 식물 종 정보입니다. 설명할 필요가 없습니다. 달리 해석할 방법이 없습니다.

source: ›Accessions‹ and ›Plants‹, you know what an ›Accession‹ is, but since you're consistently handling ›Plants‹ still only in seed form, the Wikipedia explanation of an accession sounds like this: it is a seed or group of seeds that are of the same taxon, are of the same propagule type (or treatment), were received from the same source, were received at the same time.
ko: access액세스먼트 and와 pl플랜트,, 당신은 ion액세스션 is이 무엇인지 알고 있지만, 당신은 pl식물 still을 여전히 씨앗 형태로만 취급하고 있기 때문에, 위키백과의 설명은 다음과 같이 들린다: 그것은 같은 종자 또는 종자이며, 같은 종류의 종자이며, 동일한 전파 형태(또는 치료)로부터 받은 것이다.동시에

source: If you hold seeds in jars, or in other sort of containers that is able to hold hundreds of seeds, please make sure that a jar contains seeds of just one accession, as above described: same taxon, same treatment, same source, same time.
ko: 만약 여러분이 항아리나 수백 개의 씨앗을 담을 수 있는 다른 종류의 용기에 씨앗을 담는다면, 항아리에 단지 하나의 씨앗이 들어 있는지 확인해주세요. 위에서 설명한 것처럼, 같은 분류법, 동일한 처리법, 동일한 출처, 같은 시간.

source: Each one of your ›Jars‹ of seeds is in ghini speak a ›Plant‹, and the amount of seeds in the ›Jar‹ is the ›Plant‹ ›quantity‹. An ›Envelope‹ is just the same as a ›Jar‹: a container of seeds from the same ›Accession‹, just presumably smaller.
ko: 씨앗의 각 j자르스(Jars)는 기니어로 "식물"이며, jar자르스(Jars)의 씨앗의 양은 "식물"("양")입니다. 엔벨롭(Envelope)은 jar자르(Jar)와 동일하며, 같은 access액세스션(Accession)의 씨앗을 담은 용기이며, 크기가 작을 것으로 추측된다.

source: A ›Box‹ (where you keep several ›Envelopes‹) or a ›Drawer‹ (where you keep several ›Jars‹) are in ghini speak a ›Location‹.
ko: 〈Box〉(여러 개의 〈Envopes〉를 보관하는 곳) 또는 〈Drawer〉(여러 개의 〈Jars〉를 보관하는 곳)는 기니어로 〈Location〉을 말한다.

source: Since a ›Jar‹ or an ›Envelope‹ contains seeds from an ›Accession‹, you will clearly label it with its ›Accession‹ code (and trailing ›Plant‹ number). You might write the amount of seeds, too, but this would be repeating information from the database, and repeating information introduces an inconsistency risk factor.
ko: jarJar or 또는 enEncope는 accessAccession,의 씨앗을 포함하므로, accessAccession code 코드(및 plantPlant number 번호 후행)로 명확하게 레이블을 붙입니다. 시드 양도 작성할 수 있지만, 데이터베이스의 정보를 반복할 수 있으며, 반복할 경우 일관성 없는 위험 요소가 발생합니다.

source: How do I handle receiving a batch of seeds?
ko: 씨앗 한 묶음 받는 건 어떻게 처리하죠?

source: When we receive seeds, we either collect them ourselves, or we receive it from an other seed collector. We handle receiving them possibly on the spot, or with a small delay. Even when handled together with several other batches of seeds we received, each batch keeps its individuality.
ko: 우리가 씨앗을 받을 때, 우리는 직접 씨앗을 모으거나, 아니면 다른 씨앗 수집가로부터 씨앗을 받습니다. 우리는 그들을 현장에서 또는 약간의 지연으로 받을 수 있습니다. 우리가 받은 몇 개의 다른 씨앗 묶음과 함께 처리할 때에도, 각각의 묶음은 그 개성을 유지한다.

source: We want to be later able to find back, for example, how many seeds we still have from a specific batch, or when we last received seeds from a specific source.
ko: 우리는 나중에 다시 찾을 수 있기를 원합니다. 예를 들어, 우리가 얼마나 많은 씨앗을 가지고 있는지, 또는 우리가 마지막으로 특정 소스로부터 씨앗을 받았을 때 말입니다.

source: As long as you put this information in the database, as long as you follow the same convention when doing so, you will be able to write and execute such queries using ghini.
ko: 이 정보를 데이터베이스에 넣는 한, 동일한 규칙을 따르는 한, 지니를 사용하여 이러한 쿼리를 작성하고 실행할 수 있습니다.

source: One possibility, the one described here, is based on ›Notes‹. (Ghini does not, as yet, implement the concept "Acquisition". There is an issue related to the Acquisition and Donation objects, but we haven't quite formalized things yet.)
ko: 여기서 설명하는 한 가지 가능성은 "주석"에 기초합니다. (Ghini는 아직 "Acquisition" 개념을 구현하지 않았습니다. 인수 및 기부 대상과 관련된 문제가 있지만 아직 공식화된 것은 아닙니다.)

source: You surely already use codes to identify a batch of seeds entering the seed bank. Just copy this code in a ›Note‹, category 'received', to each ›Accession‹ in the received batch. This will let you select the ›Accessions‹ by the query::
ko: 여러분은 이미 시드 뱅크로 들어가는 시드 묶음을 식별하기 위해 코드를 사용하고 있습니다. 이 코드를 받은 일괄 처리의 각 "Accession"(액세스)에 '수신됨' 범주인 "참고"에 복사하기만 하면 됩니다. 이렇게 하면 다음과 같이 쿼리로 "Accessions"(액세스)를 선택할 있읍니다. 니::

source: Use the 'Source' tab if you think so, it offers space for indicating an external source, or an expedition. When receiving from an external source, you can specify the code internal to their organization. This will be useful when requesting an extra batch.
ko: '소스' 탭을 사용하면 외부 소스 또는 원정을 나타낼 수 있는 공간이 제공됩니다. 외부 소스에서 수신하는 경우 해당 조직 내부의 코드를 지정할 수 있습니다. 이것은 추가 배치를 요청할 때 유용합니다.

source: How do I handle sending seeds?
ko: 씨앗을 어떻게 보내야 하죠?

source: what you physically do is to grab the desired amount of seeds of the indicated species from a jar, put it in an envelope and send it. what you do from a point of view of the database is exactly the same, but precisely described in a protocol:
ko: 여러분이 물리적으로 하는 일은 항아리에서 원하는 양의 종자를 가져와 봉투에 넣고 보내는 것입니다. 데이터베이스의 관점에서 여러분이 하는 일은 정확히 같지만 프로토콜에 정확히 설명되어 있습니다:

source: Use the database to identify the ›Jar‹ containing the desired amount of the right seeds.
ko: 데이터베이스를 사용하여 원하는 양의 올바른 시드가 들어 있는 ‹Jar the를 식별합니다.

source: remove that amount of seeds from the ›Jar‹ (decrement the quantity),
ko: jarJar (에서 그 정도의 씨앗을 제거한다. (수량을 줄인다.)

source: put the seeds in an ›Envelope‹ (yes, that's a database object).
ko: 시드를 "Envelope"(예, 데이터베이스 개체입니다)에 넣습니다.

source: send the envelope (but keep it in the database).
ko: 봉투를 보내다

source: this in short.
ko: 요컨대 이것

source: When I send seeds, it's not just one bag, how does ghini help me keeping things together?
ko: 제가 씨앗을 보낼 때, 가방 하나가 아니라, 기니가 어떻게 제 물건들을 함께 보관하는데 도움을 줄까요?

source: There's two levels of keeping things together: one is while you're preparing the sending, and then for later reference.
ko: 두 가지 수준의 정보를 함께 보관할 수 있습니다. 하나는 발송을 준비하는 동안이고, 나중에 참조할 수 있습니다.

source: While preparing the sending, we advise you use a temporary ›Tag‹ on the objects being edited.
ko: 전송을 준비하는 동안 편집 중인 개체에 임시 "Tag"를 사용하는 것이 좋습니다.

source: For later reference, you will have common ›Note‹ texts, to identify received and sent batches.
ko: 나중에 참조할 수 있도록, 수신 및 발송된 배치를 식별하는 공통 "참고" 텍스트가 제공됩니다.

source: Can you give a complete example?
ko: 당신은 완전한 예를 들어줄 수 있나요?

source: Right. Quite fair. Let's see…
ko: 맞아. 꽤 공정해요.자 see…

source: Say you were requested to deliver 50 seeds of Parnassia palustris, 30 of Gentiana pneumonanthe, 80 of Fritillaria meleagris, and 30 of Hypericum pulchrum.
ko: 파르나시아 팔루스트리스 씨 50마리, 젠티아나 폐렴구균 씨 30마리, 프리틸라리아멜레그리스 씨 80마리, 그리고 하이릭럼 펄크럼 씨 30마리를 배달해 달라고 요청받았다고 가정해 보세요.

source: **step 1**
ko: **1단계**

source: The first step is to check the quantities you have in house, and if you do have enough, where you have them. You do this per requested species::
ko: 첫 번째 단계는 여러분이 가지고 있는 수량과, 만약 여러분이 충분히 가지고 있다면, 그것들을 어디에 가지고 있는지 확인하는 것입니다. 요청된 종에 따라 다음을 수행합니다::

source: Expand in the results pane the ›Accession‹ from which you want to grab the seeds, so you see the corresponding ›Jars‹, highlight one, and tag it with a new ›Tag‹. To do this the first time, go through the steps, just once, of creating a new ›Tag‹. The new tag becomes the active tag, and subsequent tagging will be speedier. I would call the tag ›sending‹, but that's only for ease of exposition and further completely irrelevant.
ko: 결과 창에서 시드를 가져올 "Accession"을 확장하면 해당하는 "Jars"가 표시되고, 하나를 강조 표시한 후 새 "Tag"로 태그가 지정됩니다. 처음 이 작업을 수행하려면 새 tag태그 a를 만드는 단계를 한 번만 진행하십시오. 새 태그가 활성 태그가 되고 이후 태그가 더 빨라집니다. 나는 그 태그를 "보내기"라고 부르고 싶지만, 그것은 단지 설명을 쉽게 하기 위해서일 뿐이고 더 이상 전혀 관련이 없다.

source: Repeat the task for Gentiana pneumonanthe, Fritillaria meleagris, Hypericum pulchrum::
ko: Gentiana 폐렴구균, Fritillaria melegris, Hypericum pulchrum에 대해 작업을 반복합니다::

source: Again highilight the accession from which you can grab seeds, and hit Ctrl-Y (this tags the highighted row with the active tag). Don't worry if nothing seems to happen when you hit Ctrl-Y, this is a silent operation.
ko: 시드를 가져올 수 있는 등록 정보를 다시 강조 표시하고 Ctrl-Y를 누릅니다(이것은 활성 태그로 고경도 행을 태그). Ctrl-Y를 눌렀을 때 아무 일도 일어나지 않는 것 같아도 걱정하지 마십시오. 이것은 조용한 작업입니다.

source: **step 2**
ko: 2단계

source: Now we prepare to go to the seeds bank, with the envelopes we want to fill.
ko: 이제 우리는 우리가 채워넣고 싶은 봉투를 가지고 씨앗 은행으로 갈 준비를 합니다.

source: Select the ›sending‹ ›Tag‹ from the tags menu, this will bring back in the results pane all the tagged ›Plants‹ (›Jars‹ or ›Envelopes‹), and will tell you in which ›Location‹ (›Drawer‹ or ›Box‹) they are to be found. Write this information on each of your physical envelopes. Write also the ›Species‹ name, and the quantity you can provide.
ko: 태그 메뉴에서 s보내기‹태그 from를 선택하면 태그가 지정된 모든 pl식물›(jJars or 또는 enEnvopes),)이 결과 창에 다시 표시되고, 어떤 location위치‹(drawDrawer‹ 또는 ‹Box))가 검색되는지 알려줍니다. 각각의 실제 봉투에 이 정보를 쓰세요. 또한 "종" 이름과 제공할 수 있는 수량을 기록합니다.

source: Walk now to your seeds bank and, for each of the envelopes you just prepared, open the ›Location‹, grab the ›Plant‹, extract the correct amount of seeds, put them in your physical envelope.
ko: 지금 여러분의 씨앗 은행으로 걸어가서, 여러분이 방금 준비한 각각의 봉투에 대해, "위치"를 열고, "식물"을 잡고, 알맞은 양의 씨앗을 추출하여 여러분의 실제 봉투에 넣습니다.

source: And back to the database!
ko: 그리고 데이터베이스로 돌아가!

source: **step 3**
ko: **3단계**

source: If nobody used your workstation, you still have the Tag in the results pane, and it's expanded so you see all the individual plants you tagged.
ko: 워크스테이션을 사용한 사람이 없는 경우에도 결과 창에 태그가 있고 태그가 확장되어 태그가 지정된 모든 개별 식물을 볼 수 있습니다.

source: One by one, you have to ›split‹ the plant. This is a standard operation that you activate by right-clicking on the plant.
ko: Even if no one is using a workstation, you can see all individual plants tagged and tagged in the results pane.

source: A plant editor window comes in view, in 'split mode'.
ko: 플랜트 편집기 창이 '분할 모드'로 표시됩니다.

source: Splitting a plant lets you create a database image of the plant group you just physically created, eg: it lets you subtract 30 items from the Gentiana pneumonanthe plant (group number one, that is the one in the jar), and create a new plant group for the same accession. A good practice would be to specify as ›Location‹ for this new plant the 'out box', that is, the envelope is on its way to leave the garden.
ko: 식물을 분할하면 물리적으로 방금 생성한 식물 그룹의 데이터베이스 이미지를 생성할 수 있습니다. 예를 들어, 식물에서 Gentiana 폐렴구균에서 30개 항목(그룹 1번, 병 안의 항목)을 감산하고 동일한 등록에 사용할 새 식물 그룹을 생성할 수 있습니다. 이 새 식물에 대해 "위치"로 지정하는 것이 좋습니다. 즉, 봉투가 정원을 떠나는 중입니다.

source: Don't forget to delete the temporary 'sending' ›Tag‹.
ko: 임시 '보내는' tag태그‹를 삭제하는 것을 잊지 마십시오.
uk: Не забудьте видалити тимчасове 'sending' ›Tag‹.

source: **step 4**
ko: **4단계**
uk: **крок 4**

source: Final step, it represents the physical step of sending the envelope, possibly together with several other envelopes, in a single sending, which should have a code.
ko: 마지막 단계에서, 그것은 코드를 가지고 있어야 하는, 여러 개의 다른 봉투와 함께, 봉투를 보내는 물리적인 단계를 나타낸다.

source: Just as you did when you received a batch of plants, you work with notes, this time the category is 'sent', and the note text is whatever you normally do to identify a sending. So suppose you're doing a second sending to Pino in 2018, you add the note to each of the newly created envelopes: category 'sent', text: '2018-pino-002'.
ko: 식물 배치를 받았을 때처럼 노트를 작업하면 이번에는 범주가 '전송'되고 노트 텍스트는 보통 발송을 식별하기 위해 수행하는 작업입니다. 따라서 2018년에 Pino로 두 번째 발송을 한다고 가정하면 새로 작성된 봉투 각각에 메모를 추가합니다. '보낸 문서' 범주, 텍스트: '2018-pino-002'.

source: When you finally do send the envelopes, these stop being part of your collection. You still want to know that they have existed, but you do not want to count them among the seeds that are available to you.
ko: 마침내 당신이 봉투를 보냈을 때, 이 봉투들은 당신의 수집품의 일부가 되는 것을 멈춥니다. 여러분은 여전히 그것들이 존재했다는 것을 알고 싶어하지만, 여러분은 그것들을 여러분이 이용할 수 있는 씨앗들 사이에서 세고 싶어하지 않습니다.

source: Bring back all the plants in the sending '2018-pino-002'::
ko: 보내는 '2018-pino-002'에 있는 모든 식물을 다시 가져오세요:
uk: Поверніть всі рослини у відправленні '2018-pino-002' :

source: You now need to edit them one by one, mark the ›quantity‹ to zero, and optionally specify the reason of the change, which would be ›given away‹, and the recipient is already specified in the 'sent' ›Note‹.
ko: 이제 그것들을 하나씩 편집하고, "수량"을 0으로 표시하고, 선택적으로 "주어진" 변경 이유를 지정해야 하며, 수신자는 이미 "보낸" "참고"에 명시되어 있습니다.

source: This last operation could be automated, we're thinking of it, it would become a script, acting on a selection. Stay tuned.
ko: 이 마지막 작업은 자동화될 수 있습니다. 우리는 이 작업을 생각하고 있습니다. 스크립트가 되어 선택 작업을 수행합니다. 채널을 고정해 주십시오
uk: Ця остання операція може бути автоматизованою, ми маємо на увазі, що це стане скриптом, який діє на вибір. Залишайтеся на зв'язку.

source: Managing Users
es: Cómo gestionar usuarios
it: Gestione Utenti
ko: 사용자 관리
uk: Управління користувачами

source: The Ghini users plugin is only available on PostgreSQL based databases.
es: Sólo está disponible en bases de datos PostgreSQL basado en el plugin de los usuarios de Ghini.
it: Il plugin di utenti Ghini disponibile solo su database PostgreSQL basata.
ko: Ghini 사용자 플러그인은 Postgre에서만 사용할 수 있습니다.SQL 기반 데이터베이스.
uk: Плагін користувачів Ghini доступний лише на базі даних PostgreSQL.

source: The Ghini Users Plugin will allow you to create and manage the permissions of users for your Ghini database.
ko: Ghini Users Plugin을 사용하면 Ghini 데이터베이스에 대한 사용자 권한을 생성하고 관리할 수 있습니다.

source: You must log in to your database as a user with ``CREATEROLE`` privilege in order to manage other users.
ko: 다른 사용자를 관리하려면 "CREATEROLE" 권한이 있는 사용자로 데이터베이스에 로그인해야 합니다.
uk: Ви повинні входити до своєї бази даних як користувач із привілеєм ``CREATEROLE`` для керування іншими користувачами.

source: Creating Users
es: Creación de usuarios
it: Creare Utenti
ko: 사용자 만들기
uk: Створення користувачів

source: To create a new user...
es: Para crear un usuario nuevo...
it: Crea nuovo utente...
ko: 새 사용자를 생성하려면...
uk: Для створення нового користувача ...

source: Permissions
es: Permisos
it: Permessi
ko: 권한
uk: Дозволи

source: Ghini allows read, write and execute permissions.
es: Ghini permite la lectura, escritura y ejecución.
it: Ghini consente lettura, scrittura ed esecuzione autorizzazioni.
ko: Ghini는 읽기, 쓰기 및 실행 권한을 허용합니다.
uk: Ghini дозволяє читати, писати і оформляти дозволи.

source: Installing Ghini always includes downloading the sources, connected to the github repository. This is so because in our eyes, every user is always potentially also a developer.
es: Cada instalación de Ghini incluye la descarga de las fuentes, conectadas al repositorio github. Lo organizamos así porque pensamos que cada usuario sea un desarrollador potencial.
it: L'installazione di Ghini sempre include scaricare i sorgenti, collegati al repository su github. Questo è così perché nei nostri occhi, ogni utente è sempre potenzialmente anche uno sviluppatore.
uk: Встановлення Ghini завжди включає в себе завантаження джерел, підключених до сховища GitHub. Це так, тому що в наших очах, кожен користувач завжди потенційно також є розробником.

source: When it comes to ``ghini.desktop``, when you do a global installation, you don't know which language your users will set up their environment, and a user can change the language configuration any time. So what we do is to install the software in English together with a translation table from English to whatever else, in particular Italian or Hungarian. Then the GUI libraries (Android or GTK) know where to look for the translation strings. These translation tables are generated during the installation or upgrade process, based on the strings you see on Weblate.
es: Hablando de ``ghini.desktop``, cuando haces una instalación global, no sabes en cual idioma cada usuario utilizará el programa, y cada usuario puede decidir cambiar su configuración de idioma en cada momento. Por lo tanto, lo que hacemos es instalar el software en inglés, y a su lado una tabla de traducción a cada otro idioma, entre que el castellano. Las librerías de sistema (Android o gtk) saben donde buscar las tablas de las traducciones, que son generadas durante la instalación o puesta al día, basado en las cadenas presentes en Weblate.
uk: Коли мова йде про ``ghini.desktop``, коли ви робите глобальну інсталяцію, ви не знаєте, якою мовою ваші користувачі налаштують навколишнє середовище, і користувач може будь-коли змінювати конфігурацію мови. Отже, що ми робимо, це встановлюємо програмне забезпечення англійською мовою разом із таблицею перекладу з англійської на будь-яку іншу, зокрема італійську чи угорську. Потім бібліотеки графічного інтерфейсу (Android або GTK) знають, де шукати перекладацькі рядки. Ці таблиці перекладів створюються під час процесу встановлення або оновлення, виходячи з рядків, які ви бачите на Weblate.

source: users will notice a `new version available` warning and can decide to ignore it, or to update.
es: los usuarios verán el aviso `nueva versión disponible` y deciden si ignorar, o poner al día.
uk: користувачі помітять попередження про `наявність нової версії` та можуть вирішити його проігнорувати або оновити.

source: For ``ghini.pocket``, there is no notification to end users, since we're not yet using the google app store.
uk: Для ``ghini.pocket`` не повідомляється кінцевим користувачам, оскільки ми ще не використовуємо магазин Google Apps.

source: distributing for windows
es: Creare una distribución Windows
it: creare una distribuzione Windows
uk: розповсюдження для windows

source: For building a Windows installer or executable you will need an installation of Windows. The methods described here has been used successfully on Windows 7, 8 and 10. Windows Vista should also work but has not been tested.
es: Para producir un ejecutable Windows, necesitas Windows. El metodo aquí presentado ha sido testado en Windows 7, 8 y 10. Seguramente también funciona en Windows Vista pero no lo intentamos.
uk: Для створення інсталятора Windows або виконуваного файлу вам знадобиться інсталяція Windows. Описані тут методи були успішно використані в Windows 7, 8 і 10. Windows Vista також повинна працювати, але не була протестована.

source: In the remainder of this section we assume you're using a Windows workstation. We also assume assume you do not use it as your software development platform. All steps described here are very similar to the steps for a normal Windows :ref:`installation`.
uk: У решті частини цього розділу ми припускаємо, що ви використовуєте робочу станцію Windows. Ми також припустимо, що ви не використовуєте її як платформу розробки програмного забезпечення. Всі описані тут кроки дуже схожі на кроки для звичайної Windows :ref:`installation`.

source: Using pip to install. The easiest method is to install into a virtual environment that doesn't currently have any modules installed as eggs using ``pip install .`` as described below. If you do wish to install over the top of an install with eggs (e.g. the environment created by ``devinstall.bat``) you can try ``pip install -I .`` but your mileage may vary.
uk: Використовуйте pip для встановлення. Найпростіший спосіб - встановити у віртуальне середовище, в якому в даний час не встановлено жодного модуля як eggs з використанням ``pip install``, як описано нижче. Якщо ви хочете встановити поверх версії встановлення з eggs (наприклад, середовище, створене за допомогою ``devinstall.bat``), ви можете спробувати ``pip install -I.` ', але ваш пробіг може відрізнятися.

source: Download and install git, Python 2.7 and PyGTK as outlined in the generic :ref:`installation` instructions.
uk: Завантажте та встановіть git, Python 2.7 та PyGTK, як описано в загальній інструкції :ref:`installation`.

source: Additionally, download and install `NSIS v3 <http://nsis.sourceforge.net/Download>`_.
uk: Окрім того, завантажте та встановіть `NSIS v3 <http://nsis.sourceforge.net/Download>`_.

source: we have a script that automates the remaining steps
uk: ми маємо скрипт, який автоматизує залишкові кроки

source: ``/e`` will produce an executable only, skipping the extra step of building an installer, and will copy ``win_gtk.bat`` into place.
uk: ``/e`` створить лише виконуваний файл, пропустивши додатковий крок побудови інсталятора, і копіює ``win_gtk.bat`` на місце.

source: A path to the location for the virtual environment to use. (defaults to ``"%HOMEDRIVE%%HOMEPATH%"\.virtualenvs\ghi2exe``)
uk: Шлях до місця розташування віртуального середовища для використання. (за замовчуванням ``"%HOMEDRIVE%%HOMEPATH%"\.virtualenvs\ghi2exe``)

source: e.g. to produce an executable only and use a virtual environment in a folder beside where you have ghini.desktop you could execute ``scripts\build_win.bat /e ..\ghi2exe``
uk: наприклад, щоб створити тільки виконуваний файл і використовувати віртуальне середовище у папці біля місця, де ви маєте ghini.desktop, ви можете виконати ``scripts\build_win.bat /e ..\ghi2exe``

source: Install virtualenv, create a virtual environment and activate it. With only Python 2.7 on your system (where ``<path-to-venv>`` is the path to where you wish to keep the virtual environment) use::
uk: Встановіть virtualenv, створіть віртуальне середовище та активуйте його. Використовуючи тільки Python 2.7 у вашій системі (де ``<path-to-venv>`` це шлях до того, де ви хочете зберегти віртуальне середовище), використовуйте :

source: On systems where Python 3 is also installed you may need to either call pip and virtualenv with absolute paths e.g. ``C:\Python27\Scripts\pip`` or use the Python launcher e.g. ``py -2.7 -m pip`` (run ``python --version`` first to check. If you get anything other than version 2.7 you'll need to use one of these methods.)
uk: На системах, де встановлено Python 3, вам може знадобитися або називати pip і virtualenv з абсолютними шляхами, наприклад ``C:\Python27\Scripts\pip``або використовуйте панель запуску Python, наприклад ``py -2.7 -m pip`` (спершу перевірте ``python --version``. Якщо ви отримаєте щось інше, ніж версія 2.7, вам потрібно буде скористатись одним із цих методів.)
