Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: As a bonus, ghini.pocket contains a phonetic genus search, and a quite complete database of botanic taxa with rank between order and genus, including tribes, and synonymies.
ko: 보너스로, 기니.포켓은 음성 속 탐색과, 종족과 동의어를 포함한 순서와 속 사이의 순위를 가진 식물 택시의 꽤 완전한 데이터베이스를 포함한다.
uk: Як бонус, ghini.pocket містить пошук фонетичного роду та цілком повну базу даних ботанічних таксонів з рангом між порядком і родом, у тому числі поколінням, та синонімами.

source: check further :any:`interaction among components`.
ko: 추가 정보:any:'interaction incomponents'를 확인하십시오.
uk: подальшої перевірки :будь-якої: `взаємодії між компонентами`.

source: ghini.web is a web server, written in nodejs.
ko: ghini.web은 nodejs로 작성된 웹 서버이다.
uk: ghini.web - це веб-сервер, написаний на nodejs.

source: Its most visible part runs at http://gardens.ghini.me and shows as a map of the world, where you browse gardens and search their published collection.
ko: 가장 눈에 띄는 부분은 http://gardens.ghini.me에서 진행되며, 세계의 지도로서 여러분이 정원을 찾아보고 그들의 출판된 컬렉션을 검색하는 곳입니다.

source: It also serves configuration data to ghini.tour instances.
ko: 또한 구성 데이터를 기니로 제공합니다.예문을 답사하다.
uk: Він також надає дані конфігурації для екземплярів ghini.tour.

source: ghini.tour is an Android app which you can install from the `play store <https://play.google.com/store/apps/details?id=me.ghini.tour>`_.
ko: ghini.tour는 플레이 스토어 https://play.google.com/store/apps/details?id=me.ghini.tour에서 설치할 수 있는 안드로이드 앱이다.
uk: ghini.tour - це програма для Android, яку ви можете встановити з `play store <https://play.google.com/store/apps/details?id=me.ghini.tour>`_.

source: People visiting your garden will install ghini.tour on their phone or tablet, enjoy having a map of the garden, knowing where they are, and will be able to listen to audio files that you have placed as virtual information panels in strategic spots in your garden.
ko: 당신의 정원을 방문하는 사람들은 기니를 설치할 것입니다.휴대폰이나 태블릿으로 둘러보고, 정원의 지도를 가지고, 어디에 있는지 알고, 정원의 전략적 위치에 가상 정보 패널로 배치한 오디오 파일을 들을 수 있습니다.
uk: Люди, які відвідують ваш сад, встановлюють ghini.tour на свій телефон або планшет, насолоджуються картою саду, знаючи, де вони знаходяться, і зможуть слухати аудіофайли, які ви розмістили у вигляді віртуальних інформаційних панелей у стратегічних місцях у вашому саді.

source: world view
ko: 세계관
uk: світогляд

source: at startup, you see the world and gardens. select a garden, and enter.
ko: 시작할 때, 당신은 세상과 정원을 보고 정원을 선택하고 입장합니다.
uk: при запуску ви бачите світ і сади. виберіть сад і введіть.

source: garden view
ko: 정원의 경치
uk: огляд саду

source: when viewing at garden level, you see panels. select a panel, and listen.
ko: 정원 수준에서 볼 때, 여러분은 패널을 보고, 패널을 선택하고, 귀를 기울입니다.
uk: під час перегляду на рівні саду ви бачите панелі. виберіть панель і слухайте.

source: data streams between software components
ko: 소프트웨어 구성 요소 간의 데이터 스트림

source: This section contains technical information for database managers and software developers.
ko: 이 섹션에는 데이터베이스 관리자 및 소프트웨어 개발자를 위한 기술 정보가 포함되어 있습니다.

source: In the diagram showing the composition of the Ghini family, the alert reader noticed how different arrows representing different data flows, had different colours: some are deep green, some have a lighter tint.
ko: Ghini 계열의 구성을 보여주는 다이어그램에서, 알림 리더는 서로 다른 데이터 흐름을 나타내는 다른 화살표가 다른 색을 가지고 있다는 것을 알아냈습니다. 어떤 화살표는 짙은 녹색이고 어떤 화살표는 밝은 색입니다.

source: Deeper green streams are constant flows of data, representing the core activity of a component, eg: the interaction between ghini.desktop and its database server, or your internet browser and ghini.web.
ko: 더 깊은 녹색 스트림은 구성 요소의 핵심 활동(예: ghini.desktop과 해당 데이터베이스 서버 간의 상호 작용, 인터넷 브라우저 및 ghini)을 나타내는 지속적인 데이터 흐름입니다.거미줄을 치다.

source: Lighter green streams are import/export actions, initiated by the user at the command panel of ghini.desktop, or in the ghini.tour settings page.
ko: 밝은 녹색 스트림은 ghini.desktop의 명령 패널 또는 ghini에서 사용자가 시작한 가져오기/내보내기 작업입니다.둘러보기 설정 페이지.
uk: Більш світлі зелені потоки - це дії імпорту експорту, ініційовані користувачем на панелі команд ghini.desktop або на сторінці налаштувань ghini.tour.

source: This is the same graph, in which all import data streams have been given an identifier.
ko: 이 그래프는 모든 가져오기 데이터 스트림에 식별자가 지정된 그래프와 동일합니다.

source: d2p: copy a snapshot of the desktop database to ghini.pocket
ko: d2p: 데스크톱 데이터베이스의 스냅샷을 기니로 복사합니다.호주머니에 넣다

source: export the desktop database to a pocket snapshot
ko: 데스크톱 데이터베이스를 포켓 스냅샷으로 내보내기

source: copy the snapshot to the handheld device
ko: 스냅샷을 휴대용 장치에 복사하다

source: ghini.pocket integrates closely with ghini.desktop, and it's not a tool for the casual nor the external user. One task of your garden database manager is to regularly copy an updated database snapshot to your Android device.
ko: ghini.pocket은 ghini.pocket과 긴밀하게 통합되며, 캐주얼이나 외부 사용자를 위한 도구가 아닙니다. Garden Database Manager의 작업 중 하나는 업데이트된 데이터베이스 스냅샷을 Android 장치에 정기적으로 복사하는 것입니다.

source: We advise enabling USB debugging on the device. In perspective, this will allow ghini.desktop writing directily into the ghini.pocket device.
ko: 장치에서 USB 디버깅을 활성화하는 것이 좋습니다. 이를 통해 기니 데스크톱에서 기니로 직접 쓸 수 있습니다.포켓 장치.

source: Export the file from ghini.desktop, call the file pocket.db, copy it to the phone::
ko: ghini.desktop에서 파일을 내보내고 pocket.db 파일을 호출하여 전화기에 복사합니다::

source: The above location is valid even if your phone does not have a memory card.
ko: 위 위치는 휴대폰에 메모리 카드가 없는 경우에도 유효합니다.

source: Other options include bluetooth, or whatever other way you normally use to copy regular files into your Android device.
ko: 다른 옵션으로는 Bluetooth 또는 일반 파일을 Android 장치로 복사하는 데 일반적으로 사용하는 다른 방법이 있습니다.

source: p2d: import from the ghini.pocket log file and pictures into the central database
ko: p2d: 기니에서 가져옵니다.로그 파일 및 사진을 중앙 데이터베이스에 저장

source: even if we're still calling it “inventory log”, ghini.pocket's log contains more than just inventory corrections.
ko: 우리가 여전히 "실질 로그"라고 불러도, 기니Pocket의 로그에는 단순한 인벤토리 수정 이상의 내용이 포함되어 있습니다.

source: produce a log on the handheld device
ko: 휴대용 장치에 통나무를 달다

source: import the log in the desktop database
ko: 데스크탑 데이터베이스의 로그 가져오기

source: first of all, copy the collected information from ghini.pocket into your computer::
ko: 우선, 수집된 정보를 기니에서 복사하세요.컴퓨터에 포켓 연결:

source: then use ghini.desktop to import this information into your database.
ko: 그런 다음 ghini.dump를 사용하여 이 정보를 데이터베이스로 가져옵니다.

source: d2w: send a selection of your garden data to ghini.web
ko: d2w: 선택한 정원 데이터를 기니에게 보냅니다.거미줄을 치다
uk: d2w: відправте вибрані дані вашого саду на ghini.web

source: Offer a selection of your garden data to a central ghini.web site, so online virtual visitors can browse it. This includes plant identification and their geographic location.
ko: 중앙 기니에게 정원 데이터 선택 항목을 제공합니다.온라인 가상 방문자가 검색할 수 있도록 웹 사이트입니다. 여기에는 발전소 식별 및 지리적 위치가 포함된다.
uk: Пропонуйте вибрані дані вашого саду на центральний сайт ghini.web, щоб онлайн-відвідувачі могли переглядати його. Це включає в себе ідентифікацію рослин та їх географічне розташування.

source: content of this flow:
ko: 이 흐름의 내용:
uk: вміст цього потоку:

source: garden: coords, name, zoom level (for initial view)
ko: 정원: 좌표, 이름, 확대/축소 수준(초기 보기용)
uk: сад: координати, назва, рівень масштабування (для початкового перегляду)

source: plants: coords, identification, zoom level (for visibility)
ko: 식물: 좌표, 식별, 확대/축소 수준(가시성을 위해)
uk: рослини: координати, ідентифікація, рівень масштабування (за видимості)

source: species: binomial, phonetic approximation
ko: 종: 이항, 음성 근사치
uk: види: біноміальне, фонетичне наближення

source: g2w: add geographic non-botanic data to ghini.web
ko: g2w: 지리적으로 비확장 데이터를 ghini에 추가합니다.거미줄을 치다

source: Write geographic information about non-botanic data (ie: point of interest within the garden, required by ghini.tour) in the central ghini.web site.
ko: 중앙 기니에서 보타닉이 아닌 데이터(즉, ghini.tour에 필요한 정원 내 관심 지점)에 대한 지리적 정보를 작성합니다.웹 사이트.
uk: Напишіть географічну інформацію про не-ботанічні дані (тобто: визначну пам'ятку в саду, потрібну ghini.tour) на веб-сайті ghini.web.

source: virtual panels: coords, title, audio file
ko: 가상 패널: 좌표, 제목, 오디오 파일
uk: віртуальні панелі: координати, заголовок, аудіофайл

source: photos: coords, title, picture
ko: 사진: 좌표, 제목, 사진
uk: фотографії: координати, назва, зображення

source: virtual panels don't necessarily have an associated photo, photos don't necessarily have an associated audio file.
ko: 가상 패널에는 반드시 연결된 사진이 없으며, 사진에는 반드시 연결된 오디오 파일이 없습니다.
uk: віртуальні панелі не обов'язково мають пов'язану фотографію, фотографії не обов'язково мають пов'язаний звуковий файл.

source: w2t: importing locations and POIs from ghini.web to tour
ko: w2t: 기니에서 위치 및 POI를 가져옵니다.웹 투 투어
uk: w2t: імпортування місць розташування та POI з ghini.web до екскурсії

source: Garden (coords, name, zoom level)
ko: 정원(좌표, 이름, 확대/축소 수준)
uk: Сад (координати, назва, рівень масштабування)

source: Points of Interest (coords, title, audio file, photo)
ko: 관심장소(좌표, 제목, 오디오 파일, 사진)
uk: Цікаві місця (координати, назва, аудіофайл, фото)

source: Ghini's goals and highlights
es: Objetivos y puntos resaltados de Ghini
it: Obiettivi e punti salienti
ko: 기니의 목표와 하이라이트
uk: Цілі Ghini та основні моменти

source: Should you use this software? This question is for you to answer. We trust that if you manage a botanic collection, you will find Ghini overly useful and we hope that this page will convince you about it.
es: ¿Debe utilizar este software? Esta pregunta es para usted. Confiamos que si usted maneja una colección botánica, encontrará Ghini demasiado útil y esperamos que esta página le motive a ensayarlo.
it: Dovreste usare questo software? Questa domanda è per voi di rispondere. Siamo sicuri che se si gestisce una collezione botanica, troverete Ghini eccessivamente utile e ci auguriamo che questa pagina vi convincerà su di esso.
ko: 이 소프트웨어를 사용할까요?로 답변 드리기 이 질문은.우리는 만약 당신이 식물원 수집 관리하고, 여러분은 과도하게 유용한 Ghini을 찾을 것이다. 그리고 이 페이지 이것에 대해 납득시키기를 바라를 신뢰한다.
uk: Повинні ви використовувати це програмне забезпечення? Це питання для вас, щоб відповісти. Ми віримо, що якщо ви керуєте ботанічною колекцією, ви знайдете Ghini досить корисним, і ми сподіваємось, що ця сторінка переконає вас у цьому.

source: This page shows how Ghini makes software meet the needs of a botanic garden.
es: Esta página muestra cómo Ghini distribuye software que encuentra las necesidades de un jardín botánico.
it: Questa pagina Mostra come Ghini rende il software soddisfare le esigenze di un giardino botanico.
ko: 이 페이지는 Ghini가 어떻게 소프트웨어를 식물원의 요구에 맞게 만드는지 보여줍니다.
uk: Ця сторінка показує, як Ghini робить програмне забезпечення задовольняє потреби ботанічного саду.

source: If you already know, and all you want is to do something practical, just `install the software <installing.html>`_, then check our `user-contributed recipes <use_cases.html>`_.
ko: 만약 여러분이 이미 알고 있고 여러분이 원하는 것은 실용적인 것을 하는 것이라면, "소프트웨어 <installing.html"을 설치한 다음, "사용자 제작 레시피 <use_cases.html>"를 확인해 보세요.
uk: Якщо ви вже знаєте, і все, що ви хочете, це зробити щось практичне, просто `встановіть програмне забезпечення <installing.html>`_, а потім перевірте наші `користувацькі рецепти <use_cases.html>`_.

source: Botanic Garden
es: Jardín Botánico
it: Giardino botanico
ko: 식물원
uk: Ботанічний сад

source: According to the Wikipedia, »A botanic(al) garden is a garden dedicated to the collection, cultivation and display of a wide range of plants labelled with their botanical names«, and still according to the Wikipedia, »a garden is a planned space, usually outdoors, set aside for the display, cultivation, and enjoyment of plants and other forms of nature.«
es: Según la Wikipedia, »un jardín botánico es un jardín dedicado a la recolección, cultivo y exhibición de una amplia gama de plantas con sus nombres botánicos« y todavía según la Wikipedia, »un jardín es un espacio planeado, generalmente al aire libre, destinado a la exhibición, cultivo y disfrute de las plantas y otras formas de la naturaleza.«
it: Secondo Wikipedia,» un botanic(al) giardino è un giardino dedicato per la raccolta, la coltivazione e la visualizzazione di una vasta gamma di piante etichettati con i loro nomi botanici «e ancora secondo il Wikipedia,» un giardino è uno spazio progettato, solitamente all'aperto, mettere da parte per la visualizzazione, la coltivazione e il godimento delle piante e altre forme di natura. «
ko: 위키백과에 따르면, "식물원(al) 정원"은 식물명을 가진 다양한 식물들의 수집, 재배, 전시를 위한 정원이며, 여전히 위키백과에 따르면, "정원은 보통 야외에서 계획된 공간이며, 식물과 다른 형태의 식물들의 전시, 재배, 즐거움을 위한 공간이다.튜레의
uk: Згідно з Вікіпедією, »Ботанічний сад - це сад, присвячений збиранню, вирощуванню та виведенню широкого спектру рослин, позначених їхніми ботанічними іменами«, і, як вважає Вікіпедія, »сад є запланованим місцем , як правило, на відкритому повітрі, відведеному для відображення, вирощування та насолоди рослинами та іншими формами природи.«

source: So we have in a botanic garden both the physical space, the garden, as its dynamic, the activities to which the garden is dedicated, activities which makes us call the garden a botanic garden.
es: Así que tenemos en un jardín botánico tanto el espacio físico, el jardín, como su dinámica, las actividades a que se dedica el jardín, actividades que nos hace llamar al jardín un jardín botánico.
it: Così abbiamo in un giardino botanico sia lo spazio fisico, il giardino, come sua dinamica, le attività a cui è dedicato il giardino, attività che ci fa chiamare il giardino un giardino botanico.
ko: 그래서 우리는 식물원 안에 물리적 공간, 정원의 역동성, 정원이 바쳐지는 활동, 정원을 식물원이라고 부르는 활동들을 가지고 있습니다.
uk: Таким чином, ми маємо в ботанічному саду як фізичний простір, сад, так і його динаміку, діяльність, до якої присвячений сад, діяльність, яка змушує нас називати сад ботанічним садом.

source: **the physical garden**
es: **el jardín en cuanto jardín**
it: **il fisico giardino**
ko: **물리적 정원**
uk: **фізичний сад**

source: **collection related activities in the garden**
es: **actividades del jardín, relacionadas a la colección**
it: **raccolta attività correlate in giardino**
ko: **Physical Garden**
uk: **пов'язані з колекцією роботи в саду**

source: Botanic Garden Software
es: Software para Jardines Botánicos
it: Giardino botanico Software
ko: 보타닉 가든 소프트웨어
uk: Ботанічний сад програмне забезпечення

source: At the other end of our reasoning we have the application program Ghini, and again quoting the Wikipedia, »an application program is a computer program designed to perform a group of coordinated functions, tasks, or activities for the benefit of the user«, or, in short, »designed to help people perform an activity«.
es: En el otro extremo de nuestro razonamiento tenemos el programa aplicativo Ghini y nuevamente citando la Wikipedia, »un programa aplicativo es un programa diseñado para realizar un grupo coordinato de funciones, tareas o actividades a beneficio del usuario«, o, en definitiva, »diseñado para ayudar a las personas a realizar una actividad«.
it: A altra estremità del nostro ragionamento abbiamo l'applicazione programma Ghini e ancora una volta citando Wikipedia,» un programma applicativo è un programma per computer progettato per eseguire un gruppo di funzioni di coordinamento, attività o attività a vantaggio dell'utente «, o, in breve,» progettato per aiutare le persone a svolgere un'attività «.
ko: 우리의 추론의 다른 쪽 끝에는 애플리케이션 프로그램 기니가 있고, 위키백과를 다시 인용하면, 애플리케이션 프로그램은 사용자의 이익을 위해 조정된 기능, 작업 또는 활동의 그룹을 수행하도록 설계된 컴퓨터 프로그램이며, 간단히 말해서, 사람들이 활동을 하도록 돕기 위해 고안된 것이다.
uk: З протилежного боку нашого міркування ми маємо прикладну програму Ghini, і знову цитуючи Вікіпедію »прикладна програма є комп'ютерною програмою, призначена для виконання групи узгоджених функцій, завдань або діяльності в інтересах користувача« або , коротше кажучи, »призначена, щоб допомогти людям виконувати свою діяльність«.

source: Data and algorithms within Ghini have been designed to represent the physical space and the dynamic of a botanic garden.
es: Datos y algoritmos dentro de Ghini han sido diseñados para representar el espacio físico y la dinámica de un jardín botánico.
it: Dati e algoritmi all'interno Ghini sono stati progettati per rappresentare lo spazio fisico e la dinamica di un giardino botanico.
ko: 기니 내의 데이터와 알고리즘은 식물원의 물리적 공간과 역동성을 나타내도록 설계되었다.
uk: Дані та алгоритми в межах Ghini були розроблені, щоб відобразити фізичний простір та динаміку ботанічного саду.

source: **core structure of Ghini's database**
es: **la estructura esencial de la base de datos Ghini**
it: **struttura di database** di Ghini
ko: **Ghini 데이터베이스의 핵심 구조**
uk: **основна структура бази даних Ghini**

source: In the above figure, a simplified view on the database, the highlighted blocks are those relative to objects you definitely need insert in the database.
ko: 위의 그림에서, 데이터베이스의 단순화된 보기, 강조 표시된 블록은 데이터베이스에 삽입해야 하는 객체와 관련된 블록입니다.
uk: На вищезгаданому малюнку, спрощений погляд на базу даних, виділені блоки є тими, що відносяться до об'єктів, які ви обов'язково повинні внести в базу даних.

source: We distinguish three main sections in the database. Start reading the graph from the right hand side, with the relevant **Taxonomy** information, then step to administering your **Collection**, and finally consider the physical **Garden**.
ko: 우리는 데이터베이스에서 세 개의 주요 섹션을 구별한다. 관련 **Taxonomy** 정보를 사용하여 그래프를 읽기 시작한 후 **Collection** 관리 단계를 수행하고 마지막으로 물리적 **Garden***를 고려합니다.
uk: Ми виділяємо три основні розділи в базі даних. Почніть читання графіка з правої сторони, з відповідною інформацією **Таксономія**, потім крок до адміністрування вашої **Колекції ** і, нарешті, розгляньте фізичний **Сад**.

source: The central element in Ghini's point of view is the ``Accession``. Following its links to other database objects lets us better understand the structure:
es: El elemento central de la base de datos Ghini es la ``Accession`` (Accesión). Seguir los enlaces a las otras tabelas de la base de datos nos permite entender mejor su estructura:
it: L'elemento centrale nel punto di vista di Ghini è la accessione (``Accession``). Seguendo i suoi collegamenti agli altri oggetti di database ci permette di comprenderne meglio la struttura:
ko: 기니의 관점에서 중심적인 요소는 ``액세스션"이다. 다른 데이터베이스 개체에 대한 링크를 클릭하면 다음 구조를 더 잘 이해할 수 있습다:
uk: Центральним елементом з точки зору Ghini є ``Приєднання``. Після посилання на інші об'єкти бази даних ми зможемо краще зрозуміти структуру:

source: **Accession links Planting to Species**
ko: **액세스 링크 종에 대한 심기**
uk: **Приєднання зв'язків Посадка до Видів **

source: An ``Accession`` represents the action of receiving this specific plant material in the garden. As such, ``Accession`` is an abstract concept, it links physical living ``Plantings`` —groups of plants placed each at a ``Location`` in the garden— to the corresponding ``Species``. It is not the same as an acquisition from a source, because in a single acquisition you can access material of more than one species. In other words: a single aquisition can embark multiple accessions. An ``Accession`` has zero or more ``Plantings`` associated to it (0..n), and it is at all times connected to exactly 1 ``Species``. Each ``Planting`` belongs to exactly one ``Accession``, each ``Species`` may have multiple ``Accessions`` relating to it.
ko: "접근"은 정원에서 이 특정한 식물 재료를 받는 행위를 의미한다. 이처럼 '액세스션'은 추상적인 개념으로 정원의 '위치'에 각각 놓여 있는 식물군인 '식물군'을 해당 '종'과 연결시킨다. 소스로부터의 획득과 동일하지 않습니다. 단일 획득에서는 둘 이상의 종에 대한 재료에 액세스할 수 있기 때문입니다. 즉, 단일 획득이 여러 액세스에 착수할 수 있습니다. '액세스션'에는 0개 이상의 '식물'이 관련돼 있고(0..n) 항상 정확히 1개 '종'과 연결되어 있다. 각각의 ``식물"은 정확히 하나의 "접속"에 속하며 각각의 "종"은 그것과 관련된 여러 개의 "접속"을 가질 수 있다.

source: An ``Accession`` stays in the database even if all of its ``Plantings`` have been removed, sold, or have died. Identifying the ``Species`` of an ``Accession`` consistently connects all its ``Plantings`` to the ``Species``.
es: Una ``Accession`` permanece en la base de datos aunque todas sus ``Planting`` hayan sido removidas, vendida, o se hayan muerto. Al individuar la ``Species`` de una ``Accession`` se conecta en manera consistente todas sus ``Planting`` a la misma ``Species``.
it: Una ``Accssion`` rimane nel database anche se tutti i suoi ``Planting`` stati rimossi, venduto, o sono morti. Identificare la ``Species`` di una ``Accession`` equivale al connettere in modo consistente tutti i suoi ``Planting`` alla stessa ``Species``.
ko: '액세스션'은 모든 ``플랜팅"이 제거되거나, 판매되거나, 죽더라도 데이터베이스에 남아 있다. '액세스션'의 '종'을 식별하면 모든 '식물'과 '종'이 일관되게 연결된다.
uk: ``Приєднання`` залишається в базі даних, навіть якщо всі його ``Насадження`` були вилучені, продані або загинули. Визначення ``Видів`` з `` Приєднання`` послідовно пов'язує всі його ``Насадження`` до `` Видів``.

source: **Accession at the base of the history of your plants**
ko: **식물 역사의 기초에 접근**

source: ``Propagations`` and ``Contacts`` provide plant material for the garden; this information is optional and smaller collectors might prefer to leave this aside. A ``Propagation`` trial may be unsuccessful, most of the time it will result in exactly one accession, but it may also produce slightly different taxa, so the database allows for zero or more ``Accessions`` per ``Propagation`` (0..n). Also a ``Contact`` may provide zero or more ``Accessions`` (0..n).
es: ``Propagation`` y ``Contact`` proporcionan material vegetal para el jardín; Esta información es opcional y coleccionistas más pequeño pueden preferir dejar esta a un lado. Un ensayo de ``Propagation`` puede ser infructuoso, mayoría de las veces resultará en exactamente una accesión, pero puede también producir ligeramente diferentes taxones, por lo que la base de datos permite cero o más ``Accession`` por ``Propagation`` (0..n). También un ``Contact`` puede dar cero o más ``Accession`` (0..n).
it: Contatti esterni (``Contact``) o lo stesso orto botanico a traverso di propagazioni (``Propagation``) forniscono materiale vegetale per il giardino; Questa informazione è facoltativa e collezionisti più piccoli potrebbero preferire non approfittare di questa sezione del software. Una prova di ``Propagation`` potrebbe non riuscire, il più delle volte il risultato sarà esattamente una ``Accession``, ma può anche produrre ``Species`` leggermente differenti, quindi il database permette di zero o più ``Accession`` a ``Propagation`` (0.. n). Anche un ``Contact`` può fornire zero o più ``Accession`` (0.. n).
ko: "전파"와 "연락처"는 정원에 식물 재료를 제공한다. 이 정보는 선택 사항이며 소규모 수집가들은 이것을 그냥 내버려두는 것을 선호할 수 있다. ``전파" 재판은 성공하지 못할 수도 있는데, 대부분의 경우 그것은 정확히 하나의 가입으로 귀속될 수도 있지만 약간 다른 세금도 발생할 수 있기 때문에 데이터베이스는 "전파"(0..n)당 0개 이상의 "접속"을 허용한다. 또한 '연락처'는 0 또는 그 이상의 '액세스'(0..n)를 제공할 수 있다.
uk: ``Розмноження`` та ``Контакти`` забезпечують рослинний матеріал для саду; ця інформація є необов'язковою, і менші колекціонери можуть віддати перевагу залишити це в стороні. Процес ``Розповсюдження`` може виявитися невдалим, у більшості випадків це призведе точно до одного приєднання, але це також може призвести дещо інших таксонів, тому база даних дозволяє нуль або більше ``Приєднань`` за ``Розповсюдження`` (0..n). Також ``Контакт`` може надавати нуль або більше ``Приєднання`` (0..n).

source: **Accession and Verification opinions**
ko: **접근 및 검증의견**

source: Specialists may formulate their opinion about the ``Species`` to which an ``Accession`` belongs, by providing a ``Verification``, signing it, and stating the applicable level of confidence.
es: Especialistas pueden exprimir una opinión sobre la ``Species`` a que pertenece una ``Accession``, formulando una ``Verification``, poniendo su firma, y afirmando el nivel de confianza a aplicar.
it: Specialisti possono formulare il loro parere circa la 'specie' a cui appartiene un 'accessione', fornendo una 'verifica', firmarlo, e affermando il livello applicabile di fiducia.
ko: 전문가들은 '접근'이 속한 '종'에 대해 '검증'을 제공하고 서명하며 해당 신뢰도를 명시함으로써 의견을 공식화할 수 있다.
uk: Спеціалісти можуть сформулювати свою думку щодо ``Видів``, до яких належить ``Приєднання``, шляхом надання ``Верифікації``, підписання та встановлення відповідного рівня довіри.

source: **Accessing your own Propagations**
ko: **자신의 전파 액세스**
uk: **Доступ до власних розповсюджень**
