Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Database Administration
es: Administración de bases de datos
it: Amministrazione di basi di dati
ko: 데이터베이스 관리
uk: Адміністрування бази даних

source: If you are using a real DBMS to hold your botanic data, then you need do something about database administration. While database administration is far beyond the scope of this document, we make our users aware of it.
es: Si utiliza un verdadero DBMS para mantener sus datos botánicos, necesitará hacer algo de administración de base de datos. Aunque la administración de base de datos está fuera del alcance de este documento, por lo menos alertamos nuestros usuarios de esta necesidad.
it: Nel caso si stia utilizzando un vero e proprio DBMS (sistema di gestione di basi di dati) per contenere le collezioni di Ghini, è importante prendere in considerazione l'amministrazione di questo DBMS. Una descrizione del compito di amministrare una base dati è qui assolutamente fuori luogo, ma è importante che l'utente sia consapevole del problema.
ko: 실제 DBMS를 사용하여 플랜트 데이터를 저장하는 경우 데이터베이스 관리를 수행해야합니다. 데이터베이스 관리는이 문서의 범위를 훨씬 벗어납니다. 사용자가 추가 작업을 알고 있어야하기 때문에 여기서 언급합니다.
uk: Якщо ви використовуєте реальну СУБД для зберігання ваших ботанічних даних, то вам потрібно робити адміністрування бази даних. Хоча адміністрування баз даних далеко виходить за рамки цього документа, ми виходимо з того, що наші користувачі знають про це.

source: SQLite is not what one would consider a real DBMS: each SQLite database is just in one file. Make safety copies and you will be fine. If you don't know where to look for your database files, consider that, per default, bauble puts its data in the ``~/.bauble/`` directory.
es: SQLite no es lo que se podría considerar un DBMS real: cada base de datos SQLite está en un archivo. Haga copias de seguridad y estará bien. Si no sabe dónde buscar los archivos de base de datos, considere que, por defecto, bauble coloca sus datos en el directorio ``~/.bauble/``.
it: SQLite offre una soluzione in quanto SQLite non è esattamente quanto si potrebbe definire un DMBS: ogni base dati SQLite è un file, farne copia di emergenza (backup) sarà sufficiente. Se si è creata la connessione alla base dati SQLite accettando i valori per difetto, il file relativo alla connessione si trova nella directory ``~/.bauble/`` (con Windows bisognerà trovare la ``AppData``).
ko: SQLite는 DBMS로 간주 할 수있는 것이 아닙니다. 각 SQLite 데이터베이스는 파일 일뿐입니다. 백업 복사본을 만들면 모든 것이 정상입니다. 데이터베이스 파일을 찾을 위치를 모르는 경우 기본적으로 Ghini가 데이터를 ``~/.bauble/``-디렉토리에 저장한다는 점을 고려하십시오.
uk: SQLite - це не те, що можна розглянути як справжню СУБД: кожна база даних SQLite знаходиться тільки в одному файлі. Зробіть копії для безпеки, і ви будете в порядку. Якщо ви не знаєте, де шукати ваші файли бази даних, то вважається, що за замовчуванням, bauble поміщає свої дані в ``~/.bauble/`` каталог.

source: In Windows it is somewhere in your ``AppData`` directory, most likely in ``AppData\Roaming\Bauble``. Do keep in mind that Windows does its best to hide the ``AppData`` directory structure to normal users.
es: En Windows está en algún lugar en el directorio ``AppData``, probablemente en ``AppData\Roaming\Bauble``. Tenga en cuenta que Windows hace todo lo posible para ocultar la estructura de directorios ``AppData`` a los usuarios normales.
it: In Windows è da qualche parte nella directory ``AppData``, molto probabilmente in ``AppData\Roaming\Bauble``. Tenete a mente che Windows fa del suo meglio per nascondere la struttura ``AppData`` agli utenti normali.
ko: Windows에서는 ``AppData`` 디렉토리, 아마도 ``AppDataRoamingBauble``-에 있습니다. Windows는 일반 사용자를 위해 ``AppData`` 디렉터리 구조를 숨기기 위해 최선을 다하고 있습니다.
uk: У Windows це десь у каталозі `` AppData``, швидше за все, в ``AppData\Roaming\Bauble``. Майте на увазі, що Windows робить все можливе, щоб приховати ``AppData`` структуру каталогів для звичайних користувачів.

source: The fastest way to open it is with the file explorer: type ``%APPDATA%`` and hit enter.
es: La forma más rápida de abrir es con el explorador de archivos: escriba ``%APPDATA%`` y pulse entrar.
it: Il modo più veloce per aprirlo è con *Esplora Risorse*: inserisci ``%APPDATA%`` e premi INVIO.
ko: 파일을 여는 가장 빠른 방법은 파일 관리자를 사용하는 것입니다 :``%APPDATA%``-를 입력하고 엔터를 누르세요.
uk: Найшвидший спосіб його відкрити за допомогою файлового провідника: тип ``%APPDATA%`` і натиснути Enter.

source: Please refer to the `official documentation <https://mariadb.com/kb/en/the-mariadb-library/documentation/>`_.
ko: 마이그레이션이 필요하면 `페이지를 <https://mariadb.com/kb/en/the-mariadb-library/documentation/>`_ 참조하세요.
uk: Будь ласка зверніться до `офіційної документації <https://mariadb.com/kb/en/the-mariadb-library/documentation/>`_.

source: Backing up and restoring databases is described in breadth and depth starting at `this page <https://mariadb.com/kb/en/the-mariadb-library/backing-up-and-restoring-databases/>`_.
ko: 데이터베이스의 백업과 복원은 `다음페이지에 <https://mariadb.com/kb/en/the-mariadb-library/backing-up-and-restoring-databases/>`_ 자세히 설명되어 있으니 활용하세요.
uk: Резервне копіювання та відновлення баз даних широко і глибоко описано починаючи з `цієї сторінки <https://mariadb.com/kb/en/the-mariadb-library/backing-up-and-restoring-databases/>`_.

source: Please refer to the official documentation. A very thorough discussion of your backup options starts at `chapter 24 <http://www.postgresql.org/docs/9.1/static/backup.html>`_.
es: Por favor, consulte la documentación oficial. Una discusión muy completa de las opciones de copia de seguridad inicia al `capítulo 24 <http://www.postgresql.org/docs/9.1/static/backup.html>`_.
ko: 백업 옵션에 대한 `설명은24 장 으로 <http://www.postgresql.org/docs/9.1/static/backup.html>`_ 넘어갑니다.
uk: Будь ласка, зверніться до офіційної документації. Дуже ретельне обговорення варіантів резервного копіювання починається з `розділу 24 <http://www.postgresql.org/docs/9.1/static/backup.html>`_.

source: Ghini Configuration
es: Configuración de Ghini
it: Configurazione di Ghini
ko: Ghini의 구성
uk: Конфігурація Ghini

source: Ghini uses a configuration file to store values across invocations. This file is associated to a user account and every user will have their own configuration file.
es: Ghini utiliza un archivo de configuración para almacenar valores entre invocaciones. Este archivo está asociado a una cuenta de usuario y cada usuario tendrá su propio archivo de configuración.
it: Ghini utilizza un file di configurazione per memorizzare i valori tra le chiamate. Questo file è associato all'account dell'utente, così ogni utente avrà il suo file di configurazione.
ko: Ghini는 구성 파일을 사용하여 호출간에 값을 저장합니다. 이 파일은 사용자 계정에 연결되며 모든 사용자는 고유 한 구성 파일을 갖게됩니다.
uk: Ghini використовує файл конфігурації для зберігання значень через виклики. Цей файл пов'язаний з обліковим записом користувача, і кожен користувач матиме власний файл конфігурації.

source: To review the content of the Ghini configuration file, type ``:prefs`` in the text entry area where you normally type your searches, then hit enter.
es: Para revisar el contenido del archivo de configuración de Ghini, escriba ``:prefs`` en el área de entrada de texto donde normalmente se escribe las búsquedas, luego presione entrar.
it: Per esaminare il contenuto del file di configurazione Ghini, digitare ``:prefs`` nell'area di immissione testo dove normalmente tipo le ricerche, quindi premere INVIO.
ko: Ghini 구성 파일의 내용을 검토하려면 일반적으로 검색을 입력하는 텍스트 항목 영역에 ``:prefs``-를 입력한 다음 enter를 누르십시오.
uk: Щоб переглянути вміст конфігураційного файлу Ghini, введіть ``:prefs`` в області введення тексту, де ви зазвичай вводите пошукові запити, а потім натисніть enter.

source: You normally do not need tweaking the configuration file, but you can do so with a normal text editor program. Ghini configuration file is at the default location for SQLite databases.
es: Normalmente no es necesario ajustar el archivo de configuración, pero puede hacerlo con un programa de editor de texto normal. El Archivo de configuración Ghini está en la ubicación predeterminada para bases de datos SQLite.
it: Normalmente non è necessario modificare il file di configurazione, ma è possibile farlo con un programma di editor di testo normale. File di configurazione di Ghini è il percorso predefinito per i database SQLite.
ko: 일반적으로 구성 파일을 조정할 필요가 없지만 일반 텍스트 편집기 프로그램을 사용하여 조정할 수 있습니다. Ghini 구성 파일은 SQLite 데이터베이스의 기본 위치에 있습니다.
uk: Вам зазвичай не потрібно налаштувати файл конфігурації, якщо потрібно це можна зробити за допомогою звичайного текстового редактора. Конфігураційний файл Ghini знаходиться за замовчуванням папці бази даних SQLite.

source: Reporting Errors
es: Reportar errores
it: Prospetto errori
ko: 오류보고
uk: Повідомлення про помилки

source: Should you notice anything unexpected in Ghini's behaviour, please consider filing an issue on the Ghini development site.
es: Si nota algo inesperado en el comportamiento de Ghini que no le parezca adecuado, por favor abra un ``issue`` en el sitio de desarrollo de Ghini.
it: Se notate qualcosa di imprevisto nel comportamento di Ghini, si prega di considerare un problema di deposito sul sito di sviluppo Ghini.
ko: Ghini를 활용하면서 발생하는 예상치 못한 오류는 Ghini개발자에게 문제를 보내주세요.
uk: Якщо ви помітили що-небудь несподіване в поведінці Ghini, будь ласка, подайте проблеми на сайт розробки Ghini.

source: Ghini development site can be accessed via the Help menu.
es: El sitio de desarrollo de Ghini es accesible desde el menú de Ayuda.
it: Ghini lo sviluppo del sito sono accessibili tramite il menu di aiuto.
ko: Ghini는 도움말 메뉴를 통해 액세스 할 수 있습니다.
uk: Сайт розробки Ghini можна отримати за допомогою меню Довідка.

source: Developer's Manual
es: Manual del desarrollador
it: Manuale dello sviluppatore
ko: 개발자 매뉴얼
uk: Посібник розробника

source: If you ran the ``devinstall`` installation instructions, you have downloaded the sources, connected to the github repository. You are in the ideal situation to start looking into the software, understand how it works, contribute to ghini.desktop's development.
ko: ``devinstall ''설치 지침을 실행했다면 github 저장소에 연결된 소스를 다운로드 한 것입니다. 소프트웨어 조사를 시작하고 작동 방식을 이해하고 ghini.desktop의 개발에 기여할 수있는 이상적인 상황입니다.

source: Helping Ghini development
es: Ayuda al desarrollo de Ghini
it: Sostieni lo sviluppo di Ghini
ko: Ghini 개발 지원
uk: Допомога в розвитку Ghini

source: If you want to contribute to Ghini, you can do so in quite a few different ways:
es: Si desea contribuir al Ghini, puede hacerlo de diferentes maneras:
it: Se volete contribuire a Ghini, può farlo in diversi modi:
ko: Ghini에 기여하고 싶다면 다음과 같은 여러 가지 방법으로 기여할 수 있습니다:
uk: Якщо ви хочете внести свій внесок у Ghini, ви можете зробити це кількома різними способами:

source: Use the software, note the things you don't like, `open an issue <http://github.com/Ghini/ghini.desktop/issues/new>`_ for each of them. A developer will react sooner than you can imagine.
es: Utilice el software, anote lo que menos le gusta, `abra una issue <http://github.com/Ghini/ghini.desktop/issues/new>`_ para cada punto. Un desarrollador se activará antes que usted pueda imaginarse.
it: Utilizzare il software, notare cosa piace di meno e potrebbe essere corretto, ``segnalarlo come problema <http://github.com/ghini/ghini.desktop/issues/new>`_ separatamente. Uno sviluppatore reagirà prima di quanto si possa immaginare.
ko: 소프트웨어를 사용하고 마음에 들지 않는 부분을 확인하고 각각에 대해`<http://github.com/Ghini/ghini.desktop/issues/new>`_ 문제를 엽니 다. 개발자는 상상할 수 있는 것보다 빨리 반응 할 것입니다.
uk: Використовуйте програмне забезпечення, відзначте те, що вам не подобається, `відкрийте проблему <http://github.com/Ghini/ghini.desktop/issues/new>` _ для кожної з них. Розробник буде реагувати швидше, ніж ви можете собі уявити.

source: If you have an idea of what you miss in the software but can't quite formalize it into separate issues, you could consider hiring a professional. This is the best way to make sure that something happens quickly on Ghini. Do make sure the developer opens issues and publishes their contribution on github.
es: Si tienes una idea de lo que le hace falta en el software pero no piensa saberlo formalizar en cuestiones separadas, podría considerar contratar a un profesional. Se trata de la mejor manera de asegurarse de que algo ocurra rápido en Ghini. Asegúrese de que el desarrollador abra issues y publique sus contribuciones en github.
it: Se avete un'idea di ciò che manca nel software ma non abbastanza e formalizzare in questioni separate, si potrebbe prendere in considerazione l'assunzione di un professionista. Questo è il modo migliore per assicurarsi che qualcosa accade rapidamente su Ghini. Assicurarsi che lo sviluppatore apra problemi su github e vi pubblichi il contributi.
ko: 소프트웨어에서 놓친 부분에 대한 아이디어가 있지만 이를 별도의 문제로 공식화 할 수 없는 경우 전문가를 고용하는 것이 좋습니다. 이것은 Ghini에서 어떤 일이 빠르게 발생하도록 하는 가장 좋은 방법입니다. 개발자가 이슈를 열고 github에 기여를 게시하는지 확인하십시오.
uk: Якщо у вас є ідея про те, що пропущено в програмному забезпеченні, але не можете повністю формалізувати її в окремі питання, ви можете розглянути питання про наймання професіонала. Це найкращий спосіб переконатися, що щось відбувається швидко на Ghini. Переконайтеся, що розробник відкриває проблеми та публікує їхній внесок у github.

source: Translate! Any help with translations will be welcome, so please do! you can do this without installing anything on your computer, just using the on-line translation service offered by http://hosted.weblate.org/
es: ¡Traducir! Cada ayuda con las traducciones será bienvenida, así que por favor ¡traduzca! puede hacer esto sin necesidad de instalar nada en tu ordenador, simplemente usando el servicio de traducción en línea ofrecido por `weblate <http://hosted.weblate.org/>`_
it: Traduci! Qualsiasi aiuto con traduzione sarà gradito, così si prega di tradurre! è possibile farlo senza installare nulla sul tuo computer, usando solo il servizio di traduzione on-line offerti da http://hosted.weblate.org/
ko: 번역하다! 번역에 대한 모든 도움을 환영합니다. http://hosted.weblate.org/에서 제공하는 온라인 번역 서비스를 사용하면 컴퓨터에 아무것도 설치하지 않고도 이 작업을 수행 할 수 있습니다
uk: Перекласти! Будь-яка допомога з перекладом буде прийнята, тому, будь ласка, будь ласка! Ви можете це зробити, не встановлюючи нічого на своєму комп'ютері, просто скористайтеся службою перекладів онлайн, яку пропонує http://hosted.weblate.org/

source: fork the respository, choose an issue, solve it, open a pull request. See the `bug solving workflow`_ below.
es: haga un fork del repositorio, eliga un problema, lo resuelva, abra una pull request. Ver el `bug solving workflow`_ a continuación.
it: “Fork the repository”, scegliere un problema, risolverlo, aprire una richiesta “pull request”. Vedere il `flusso di lavoro per risolvere bug`_ qui sotto.
ko: 리포지토리를 포크하고, 문제를 선택하고, 해결하고, 풀 요청을 엽니다. 아래의`버그 해결 워크플로우`_를 참조하십시오.
uk: виділіть репозиторій, виберіть проблему, вирішіть її, відкрийте запит зняти. Дивіться `bug solving workflow`_ нижче.

source: If you haven't yet installed Ghini, and want to have a look at its code history, you can open our `github project page <http://github.com/Ghini/ghini.desktop>`_ and see all that has been going on around Ghini since its inception as Bauble, back in the year 2004.
es: Si todavía no has instalado Ghini y quiere echar un vistazo a la historia de su código y documentación, puede abrir nuestra `página de github <http://github.com/ghini/ghini.desktop>`_ y ver todo lo que ha estado sucediendo con Ghini desde sus inicios en el año 2004 bajo el nombre de Bauble.
it: Se non hai ancora installato Ghini e desideri dare un'occhiata alla storia del suo codice, è possibile aprire la nostra `pagina progetto github <http://github.com/ghini/ghini.desktop>`_ e vedere tutto ciò che s'è fatto intorno a Ghini fin dalla sua nascita nel 2004 come Bauble.
ko: 아직 Ghini를 설치하지 않았고 코드 기록을 보고 싶다면`github 프로젝트 페이지 <http://github.com/Ghini/ghini.desktop>`_를 열고 2004 년에 Bauble로 시작된 이래 Ghini를 둘러 보았습니다.
uk: Якщо ви ще не встановили Ghini і хочете поглянути його історію кодів, ви можете відкрити нашу `github сторінку проекту <http://github.com/Ghini/ghini.desktop>`_і побачити все, що відбувалося навколо Ghini з моменту його створення, як в Bauble, ще в 2004 році.

source: If you install the software according to the ``devinstall`` instructions, you have the whole history in your local git clone.
ko: ``devinstall ''지침에 따라 소프트웨어를 설치하면 로컬 git 클론에 전체 기록이 있습니다.

source: Software source, versions, branches
es: Fuente del software, versiones, ramas
it: Fonte del software, versioni, rami
ko: 소프트웨어 소스, 버전, 분기
uk: Джерело програмного забезпечення, версії, розширення

source: If you want a particular version of Ghini, we release and maintain versions as branches. You should ``git checkout`` the branch corresponding to the version of your choice.
es: Si desea una versión particular de Ghini, nosotros las ponemos a disposición como ramas (branch). Usted debe ``git checkout`` de la rama correspondiente a la versión que desea.
it: Se si desidera che una particolare versione di Ghini, abbiamo rilasciare e gestire versioni come rami. Si dovrebbe effettuare il ``git checkout`` del ramo corrispondente alla versione di vostra scelta.
ko: 특정 버전의 Ghini를 원하면 버전을 브랜치로 출시하고 유지합니다. 선택한 버전에 해당하는 브랜치를``git checkout ''해야 합니다.
uk: Якщо ви хочете отримати певну версію Ghini, ми випускаємо та підтримуємо версії як розширення. Ви повинні `` git checkout`` розширення, яку відповідає вибраній вами версії.

source: production line
es: cadena de producción
it: linea di produzione
ko: 생산 라인
uk: виробнича лінія

source: Branch names for Ghini stable (production) versions are of the form ``ghini-x.y`` (eg: ghini-1.0); branch names where Ghini testing versions are published are of the form ``ghini-x.y-dev`` (eg: ghini-1.0-dev).
es: Nombres de rama para las versione esbables (producción) de Ghini son de la forma ``ghini-x.y`` (por ejemplo: ghini-1.0); nombres de rama para el desarrollo de Ghini son de la forma ``ghini-x.y-dev`` (por ejemplo: ghini-1.0-dev).
it: Nomi dei rami per le versioni stabili (produzione) di Ghini sono nella forma ``ghini-x.y`` (ad esempio: ghini-1.0); nomi dei rami dove sono pubblicate le versioni di prova di Ghini sono nella forma ``ghini-x.y-dev`` (ad esempio: ghini-1.0-dev).
ko: Ghini 안정 (프로덕션) 버전의 브랜치 이름은``ghini-x.y ''형식입니다 (예 : ghini-1.0). Ghini 테스트 버전이 게시 된 브랜치 이름은``ghini-x.y-dev ''형식입니다 (예 : ghini-1.0-dev).

source: Development Workflow
es: Flujo de trabajo de desarrollo
it: Flusso di sviluppo
ko: 개발 워크 플로
uk: Процес розробки

source: Our workflow is to continuously commit to the testing branch, to often push them to github, to let travis-ci and coveralls.io check the quality of the pushed testing branches, finally, from time to time, to merge the testing branch into the corresponding release.
es: Nuestro flujo de trabajo incluye la entrega rápida y continua a la rama en prueba, empujando frecuentemente a github, para que travis-ci y coveralls.io comprueben la calidad de las ramas, por último, de vez en cuando, fusionando la rama en prueba en la versión correspondiente.
it: Il nostro flusso di lavoro è di impegnarsi continuamente per la branca di test, spesso di spingerli a github, di lasciare travis-ci e coveralls.io di controllare la qualità dei rami test spinti, infine, di volta in volta, per unire il ramo testing la versione corrispondente.
ko: 우리의 워크플로우는 테스트 브랜치에 지속적으로 커밋하고, 종종 github로 푸시하고, travis-ci 및 coveralls.io가 푸시 된 테스트 브랜치의 품질을 확인하고, 마지막으로 테스트 브랜치를 수시로 병합하도록 하는 것입니다. 해당 릴리스.
uk: Наш робочий процес полягає в тому, щоб постійно займатися тестуванням розширень, часто поширювати їх на github, щоб дозволити travis-ci та coveralls.io перевірити якість тестовних розширень, нарешті, час від часу, об'єднати тестовані розширення у відповідну версію.

source: When working at larger issues, which seem to take longer than a couple of days, I might open a branch associated to the issue. I don't do this very often.
es: Cuando trabajo en cuestiones mayores, que pienso van a durar más que un par de días, podría preferir abrir una rama asociada a la cuestión. No hago esto muy a menudo.
it: Quando si lavora a problemi più grandi, che sembrano richiedere più di un paio di giorni, io potrei aprire una filiale connessa alla questione. Non lo faccio molto spesso.
ko: 며칠 이상 걸리는 것처럼 보이는 더 큰 문제에 대해 작업 할 때 문제와 관련된 분기를 열 수 있습니다. 나는 이것을 자주 하지 않는다.
uk: Під час роботи над складними проблемами, які тривають більше двох днів, я можу відкрити філію, пов'язану з цією проблемою. Я не роблю це дуже часто.

source: larger issues
es: cuestiones mayores
it: problemi più importanti
ko: 더 큰 문제
uk: більше питань

source: When facing a single larger issue, create a branch tag at the tip of a main development line (e.g.: ``ghini-1.0-dev``), and follow the workflow described at
es: Frente a un tema mayor bien identificado, crear una rama etiquetada en el final de una línea de desarrollo principal (por ejemplo: ``ghini-1.0-dev``) y seguir el flujo de trabajo descrito en
it: Quando affronta un problema più grande singolo, creare un tag di ramo all'estremità di una linea di sviluppo principale (ad es.: ``ghini-1.0-dev``) e seguire il flusso di lavoro descritto al
ko: 하나의 더 큰 문제가 발생하면 기본 개발 라인의 끝에 브랜치 태그 (예 :``ghini-1.0-dev '')를 만들고에 설명 된 워크 플로를 따릅니다

source: in short::
es: en breve::
it: In breve::
ko: 요컨대 ::
uk: коротко::

source: Work on the new temporary branch. When ready, go to github, merge the branch with the main development line from which you branched, solve conflicts where necessary, delete the temporary branch.
es: Trabajar en la nueva sucursal de temporal. Cuando esté listo, vaya a github, fusionar la rama con la línea principal de desarrollo de que ramificó, resolver conflictos en caso necesario, eliminar la rama temporal.
it: Lavorare sul nuovo ramo temporaneo. Quando è pronto, andare a github, unire il ramo con la linea di sviluppo principale da cui diramano, risolvere i conflitti, ove necessario, eliminare il ramo temporaneo.
ko: 새 임시 브랜치에서 작업하십시오. 준비가 되면 github로 이동하여 분기 한 기본 개발 라인과 분기를 병합하고 필요한 경우 충돌을 해결하고 임시 분기를 삭제하십시오.
uk: Працюйте в новій тимчасовій гілці. По готовності, перейдіть на github, з'єднайте гілку з основною лінією розвитку, з якої ви розгалужені, вирішіть конфлікти у разі потреби, видаліть тимчасову гілку.

source: When ready for publication, merge the development line into the corresponding production line.
es: Cuando esté listo para su publicación, combinar la línea de desarrollo en la línea de producción correspondiente.
it: Quando si è pronti per la pubblicazione, è possibile unire la linea di sviluppo nella linea di produzione corrispondente.
ko: 게시 할 준비가 되면 개발 라인을 해당 생산 라인에 병합합니다.
uk: Коли ви готові до публікації, об'єднайте лінію розвитку в відповідну виробничу лінію.

source: Updating the set of translatable strings
es: Actualizar el conjunto de cadenas traducibles
it: Aggiornando l'insieme di stringhe traducibili
ko: 번역 가능한 문자열 집합 업데이트
uk: Оновлення установки перекладних рядків
