Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: When this happens, we can't be sure the plant had never been in the collection, so we act as if we were re-labeling the plant. This is discussed in the next section, but we fall back to the case of a new accession.
es: Cuando esto sucede, no podemos estar seguros de que la planta nunca haya estado en la colección. Actuaremos como si re-etiquetando la planta. Esto se describe en la siguiente sección.
ko: 이렇게 되면 우리는 발전소가 컬렉션에 있은 적이 없었다 우리가 식물 re-labeling 때문에 행동하고 확신할 수 없어요이것은 다음 부분에 있지만 우리는 다시 신규 가입의 경우에 떨어져 논의된다.
uk: Коли це станеться, ми не можемо бути впевненими, що рослина ніколи не була в колекції, тому ми діємо так, наче ми переписали рослину. Це обговорюється в наступному розділі, але ми повернемося до випадку нового приєднання.

source: When we physically associate a label to a plant, there's always the chance that something happens either to the plant (it may die) or to the label (it may become unreadable), or to the association (they may be separated). We have software-aided protocols for these events.
es: Cuando asociamos físicamente una etiqueta a una planta, siempre hay la posibilidad de que algo ocurra a la planta (puede morirse) o la etiqueta (puede llegar a ser ilegible) o a la asociación entre las dos (pueden quedar separadas). Tenemos protocolos asistidos por software para estos eventos.
ko: 우리가 물리적으로 라벨을 식물과 연관시킬 때, 항상 어떤 일이 식물이나 라벨에 일어날 가능성이 있다(읽을 수 없게 될 수도 있다). 또는 연관성에 일어날 가능성이 있다(그들은 분리될 수도 있다. 이러한 이벤트에 대한 소프트웨어 지원 프로토콜이 있습니다.
uk: Коли ми фізично пов'язуємо етикетку на рослину, завжди існує шанс, що щось трапиться або з рослиною (вона може зів'янути), або на етикетці (може стати нечитабельною) або з асоціацію (її можна розділити). У нас є програмні протоколи для цих подій.

source: We find a dead plant
es: Encontramos una planta muerta
ko: 우리는 죽은 식물을 발견한다
uk: Ми знаходимо мертву рослину

source: Whenever a plant is found dead, we collect its label and put it in a box next to the main data insertion terminal, the box is marked “dead plants”.
es: Cuando una planta es encontrada muerta, recogemos su etiqueta y la ponemos en una caja junto al terminal de inserción de datos, la caja está marcada "plantas muertas".
ko: 우리는 식물이 죽은 것으로 발견될 때마다 라벨을 수집하여 주 데이터 삽입 단자 옆의 상자에 넣으면 "죽은 식물"로 표시된다.
uk: Кожного разу, коли рослина виявлена мертвою, ми забираємо її мітку та поміщаємо її в поле поруч із основним терміналом введення даних, поле позначено як “мертві рослини”.

source: Definitely at least once a week, the box is emptied and the database is updated with this information.
es: Definitivamente por lo menos una vez por semana, la caja se vacía y se actualiza la base de datos con esta información.
ko: 확실히 일주일에 한 번 이상 상자는 비워지고 데이터베이스는 이 정보로 업데이트됩니다.
uk: Безумовно, щонайменше раз на тиждень, бокс вичерпується, а база даних оновлюється з цією інформацією.

source: Dead plants aren't *removed* from the database, they stay there but get a **quantity** zero. If the cause of death is known, this is also written in the database.
es: Las plantas muertas no son *eliminadas* de la base de datos, se quedan allí, pero consiguen una **cantidad** cero. Si se conoce la causa de la muerte, esto también se escribe en la base de datos.
ko: 죽은 식물은 데이터베이스에서 *제거*하지 않고 **수량*0을 얻습니다. 사망 원인이 알려진 경우 이 내용도 데이터베이스에 기록됩니다.
uk: Мертві рослини не *видалені* з бази даних, вони залишаються там, але отримують **кількість** нуль. Якщо відомо про причину смерті, це також написано в базі даних.

source: Please once again remember that a **Plant** is not an **Accession** and please remember we do not remove objects from the database, we just add to their history.
es: Una vez más recuerde que una **planta** no es una **accesión** y por favor, recuerde que no quitar los objetos de la base de datos, sólo tiene que añadir a su historia.
ko: **Plant**는 **Accession**이 아니며, 데이터베이스에서 개체를 제거하지 않고 개체 기록에 추가한다는 점을 다시 한 번 기억하십시오.
uk: Будь ласка, ще раз пам'ятайте, що **Рослина** не є **Приєднання**, і, будь ласка, пам'ятайте, що ми не видаляємо об'єкти з бази даних, ми просто додаємо їхню історію.

source: Insert the complete plant code (something like ``012345.1``, or ``2017.0001.3``, and you don't need leading zeros nor quotes), right click on the corresponding row, and click on **edit**. change the quantity to 0, fill in the reason and preferably also the date of change.
es: Introduzca el código de la planta completo (algo así como ``012345.1``, o ``2017.0001.3`` y no necesita ceros iniciales ni comillas), haga clic en la fila correspondiente y haga clic en **edit**. cambie la cantidad a 0, especifique la razón y de preferencia también la fecha del cambio.
ko: 전체 식물 코드(예: ''012345.1'' 또는 ''2017.0001')를 삽입한다.3자리, 선행 0이나 따옴표는 필요 없습니다.) 해당 행을 마우스 오른쪽 버튼으로 클릭하고 **edit**.를 클릭합니다. 수량을 0으로 변경하고 이유를 채우고 변경 날짜도 입력합니다.
uk: Вставте повний код рослини (щось на кшталт ``012345.1`` або ``2017.0001.3``, і вам не потрібні провідні нулі чи лапки), натисніть правою кнопкою миші на відповідному рядку та натисніть **змінити** . Змінити кількість на 0, вказати причину і, бажано, також дату зміни.

source: If you need add any details about the plant death, please use a **note**, and re-use the note category "death_cause".
es: Si necesita añadir más detalles acerca de la muerte de la planta, por favor, ponga una **nota**, y utilice la categoría "death_cause".
ko: 식물 사망에 대한 세부 정보를 추가해야 하는 경우 **note**를 사용하고 "death_cause" 노트 범주를 다시 사용하십시오.
uk: Якщо вам потрібно додати будь-яку інформацію про смерть рослини, будь-ласка, використовуйте **примітку** та повторно використовуйте категорію примітки "death_cause".

source: Plants with **quantity** zero are shown with a different colour in the results view. This helps distinguish them from live plants.
es: Plantas con **cantidad** cero se muestran con un color diferente en la vista de resultados. Esto ayuda a distinguirlos de las plantas vivas.
ko: **수량** 영(0)인 식물은 결과 보기에 다른 색으로 표시됩니다. 이것은 살아있는 식물과 그들을 구별하는데 도움을 줍니다.
uk: Рослини з **кількістю** нуль показані у різному кольорі у вікні результатів. Це допомагає відрізняти їх від живих рослин.

source: We find a plant without a label
es: Encontramos una planta sin su etiqueta
ko: 우리는 라벨이 없는 식물을 발견한다
uk: Ми знаходимо рослину без етикетки

source: We can't be sure the plant had ever been in the collection or not. We assume it had, and that its label was lost.
es: No podemos saber si la planta haya anteriormente estado en la colección o no. Asumimos que sí, y que se perdió su etiqueta.
ko: 우리는 그 식물이 수집품에 있었는지 아닌지 확신할 수 없다. 우리는 그것이 그랬다고 추정합니다. 그리고 그것의 라벨은 사라졌다고 생각합니다.
uk: Ми не можемо бути впевнені, що рослина коли-набудь була в колекції чи ні. Ми припускаємо, що це було, і що її етикетка була втрачена.

source: Losing a plant label is unfortunate, but it just sometimes happens. What we do is to put a new label to the plant, and to clearly state that the label is a replacement of an original one.
es: Perder una etiqueta de planta es lamentable, pero es algo que sucede. Lo que hacemos es poner una nueva etiqueta a la planta e indicamos claramente que la etiqueta es un reemplazo de un original.
ko: 식물 라벨을 잃는 것은 불행한 일이지만, 가끔 그런 일이 일어납니다. 우리가 하는 일은 공장에 새로운 라벨을 붙이고, 라벨이 원래의 라벨의 대체품이라는 것을 분명하게 밝히는 것입니다.
uk: Невдала втрата етикетки рослин, але це буває лише іноді. Що ми робимо, це ставимо на рослину нову етикетку і чітко говоримо, що етикетка є заміною оригіналу.

source: We then handle the case as if it was a new accession, plus we add a note to the accession, category “label”, text “relabeled”.
es: Luego manejamos el caso como por una nueva accesión, además ponemos en la accesión una nota con categoría "etiqueta", texto "etiquetar".
ko: 그런 다음 사례를 새 등록인 것처럼 처리하고 등록에 메모를 추가합니다. 카테고리 "label", 텍스트 "relabeled".
uk: Потім ми розглядаємо справу так, наче це було нове приєднання, а також ми додали примітку до приєднання, категорію “етикетка”, текст “перемарковані”.

source: Keeping track of different sources of plant material
es: Hacer el seguimiento de diferentes fuentes de material vegetal
ko: 다양한 식물 자재 공급원 추적
uk: Слідкуйте за різними джерелами рослинного матеріалу

source: What different sources we can have
es: Qué diferentes fuentes podemos tener
ko: 우리가 가질 수 있는 다른 소스
uk: Які різні джерела ми можемо мати

source: In this botanical garden, we receive plants from different types of origin. It could be from expeditions (plants coming from nature, collected with legal permission from MAE - Ecuadorian Environment Ministry), donated plants mostly coming as gifts from collectors or orchid commercialization enterprises, purchased, or confiscated plants (usually coming from MAE raids around the country).
es: En este jardín botánico, recibimos plantas de diferentes tipos de origen. Pueden ser de expediciones (plantas provenientes de la naturaleza, recogidas con permiso legal de MAE - Ministerio de Ambiente Ecuatoriano), plantas donadas sobre todo como regalos de coleccionistas o de empresas de comercialización de orquídeas, compradas, o plantas confiscadas (generalmente proveniente de incursiones del MAE a lo largo del país).
ko: 이 식물원에서는 다양한 종류의 식물들을 공급받는다. 그것은 자연에서 온 식물들(MAE - 에콰도르 환경부의 법적 허가를 받아 수집한 식물들), 주로 수집가나 난초 상업화 기업들로부터 선물 받은 기부 식물들, 구입 또는 몰수된 식물들(일반적으로 전국의 MAE 급습에서 나온 것)에서 비롯될 수 있다.
uk: У цьому ботанічному саду ми одержуємо рослини з різних видів походження. Це може бути з експедицій (рослини виходячи з природи, зібрані з правовим дозволом МАЕ - Еквадорського Міністерства навколишнього середовища), подаровані рослини в основному приходять в якості подарунків від колекціонерів або орхідеї комерціалізації підприємств, придбаних або конфіскованих рослин (зазвичай відбуваються з МАЕ рейди по всій країні).

source: If the plant comes from a wild source
es: Si la planta proviene una fuente salvaje
ko: 만약 식물이 야생에서 온다면
uk: Якщо рослина походить з дикоростучого джерела

source: The accession editor offers the option "origin" option. When a plant is traceable to a wild source, we can specified its specific origin. We want to comply with ITF2, and ghini-1.0 only partly respects that standard. The ITF2 complying options are:
es: En la pantalla de accesión contamos con la opción "origen". Cuando una planta viene de una fuente salvaje, podemos especificar su origen. Dado que queremos cumplir con ITF2 y que ghini 1.0 respeta sólo en parte esa norma, hay que tener un poco de cuidado. Las opciones que cumplen con el ITF2 son:
ko: 등록 편집기는 "원본" 선택사항을 제공합니다. 식물이 야생의 근원으로 추적가능할 때, 우리는 그 특정한 기원을 지정할 수 있다. 우리는 ITF2를 준수하기를 원하며, ghini-1.0은 그 표준을 부분적으로만 존중한다. ITF2 준수 옵션은 다음과 같습니다:

source: Wild: Accession of wild source.
es: Salvaje: Accesión de fuente salvaje.
ko: 와일드: 와일드 소스 등록.
uk: Дикоростучі: приєднання дикоростучого джерела.

source: Cultivated: Propagule(s) from a wild source plant.
es: Cultivado: Propagación de una planta de fuente salvaje.
ko: 재배: 야생 소스 식물의 전파입니다.
uk: Культивовані: Росток (-и) з рослини дикоростучого джерела.

source: Not Wild: Accession not traceable to a wild source.
es: No salvaje: Accesión no rastreable a una fuente salvaje.
ko: 와일드 아님: 등록은 와일드 소스로 추적할 수 없습니다.
uk: Не дикоростучі: приєднання неможливо відстежити до дикоростучого джерела.

source: Insufficient data
es: Datos insuficientes
ko: 데이터 부족
uk: Недостатньо даних

source: In the case of a donated plant, it is better to put detail information just as a note in the plant accession; in the case of a plant with an unknown origin, we select the Insufficient data option.
es: En el caso de una planta donada, es mejor poner información detallada así como una nota en la accesión de la planta; en el caso de una planta con un origen desconocido, seleccionamos la opción datos suficientes.
ko: 기부된 발전소의 경우, 상세 정보를 발전소 등록에 메모로 넣는 것이 더 낫고, 출처를 알 수 없는 발전소의 경우 데이터 부족 옵션을 선택한다.
uk: У випадку донорської рослини краще поставити детальну інформацію як записку на приєднання рослини; У випадку з рослиною з невідомим джерелом, ми обираємо параметр недостатньо даних.

source: Using the source tab in the accession editor
es: Como usar la ficha de la fuente en el editor de accesión
ko: 등록 편집기의 원본 탭 사용
uk: Використання вкладки вихідного коду в редакторі приєднання

source: In this section we can create or use a contact, our source of plant material. It could be from an expedition to a collecting place, and in this case we would specify the region and the expedition name, or could be the name of the person or enterprise donating a specific batch of plants.
es: En esta sección podemos crear o utilizar un contacto, nuestra fuente de material vegetal. Podría ser de una expedición a un sitio de colecta, y en este caso especificar la región y el nombre de la expedición, o podría ser el nombre de la persona o empresa, que donó un lote específico de plantas.
ko: 이 섹션에서는 공장 재료의 공급원인 연락처를 만들거나 사용할 수 있습니다. 그것은 탐험에서 수집 장소로 가는 것일 수도 있고, 이 경우 우리는 지역과 탐험 이름을 명시할 수도 있고, 특정한 한 묶음의 식물을 기증하는 사람이나 기업의 이름이 될 수도 있습니다.
uk: У цьому розділі ми можемо створити або використати контакт, наше джерело рослинного матеріалу. Це може бути від експедиції до місця збирання, і в цьому випадку ми будемо вказувати назву регіону та назви експедиції або можемо назвати особу чи підприємство, що пожертвувало певну партію рослин.

source: Once you choose or create the contact information, this section deploys more options, here you can specify the region, where you can choose the country of origin, and a specific location within the region, georeferencing information (including the GPS data), habitat description collector name. For the last one, I recommend also to write the specific date next to the collector name (eg. Luis Baquero 11/10/2016).
es: Una vez que usted seleccione o cree la información de contacto, en esta sección se despliegan más opciones, aquí puede especificar la región, en que se puede elegir el país de origen, y una ubicación específica dentro de la región, la georreferenciación de la información (incluidos los datos de GPS), la descripción del hábitat, el nombre del colector. Por último, recomiendo también escribir al lado del nombre del colector, la fecha de colecta (ej. Luis Baquero 11/10/2016).
ko: 연락처 정보를 선택하거나 만들면 이 섹션에서는 더 많은 옵션을 배포합니다. 여기서 출신 국가를 선택할 수 있는 지역, 지역 내 특정 위치, 지역 참조 정보(GPS 데이터 포함), 서식지 설명 수집기 이름을 지정할 수 있습니다. 마지막 날짜의 경우 수집기 이름 옆에 특정 날짜(예:)를 쓰는 것이 좋습니다. 루이스 바케로 11/10/2016).
uk: Вибравши або створивши контактну інформацію, в цьому розділі використовуються інші параметри, тут ви можете вказати регіон, де ви можете вибрати країну походження та конкретне місцезнаходження в регіоні, інформацію про географічну привабливість (включаючи дані GPS), опис місця проживання, назва колекціонера. Для останнього я рекомендую також написати конкретну дату поруч із назвою колекціонера (наприклад, Луїсом Бакеро, 10.11.2016 р.).

source: Donated, bought or confiscated plants
es: Plantas donadas, compradas o confiscadas
ko: 식물 기증, 구입 또는 압수
uk: Пожертвувані, куплені чи конфісковані рослини

source: However useful for expeditions or for donors where the main information is geographic, this source tab is not very practical in our remaining cases: we handle three more categories: confiscated, purchased and donated, for these categories the options available in the source tab do not apply: too much information and not to the point.
es: Aun así útil para expediciones o para donantes donde la información principal es geográfica, este tabulador de fuente no es muy práctico en nuestros casos restantes: manejamos tres más categorías: confiscado, adquirido y dado, para estas categorías las opciones disponibles en el tabulador de fuente no aplica: demasiada información y no al punto.
ko: 그러나 주요 정보가 지리적 위치인 원정대나 기부자들에게는 유용하지만, 이 소스 탭은 나머지 세 가지 범주 즉, 압수, 구매 및 기부된 범주에서 다루지 않습니다. 소스 탭에서 사용할 수 있는 옵션은 적용되지 않습니다. 너무 많은 정보이며 요점은 아닙니다.
uk: Однак це корисно для експедицій або для донорів, де основна інформація є географічною, така вкладка джерела не дуже практична у наших інших випадках: ми керуємося ще трьома категоріями: конфіскувати, придбати та пожертвувати, для цих категорій параметри, доступні на вкладці вихідного коду, не застосовуються: занадто багато інформації і не до речі.

source: In these cases, we add a set of notes, according to the case.
es: En estos casos, se añade un conjunto de notas, según el caso.
ko: 이러한 경우, 우리는 사례에 따라 노트 세트를 추가합니다.
uk: У цих випадках ми додаємо набір нотаток, відповідно до справи.

source: — Donated plants
es: — Plantas donadas
ko: — 기부 식물
uk: — Пожертвувані рослини

source: If the plant was donated by individual, we add the individual among our contacts and specify it as source, then we add the notes:
es: Si la planta fue donada por un individuo, agregamos al individuo entre nuestros contactos y lo indicamos como fuente, a continuación añadimos las notas:
ko: 식물이 개인에 의해 기증된 경우, 우리는 연락처에 개인을 추가하고 출처로 지정한 다음, 메모를 추가합니다.
uk: Якщо рослина була подарована індивідуумом, ми додаємо індивідуум серед наших контактів і вказуємо його як джерело, потім додаємо примітки:

source: category
es: categoría
ko: :범주로 분류하다
uk: категорія

source: text
es: texto
ko: 문자를 보내다
uk: текст

source: gift
es: donación
ko: 선물
uk: подарунок

source: Contribución científica al JBQ
es: Razón: Contribución científica JBQ
ko: JBQ에 대한 과학 공헌
uk: Науковий внесок у JBQ

source: — Bought plants
es: — Plantas compradas
ko: — 구입한 식물
uk: — Купили рослини

source: If the plant was bought, we add the previous owner among our contacts and specify it as source, then we add the notes:
es: Si la planta fue comprada, añadimos el dueño anterior entre nuestros contactos y lo indicamos como fuente, luego añadimos las notas:
ko: 식물을 구입한 경우 연락처에 이전 소유자를 추가하고 출처로 지정한 다음 메모를 추가합니다:
uk: Якщо рослина була куплена, ми додаємо попереднього власника серед наших контактів і вказуємо його як джерело, потім додаємо примітки:

source: purchase
es: compra
it: acquisto
ko: 구입하다
uk: придбання

source: optional, free text
es: opcional, texto libre
ko: 옵션, 자유 텍스트
uk: необов'язковий, вільний текст

source: the invoice number
es: el número de la factura
ko: 송장 번호
uk: номер рахунку-фактури

source: — Confiscated plants
es: — Plantas decomisadas
ko: — 몰수된 식물
uk: — Конфісковані рослини

source: If the plant was confiscated, we add the previous owner among our contacts and specify it as source, then we add the notes:
es: Si la planta fue confiscada, agregamos el dueño anterior entre nuestros contactos y lo indicamos como fuente, a continuación añadimos las notas:
ko: 식물이 압수된 경우 연락처에 이전 소유자를 추가하고 출처로 지정한 다음 메모를 추가합니다:
uk: Якщо рослина була конфіскована, ми додаємо попереднього власника серед наших контактів і вказуємо його як джерело, потім додаємо примітки:

source: confiscated
es: decomisada
ko: 몰수의
uk: конфіскований

source: possibly, legal details, law number ...
es: Posiblemente, detalles legales, número de ley ...
ko: 법적인 세부 사항, 법적인 번호...
uk: можливо, юридичні деталі, номер закону ...

source: Producing or reproducing labels
es: Producción o reproducción de etiquetas
it: Produzione o riproduzione di etichette
ko: 레이블 생성 또는 복제
uk: Виробництво або відтворення етикеток

source: Refreshing plant labels
es: Renovar etiquetas de plantas
it: Rinnovare le etichette
ko: 플랜트 라벨 새로 고침
uk: Оновлення етикеток рослин

source: Sometimes we refresh the labels, for example all that is in a greenhouse, or maybe just a set of plants because their labels risk becoming unreadable.
es: A veces hay que renovar las etiquetas, por ejemplo todo lo que está en un invernadero, o tal vez sólo un conjunto de plantas debido al riesgo que sus etiquetas se vuelvan ilegibles.
ko: 때때로 우리는 라벨을 새로 고칩니다. 예를 들어 온실에 있는 모든 것, 또는 단지 식물들의 집합일 수도 있습니다. 왜냐하면 그들의 라벨은 읽을 수 없게 될 위험이 있기 때문입니다.
uk: Іноді ми оновлюємо етикетки, наприклад, все, що є в теплиці, або, можливо, просто набір рослин, тому що їх етикетки ризикують стати нечитабельними.

source: In the first case it's easy selecting all plants in the Location, we just type the location name, or give the search ``location like <location name>``.
es: En el primer caso es fácil seleccionar todas las plantas en el lugar, simplemente escriba el nombre de ubicación, o utilice la búsqueda ``location like <location name>``.
ko: 첫 번째 경우 위치 내의 모든 식물을 쉽게 선택할 수 있으며, 위치 이름만 입력하거나 검색을 "위치 이름"과 같은 "위치 이름"으로 지정합니다.
uk: У першому випадку легко вибрати всі рослини в місцезнаходженні, ми просто введемо назву місцезнаходження або надамо пошук ``location like <location name>``.

source: The second case it's a bit trickier. What we do is to create a temporary **Tag**, and use it to tag all plants that were found in need for a new label.
es: El segundo caso es un poco más delicado. Lo que hacemos es crear un **Tag** temporal que usamos para juntar todas las plantas que se encuentren en necesidad de una nueva etiqueta.
ko: 두 번째 경우는 좀 더 까다롭습니다. 임시 **태그**를 만들어 새 라벨이 필요한 모든 식물에 태그를 지정하는 데 사용합니다.
uk: Другий випадок - трохи складніше. Що ми робимо, це створюємо тимчасовий **Тег** і використовуємо його для позначення всіх рослин, які були знайдені в необхідності для нової мітки.

source: Given the selection, we start the report tool, using the mako ``accession-label.svg`` template. We reset its options to default values, and since we're using a simple printer, we set the colour to ``black`` instead of ``blue``, which is meant for engraving.
es: Dada la selección, inicie la herramienta de informe, utilizando la plantilla mako 'accession-label.svg''. Restaure los valores por defecto, y ya que las etiquetas son para imprimir y no grabar, utilizamos el color ``black`` en lugar que ``blue``.
ko: 선택을 고려할 때, 우리는 mako ``accession-label"을 사용하여 보고서 도구를 시작한다.svg² 템플릿 우리는 그것의 옵션을 기본값으로 재설정했고, 우리는 단순한 프린터를 사용하기 때문에 새기기 위한 "파란색"이 아닌 "검은색"으로 색을 설정했다.
uk: З огляду на вибір, ми запускаємо інструмент звітування, використовуючи шаблон mako ``accession-label.svg``. Ми скидаємо свої параметри до значень за замовчуванням, і оскільки ми використовуємо простий принтер, ми встановлюємо колір на ``чорний`` замість ``синій``, який призначений для гравюри.

source: Preparing labels for non-database plants
es: Preparar las etiquetas de plantas que no están en la base de datos
ko: 데이터베이스가 아닌 공장의 레이블 준비
uk: Підготовка етикеток для не базових рослин

source: To prepare the batch of 72 labels, we use a mako report template, named ``accession-label.svg``. This template accepts parameters, this is an example that would produce labels from 025801 all the way to 025872.
es: Para preparar un lote de 72 etiquetas, utilizamos una plantilla de mako, denominada ``accession-label.svg``. Esta plantilla acepta parámetros, este es un ejemplo que produce las etiquetas de 025801 hasta 025872.
ko: 72개의 레이블 배치를 준비하기 위해 "액세스-라벨"이라는 이름의 mako 보고서 템플릿을 사용한다.svg'. 이 템플릿은 매개 변수를 받아들이며 025801부터 025872까지 레이블을 생성합니다.
uk: Для підготовки партії з 72 міток ми використовуємо шаблон звіту mako з ім'ям ``accession-label.svg``. Цей шаблон приймає параметри, це приклад, який буде містити мітки від 025801 до 025872.

source: Labels come for us in two flavours: (1) either new plants just being acquired by the garden; (2) or plants in the garden, found without a label. We distinguish the two cases by adding a 'ret' extra text for relabeled plants.
es: Consideramos las etiquetas de dos tipos: (1) plantas que el jardín acaba de adquirir; (2) o plantas en el jardín, sin una etiqueta. Distinguimos los dos casos añadiendo el texto extra 'ret' para las plantas re-etiquetadas.
ko: 라벨은 두 가지 맛으로 제공됩니다. (1) 정원에 의해 막 획득된 새로운 식물, (2) 또는 라벨 없이 발견되는 정원의 식물. 우리는 다시 레이블링된 식물에 대한 '레트' 추가 텍스트를 추가하여 두 경우를 구별한다.
uk: Етикетки приходять до нас у двох випадках: (1) або нові рослини, які просто прибувають у сад; (2) або рослини в саду, знайдені без етикетки. Ми розрізняємо два випадки, додавши 'ret' додатковий текст для перемаркованих рослин.

source: We keep two boxes with labels of the two types, ready to be used.
es: Tenemos dos cajas con etiquetas de los dos tipos, listas para ser utilizadas.
ko: 우리는 두 종류의 라벨이 붙어 있는 상자 두 개를 사용할 준비가 되어 있습니다.
uk: Ми зберігаємо два бокси з мітками двох типів, готових до використання.
