Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Only recently has Mario Frasca produced a new bauble debian package, for the latest bauble.classic version 1.0.56, and proposed for inclusion in Debian. View it on `mentors <https://mentors.debian.net/package/bauble>`_. This version depends on ``fibra``, a package that was never added to Debian and which Mario also has packaged and `proposed for inclusion in Debian <https://mentors.debian.net/package/fibra>`_. Mario has been trying to activate some Debian Developer, to take action. There's not much more we can do, other than wait for a sponsor, and hoping the package will eventually get all the way to Ubuntu.
ko: 최근에야 마리오 프라스카는 최신 버전인 바우블.클래식 버전 1.0.56을 위한 새로운 바우블 데비안 패키지를 제작하고 데비안에 포함시키자고 제안했다. https://mentors.debian.net/package/bauble'에서 확인하십시오. 이 버전은 ''데비안에 추가되지 않은 패키지이며 마리오도 패키지화한 패키지이며 데비안 https://mentors.debian.net/package/fibra에 포함시킬 수 있는 패키지''에 달려 있다. 마리오가 행동을 취하기 위해 데비안 개발자(Debian Developer)를 활성화시키려고 노력해왔습니다. 후원자를 기다리는 것 말고는 할 수 있는 게 없어요 결국 우분투까지 소포가 도착하길 바라죠.

source: Once we get in contact with a `Debian Sponsor <https://mentors.debian.net/sponsors>`_ who will review what we publish on `mentors <https://mentors.debian.net/intro-maintainers>`_, then we will be definitely expected to keep updating the debian package for ``ghini.desktop`` and ``fibra``.
ko: 일단 우리가 'https://mentors.debian.net/intro-maintainers'에 게재하는 내용을 검토할 데비안 스폰서 https://mentors.debian.net/sponsors'과 접촉하게 되면 우리는 데비안 패키지의 ``ghini.devious"와 "ghbrazy"를 계속 업데이트할 것이 확실하다.

source: I am not going to explain in a few words the content of several books on Debian packaging. Please choose your sources. For a very compact idea of what you're expected to do, have a look at ``scripts/pubish.sh``.
ko: 나는 데비안 포장지에 관한 몇 권의 책의 내용을 몇 마디로 설명하지 않을 것이다. 소스를 선택하십시오. 여러분이 무엇을 할 것으로 예상되는지에 대한 아주 간단한 아이디어를 위해, "https/pubish.sh"을 보세요.

source: Editing and Inserting Data
es: Editar e insertar información
it: Inserire e modificare dati
ko: 데이터 편집 및 삽입
uk: Редагування і вставка даних

source: The main way that we add or change information in Ghini is by using the editors. Each basic type of data has its own editor. For example there is a Family editor, a Genus editor, an Accession editor, etc.
es: La principal forma que añadir o cambiar información en Ghini es mediante el uso de los editores. Cada tipo de base de datos tiene su propio editor. Por ejemplo hay un editor de familia, un editor de género, un editor de accesión, etcetera.
it: Fondamentalmente, la maniera per aggiungere o modificare informazione con Ghini, è utilizzando gli editori. Per ciascun tipo di informazione, Ghini ha un editore, così per esempio c'è un editore per le famiglie, per i generi, per le accessioni, eccetera.
ko: Ghini에서 정보를 추가하거나 변경하는 주요 방법은 편집기를 사용하는 것입니다. 각 기본 데이터 유형에는 고유한 편집기가 있습니다. 예를 들어 패밀리 편집기, 인세이션 편집기, 등록 편집기 등이 있습니다.
uk: Основний спосіб, яким ми додамо або змінюємо інформацію в Ghini, - це використання редакторів. Кожен основний тип даних має свій власний редактор. Наприклад, є редактор сімейства, редактор роду, редактор приєднання тощо.

source: To create a new record click on the :menuselection:`Insert` menu on the menubar and then select the type of record your would like to create. This opens a new blank editor for the type.
es: Para crear un nuevo registro clic en la: menuselection: 'Insertar' en la barra de menu menú y seleccione el tipo de registro su desea crear. Esto abre un nuevo editor en blanco para el tipo.
it: Per creare un nuovo elemento nella base dati, attivare il menu :menuselection:`Insert`, e scegliere il tipo di oggetto da inserire. Questo apre un nuovo editore, vuoto, per il tipo scelto.
ko: 새 레코드를 생성하려면 :menu selection(메뉴 선택)을 클릭하십시오.메뉴 모음에서 '삽입' 메뉴를 선택한 다음 만들려는 레코드 유형을 선택합니다. 유형에 대한 새 빈 편집기가 열립니다.
uk: Для того, щоб створити новий запис натисніть на :menuselection:`Insert`в меню, і виберіть тип запису який ви хотіли б створити. Це відкриє новий порожній редактор типу.

source: To edit an existing record in the database right click on an item in the search results and select :menuselection:`Edit` from the popup menu. This opens an editor that allows you to change the values on the record that you selected.
es: Para editar un registro existente en la base de datos haga clic derecho sobre un elemento en los resultados de la búsqueda y selección: menuselection: 'Editar' en el menú emergente. Se abrirá un editor que le permite cambiar los valores en el registro seleccionado.
it: Per modificare un registro già presente nella base dati e visualizzato nella finestra principale di Ghini, fare click destro sulla sua riga e scegliere :menuselection:`Edit` dal menu che emerge. Questo apre un editore relativo al registro selezionato, modificando i dati nell'editore è possibile aggiornare la base dati.
ko: 데이터베이스에서 기존 레코드를 편집하려면 검색 결과의 항목을 마우스 오른쪽 버튼으로 클릭하고 다음을 선택합니다. 메뉴 선택:팝업 메뉴에서 '편집'을 선택합니다. 이렇게 하면 선택한 레코드의 값을 변경할 수 있는 편집기가 열립니다.
uk: Щоб змінити існуючий запис в базі даних натисніть правою кнопкою миші на елементі в результатах пошуку і виберіть :menuselection:`Edit` в спливаючому меню. Відкриється редактор, який дозволить вам змінити значення в записі, який ви вибрали.

source: Most types also have children which you can add by right clicking on the parent and selecting "Add ???..." on the context menu. For example, a Family has Genus children: you can add a Genus to a Family by right clicking on a Family and selecting "Add genus".
es: La mayoría también tienen hijos que pueden agregar haciendo clic derecho sobre el padre y seleccionando "Add??? ... \ "en el menú contextual. Por ejemplo, una familia tiene niños de género: puede Agregar un género a una familia haciendo clic derecho sobre una familia y selección de "Add genus".
it: La maggior parte dei tipi di dati hanno registri che ne dipendono.
ko: 또한 대부분의 유형에는 상위 항목을 마우스 오른쪽 버튼으로 클릭하고 상황에 맞는 메뉴에서 "추가 ????..."를 선택하여 추가할 수 있는 하위 항목이 있습니다. 예를 들어 패밀리에 속자식이 있습니다. 패밀리를 마우스 오른쪽 단추로 클릭하고 "속자 추가"를 선택하여 패밀리에 속자를 추가할 수 있습니다.
uk: Більшість видів є дочірніми, які можна додати, натиснувши правою кнопкою миші на батьківському виді і виберіть пункт «Додати ??? ...» в контекстному меню. Наприклад, сім'я Genus дочірня: ви можете додати Genus до Сім'ї натиснувши правою кнопкою миші на сім'ї і вибравши пункт «Додати genus».

source: Notes
es: Notas
it: Note
ko: 주기
uk: Нотатки

source: Almost all of the editors in Ghini have a *Notes* tab which should work the same regardless of which editor you are using.
es: Casi todos los editores en Ghini tienen una pestaña *Notas*, que funciona del mismo modo, independientemente del editor.
it: Quasi tutti gli editori in Ghini hanno una vista *Note*, che dovrebbe funzionare ugualmente per qualsivoglia editore attivato.
ko: Ghini의 거의 모든 편집기에는 *Notes* 탭이 있습니다. 이 탭은 사용 중인 편집기에 관계없이 동일하게 작동합니다.
uk: Майже у всіх редакторів Ghini є вкладка *Примітки* яка працюють однаково, незалежно від того, який редактор ви використовуєте.

source: If you enter a web address in a note then the link shows up in the Links box when the item your are editing is selected in the search results.
es: Si introduce una dirección web en una nota y el enlace aparece en el enlaces de la caja cuando el elemento está edición se selecciona en resultados de la búsqueda.
it: Un indirizzo web inserito a sé stante in una nota, viene trattato in modo speciale da Ghini: quando l'oggetto è selezionato nel pannello risultati, l'indirizzo web verrà mostrato nel contenitore *Links".
ko: 노트에 웹 주소를 입력하면 편집 중인 항목이 검색 결과에서 선택되면 링크 상자에 링크가 표시됩니다.
uk: Якщо ввести веб-адресу в примітці, то посилання буде відображатися у вікні Посилання, коли елемент вашого редагування обраний в результатах пошуку.

source: You can browse the notes for an item in the database using the Notes box at the bottom of the screen. The Notes box is desensitized if the selected item does not have any notes.
es: Puedes buscar las notas para un artículo en la base de datos mediante el cuadro de notas en la parte inferior de la pantalla. Si el elemento seleccionado no tiene notas desensibilizar el cuadro notas.
it: È possibile sfogliare le note per un elemento nel database utilizzando la casella note nella parte inferiore dello schermo. La casella note è desensibilizzata se l'elemento selezionato non dispone di eventuali note.
ko: 화면 아래쪽에 있는 Notes 상자를 사용하여 데이터베이스에서 항목의 노트를 찾아볼 수 있습니다. 선택한 항목에 노트가 없으면 Notes 상자의 감도가 떨어집니다.
uk: Ви можете переглянути нотатки для елемента в базі даних за допомогою вікна Нотатки в нижній частині екрана. Вікно Нотатки буде нечутливим, якщо обраний елемент не має записів.

source: Family
es: Familia
it: Famiglia
ko: 과명
uk: Сім'я

source: The Family editor allows you to add or change a botanical family.
es: El familia editor le permite agregar o cambiar una familia botánica.
it: L'editore per le famiglie permette aggiungere o cambiare una famiglia botanica.
ko: 패밀리 편집기를 사용하면 식물군을 추가하거나 변경할 수 있습니다.
uk: Редактор сім'ї дозволяє додавати або змінювати ботанічну сім'ю.

source: The *Family* field on the editor lets you change the epithet of the family. The Family field is required.
es: La * familia * campo en el editor le permite cambiar el epíteto de la familia. El campo de la familia es necesario.
it: Il campo *famiglia* consente di modificare l'epiteto della famiglia. Il campo *famiglia* è obbligatorio.
ko: 편집기의 *가족* 필드를 사용하여 패밀리의 별칭을 변경할 수 있습니다. 패밀리 필드는 필수입니다.
uk: Поле *Сім'я* у редакторі дозволяє змінити епітет сім'ї. Поле Сім'я обов'язкове.

source: The *Qualifier* field lets you change the family qualifier. The value can either be *sensu lato*, *sensu stricto*, or nothing.
es: La * calificador * campo le permite cambiar la clasificación de la familia. El valor puede ser * sensu lato *, * sensu stricto *, o nada.
it: Il * campo di qualificatore consente di modificare il qualificatore di famiglia. Il valore può essere * sensu lato *, * sensu stricto *, o niente.
ko: *Qualifier* 필드를 사용하여 패밀리 한정자를 변경할 수 있습니다. 값은 *sensulato*, *sensurto* 또는 nothing일 수 있습니다.
uk: Поле *Класифікатор* дозволяє вам змінити класифікатор сім'ї. Значення може мати *широке тлумачення*, *вузьке тлумачення* або ніякого.

source: *Synonyms* allow you to add other families that are synonyms with the family you are currently editing. To add a new synonyms type in a family name in the entry. You must select a family name from the list of completions. Once you have selected a family name that you want to add as a synonym click on the Add button next to the synonym list and the software adds the selected synonym to the list. To remove a synonym, select the synonym from the list and click on the Remove button.
ko: *동기화*를 사용하면 현재 편집 중인 가족과 동의어인 다른 패밀리를 추가할 수 있습니다. 항목의 패밀리 이름에 새 동의어를 추가하려면 다음과 같이 하십시오. 완료 목록에서 패밀리 이름을 선택해야 합니다. 동의어로 추가할 패밀리 이름을 선택한 후 동의어 목록 옆에 있는 추가 단추를 클릭하면 소프트웨어가 선택한 동의어를 목록에 추가합니다. 동의어를 제거하려면 목록에서 동의어를 선택하고 [제거] 단추를 클릭하십시오.

source: To cancel your changes without saving then click on the *Cancel* button.
es: Para cancelar los cambios sin guardar y haga clic en la * cancelar * botón.
it: Per annullare le modifiche, fare click sul pulsante *Cancel*/*Annulla*.
ko: 저장하지 않고 변경 내용을 취소하려면 *취소* 버튼을 클릭하십시오.
uk: Щоб відмітити зміни без збереження натисніть на кнопку *Скасувати*.

source: To save the family you are working on then click *OK*.
es: Para salvar a la familia que está trabajando en y haga clic en * Aceptar *.
it: Per memorizzare le modifiche effettuate, fare click su *OK*.
ko: 작업 중인 가족을 저장하려면 *확인*을 클릭하십시오.
uk: Для того, щоб зберегти сім'ю з якою ви працюєте, натисніть *OK*.

source: To save the family you are working on and add a genus to it then click on the *Add Genera* button.
es: Para salvar a la familia que está trabajando en y agregue un género y haga clic en la * géneros * añadir botón.
it: Per memorizzare le modifiche e per aggiungere un genere alla famiglia aggiunta o modificata, fare click su *Add Genera*.
ko: 작업 중인 패밀리를 저장하고 해당 패밀리에 속 하나를 추가하려면 *Add Gener* 버튼을 클릭합니다.
uk: Для того, щоб зберегти сім'ю з якою ви працюєте і додати рід натисніть на кнопку *Додати рід*.

source: To add another family when you are finished editing the current one click on the *Next* button on the bottom. This saves the current family and opens a new blank family editor.
es: Para agregar otro familiar cuando termine de editar actual haga clic en la * siguiente * botón en la parte inferior. Esto ahorra la familia y abre un nuevo editor de familia en blanco.
it: Per aggiungere un'altra famiglia dopo aver memorizzato le modifiche, fare click su *Next*. Questo salva la famiglia correntemente aperta ed inizia la modifica della prossima.
ko: 현재 편집이 완료되면 다른 패밀리를 추가하려면 아래쪽에 있는 *다음* 버튼을 클릭하십시오. 이렇게 하면 현재 패밀리가 저장되고 새 빈 패밀리 편집기가 열립니다.
uk: Для того, щоб додати ще одну сім'ю, коли ви закінчили редагування поточної натисніть на кнопку *Далі* внизу. Це дозволить зберегти поточну сім'ю і відкрити новий порожній редактор сім'ї.

source: Genus
es: Género
it: Genere
ko: 속명
uk: Рід

source: The Genus editor allows you to add or change a botanical genus.
es: El género editor le permite añadir o cambiar un género botánico.
it: Il genere editor consente di aggiungere o modificare un genere botanico.
ko: Incular 편집기는 식물 속을 추가하거나 변경할 수 있게 해줍니다.
uk: Редактор родів дозволяє додавати або змінювати ботанічний рід.

source: The *Family* field on the genus editor allows you to choose the family for the genus. When you begin type a family name it will show a list of families to choose from. The family name must already exist in the database before you can set it as the family for the genus.
es: La * familia * campo en el editor de género le permite elegir la familia para el género. Cuando usted comience el tipo de un nombre de familia mostrará una lista de familias para elegir. El nombre de familia ya debe existir en la base de datos antes de establecer como la familia para el género.
it: Il campo *Famiglia* nell'editore di generi permette di selezionare la famiglia a cui appartiene il genere. La famiglia dev'essere già presente nella base dati per poter essere selezionata. Iniziare a scrivere il nome, Ghini mostrerà quelli che coincidono.
ko: 속 편집기의 *패밀리* 필드를 사용하여 속 편집기의 패밀리를 선택할 수 있습니다. 성을 입력하기 시작하면 선택할 수 있는 가족 목록이 표시됩니다. 패밀리를 패밀리로 설정하려면 먼저 패밀리가 데이터베이스에 이미 존재해야 합니다.
uk: Поле *Сім'я* в редакторі роду дозволяє вибрати сім'ю для роду. Коли ви починаєте вводити ім'я сім'ї він буде показувати список сімей, щоб вибрати з нього. Сім'я вже повинна існувати в базі даних, перш ніж ви можете встановити її в якості імені сім'ї для роду.

source: The *Genus* field allows you to set the genus for this entry.
es: El * género * campo le permite definir el género de esta entrada.
it: Il campo *Epiteto* permette di specificare l'epiteto di questo genere.
ko: *Genus* 필드를 사용하여 이 항목에 대한 속을 설정할 수 있습니다.
uk: Поле *Рід* поле дозволяє встановити рід для цього запису.

source: The *Author* field allows you to set the name or abbreviation of the author(s) for the genus.
es: El * autor * campo le permite definir el nombre o la abreviatura de los autores del género.
it: Il campo *Autore* permette di specificare il nome o l'abbreviazione dell'autore o gli autori della pubblicazione del genere.
ko: *Author* 필드를 사용하여 해당 속성의 작성자 이름이나 약어를 설정할 수 있습니다.
uk: Поле *Автор* дозволяє задати ім'я або абревіатуру автора (ів) для роду.

source: *Synonyms* allow you to add other genera that are synonyms with the genus you are currently editing. To add a new synonyms type in a genus name in the entry. You must select a genus name from the list of completions. Once you have selected a genus name that you want to add as a synonym click on the Add button next to the synonym list and it will add the selected synonym to the list. To remove a synonym select the synonym from the list and click on the Remove button.
ko: *Synonyms*를 사용하면 현재 편집 중인 속과 동의어인 다른 속들을 추가할 수 있습니다. 항목의 속 이름에 새로운 동의어를 추가합니다. 완료 목록에서 속 이름을 선택해야 합니다. 동의어로 추가할 속 이름을 선택한 후 동의어 목록 옆에 있는 추가 단추를 클릭하면 선택한 동의어가 목록에 추가됩니다. 동의어를 제거하려면 목록에서 동의어를 선택하고 [제거] 단추를 클릭하십시오.

source: To save the genus you are working on then click *OK*.
es: Para salvar el género que está trabajando en y haga clic en * Aceptar *.
it: Per salvare il genere sta lavorando, quindi fare clic su * OK *.
ko: 작업 중인 속을 저장하려면 *OK*를 클릭하십시오.
uk: Для того, щоб зберегти рід з яким ви працюєте, натисніть *OK*.

source: To save the genus you are working on and add a species to it then click on the *Add Species* button.
es: Para salvar el género que está trabajando en y añade una especie que haga clic en la * especie * añadir botón.
it: Per salvare il genere sta lavorando e aggiungere una specie ad esso, quindi fare clic sul * specie * Aggiungi pulsante.
ko: 작업 중인 속을 저장하고 여기에 종을 추가하려면 *종 추가* 버튼을 클릭하십시오.
uk: Для того, щоб зберегти рід з яким ви працюєте і додати до нього вид натисніть на кнопку *Додати Вид*.

source: To add another genus when you are finished editing the current one click on the *Next* button on the bottom. This will save the current genus and open a new blank genus editor.
es: Para añadir otro género cuando haya terminado de editar el actual clic en la * siguiente * botón en la parte inferior. Esto ahorrará el género actual y abrir un nuevo editor de género blanco.
it: Per aggiungere un altro genere, quando si è finito di modificare la corrente di uno scatto sulla * avanti * pulsante sul fondo. Questo salverà il genere corrente e aprire un nuovo editor di genere vuoto.
ko: 현재 편집을 마쳤을 때 다른 속을 추가하려면 하단의 *다음* 버튼을 클릭하십시오. 이로써 현재의 속은 보존되고 새로운 빈 속 편집기가 열린다.
uk: Для того, щоб додати ще один рід, коли ви закінчили редагування поточного натисніть на кнопку *Далі* в низу. Це дозволить зберегти поточний рід і відкрити новий порожній редактор роду.

source: Species/Taxon
es: Especie O Taxón
it: Specie / Tassone
ko: 종/속
uk: Види/Таксон

source: For historical reasons called a `species`, but by this we mean a `taxon` at rank `species` or lower. It represents a unique name in the database. The species editor allows you to construct the name as well as associate metadata with the taxon such as its distribution, synonyms and other information.
es: Por razones históricas llamados una 'especie', pero por esto nos referimos a una 'taxonomía' fila 'especies' o inferior. Representa un nombre único en la base de datos. El editor de especies le permite construir el nombre, así como asociar metadatos a la taxonomía como su distribución, de sinónimos y otra información.
it: Per ragioni storiche, chiamati una ``species``, ma da questo si intende un ``taxon`` di rango specie o inferiore. Esso rappresenta un nome univoco nel database. L'editor di specie consente di costruire il nome così come associare metadati con il taxon come la sua distribuzione, sinonimi e altre informazioni.
ko: 종(種)이라 불리는 역사적 이유로 우리는 종(種) 이하에서 종(種)의 세금을 뜻한다. 데이터베이스의 고유한 이름을 나타냅니다. 종 편집기를 사용하면 이름을 구성하고 배포, 동의어 및 기타 정보와 같은 분류 제목과 메타데이터를 연결할 수 있습니다.
uk: З історичних причин називаються `види`, але ми маємо на увазі `таксон` в ранзі `видів` або нижче. Це являє собою унікальне ім'я в базі даних. Редактор видів дозволить вам створити ім'я, а також асоційовані метадані з таксоном, такі як розподіл, синоніми і інша інформація.

source: The *Infraspecific parts* in the species editor allows you to specify the `taxon` further than at `species` rank.
es: La * partes * en el editor de especies infraespecíficas permite especificar 'taxonomía' más en el rango de 'especies'.
it: La sezione *informazione infraspecifica* nell'editor di specie consente di specificare il ``taxon`` oltre al rango di specie.
ko: 종 편집기의 *Infraspecific parts*를 사용하면 종별 순위에서 '종별'보다 '택시'를 더 지정할 수 있습니다.
uk: *Внутрішньовидові частини* в редакторі видів дозволять вам вказати додатково `таксон`ніж при `види` рангу.

source: To save the species you are working on then click *OK*.
es: Para salvar a las especies que está trabajando en y haga clic en * Aceptar *.
it: Per salvare la specie stanno lavorando, quindi fare clic su * OK *.
ko: 작업 중인 종을 저장하려면 *확인*을 클릭하십시오.
uk: Для збереження виду над яким ви працюєте натисніть *OK*.

source: To save the species you are working on and add an accession to it then click on the *Add Accession* button.
es: Para salvar a las especies que está trabajando en añade una accesión a él y haga clic en la * accesión * añadir botón.
it: Per salvare la specie stanno lavorando e aggiunta un'accessione ad esso, quindi fare clic sul * accessione * Aggiungi pulsante.
ko: 작업 중인 종을 저장하고 등록 정보를 추가하려면 *등록 추가* 버튼을 클릭하십시오.
uk: Для збереження виду над яким ви працюєте і додаванням до нього приєднання натисніть на *Додати Приєднання*.

source: To add another species when you are finished editing the current one click on the *Next* button on the bottom. This will save the current species and open a new blank species editor.
es: Para agregar otra especie cuando haya terminado de editar el actual clic en la * siguiente * botón en la parte inferior. Esto salvar la especie actual y abrir un nuevo editor de especies en blanco.
it: Per aggiungere un'altra specie quando si è finito di modificare la corrente di uno scatto sulla * avanti * pulsante sul fondo. Questo salverà la specie attuale e aprire un nuovo editor di specie in bianco.
ko: 현재 편집을 마쳤을 때 다른 종을 추가하려면 하단의 *다음* 버튼을 클릭하십시오. 이렇게 하면 현재 종을 저장하고 새 빈 종 편집기가 열립니다.
uk: Для того, щоб додати ще один вид, коли ви закінчите редагування поточного натисніть на кнопку *Далі* внизу. Це дозволить зберегти поточні види і відкрити новий порожній редактор видів.

source: Accessions
es: Accesiones
it: Accessioni
ko: 액세스 권한
uk: Приєднань

source: The Accession editor allows us to add an accession to a species. In Ghini an accession represents a group of plants or clones that are of the same taxon, are of the same propagule type (or treatment), were received from the same source, were received at the same time.
es: El editor de accesión nos permite añadir accesiones a una especie, y la puesta al día de la información correspondiente. En Ghini una accesión representa un grupo de plantas o clones que son todas del mismo taxón, fueron propagadas en la misma manera y el mismo tratamiento, fueron recibidas de la misma fuente, y al mismo tiempo.
it: L'editore di accessioni ci permette di aggiungere accessioni relative ad una specie. In Ghini una accessione rappresenta una pianta, un gruppo di piante, tutte della stessa specie, tutte propagate allo stesso modo e con lo stesso trattamento, tutte ricevute allo stesso momento dalla stessa fonte.
ko: 등록 편집기를 사용하면 등록 정보를 종에 추가할 수 있습니다. 기니에서 등록은 동일한 분류군(또는 처리군)의 식물 또는 클론 그룹을 나타내며, 같은 소스로부터 같은 전파형(또는 처리군)이 동시에 수신되었다.
uk: Редактор приєднання дозволяє додавати приєднання до певного виду. У Ghini приєднання представляє собою групу рослин або клонів, що мають один і той же таксон, мають один і той же тип ростка (або обробки), отримані з одного джерела, отримані одночасно.

source: Choose the Taxon name, add one if you forgot to do that in advance.
es: Elegir el nombre taxonómico, agregar uno si usted se olvidó de hacerlo por adelantado.
it: Scegli il nome della specie, o aggiungine una se manca quella che serve.
ko: 택스온 이름을 선택하고 잊어버린 경우 택스온 이름을 추가합니다.
uk: Виберіть назву Таксона, додайте одну, якщо забули це зробити заздалегідь.
