Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: If an ``Accession`` was obtained in the garden nursery from a successful ``Propagation``, the ``Propagation`` links the ``Accession`` and all of its ``Plantings`` to a single parent ``Planting``, the seed or the vegetative parent.
es: Si una ``Accession`` fue resultado de una ``Propagation`` exitosa realizada en el jardín, la ``Propagation`` realiza la conexión entre la nueva ``Accession`` y de sus ``Plant`` a la misma planta madre, sea la que ofreció la semilla, o el padre vegetativo.
it: Se un 'accessione' è stato ottenuto nel vivaio giardino da una successo 'propagazione', i link 'propagazione' 'accessione' e tutti i suoi 'planting' ad un unico genitore 'piantatura', il seme o il genitore vegetativo.
ko: 만약 "접속"이 성공적인 ``전파"로부터 정원 보육원에서 얻어졌다면 "전파"는 "접속"과 그 모든 ``식물"을 씨앗이나 식물 부모인 한 부모인 "식물"과 연결시킨다.
uk: Якщо ``Приєднання`` отримано з садового розсадника від успішного ``Розмноження``, ``Розмноження``зв'язує ``Приєднання`` і всі його ``Насадження`` до батьківського ``Насадження``, насіння або вегетативного батька.

source: Even after the above explanation, new users generally still ask why they need pass through an ``Accession`` screen while all they want is to insert a ``Plant`` in the collection, and again: what is this "accession" thing anyway? Most discussions on the net don't make the concept any clearer. One of our users gave an example which I'm glad to include in Ghini's documentation.
es: Incluso después de la explicación anterior, los nuevos usuarios generalmente todavía preguntar ¿por qué necesitan pasar a través de una pantalla ``accesión``, mientras que todo lo que quieran es insertar una ``planta`` de la colección y otra vez: ¿Qué es este "accession" cosa de todos modos? Mayoría de las discusiones en la red no hace el concepto ningún clarificante. Uno de nuestros usuarios dio un ejemplo que estoy contento de incluir en la documentación de Ghini.
it: Anche dopo la spiegazione di cui sopra, molti nuovi utenti continuano a chiedersi perché hanno bisogno di passare attraverso questo schermo ``Accession`` mentre non vogliono altro se non inserire una ``Plant`` nella collezione, e ancora: ma da dove è uscita fuori questa ``Accession``? La maggior parte delle discussioni in rete non rende il concetto di niente più chiaro. Uno dei nostri utenti ha dato un esempio che mi fa piacere includere nella documentazione di Ghini.
ko: 위의 설명 이후에도 새로운 사용자들은 일반적으로 "액세스" 화면을 통과해야 하는 이유를 묻는 반면 그들이 원하는 것은 컬렉션에 "플랜트"를 삽입하는 것뿐이고, 다시 말해서 어쨌든 "액세스"란 무엇인가? 대부분의 인터넷 상의 논의는 개념을 더 명확하게 하지 못한다. 저희 사용자 중 한 명이 제가 기니의 설명서에 기꺼이 포함시킨 예를 들었습니다.
uk: Навіть після викладеного вище пояснення, нові користувачі, як правило, як і раніше запитують, чому їм потрібно пройти через екран ``Приєднання``, тоді як все, що вони хочуть - це вставити ``Рослина`` у колекцію, і знову: що це річ "приєднання" в будь-якому випадку? Більшість дискусій у мережі не роблять поняття чіткішим. Один з наших користувачів дав приклад, який я радий включити в документацію Ghini.

source: use case
es: Caso de uso
it: caso d'uso
ko: 케이스를 사용하다
uk: варіант використання

source: At the beginning of 2007 we got five seedlings of *Heliconia longa* (a plant ``Species``) from our neighbour (the ``Contact`` source). Since it was the first acquisition of the year, we named them 2007.0001 (we gave them a single unique ``Accession`` code, with quantity 5) and we planted them all together at one ``Location`` as a single ``Planting``, also with quantity 5.
es: A principios de 2007 conseguimos cinco plántulas de * Heliconia longa * (una ``Species`` de planta) de nuestro vecino (el ``Contact`` fuente). Puesto que era la primera adquisición del año, le pusimos nombre 2007.0001 (o sea les dimon un único código de ``Accession``, con cantidad 5) y nos plantamos todos juntos en un único ``Location`` como una sola ``Plant``, también con la cantidad de 5.
it: All'inizio del 2007 abbiamo ottenuto cinque piantine di *Heliconia longa* (una ``Specie``) da un nostro vicino (la fonte di ``contatto``). Dato che era la prima acquisizione dell'anno, l'abbiamo chiamata 2007.0001, cioè abbiamo dato alle cinque piantine uno stesso codice di ``accessione``, con quantità iniziale 5 e le abbiamo piantate tutte insieme in una stessa ``ubicazione`` come una singola ``pianta``, anche questa con quantità 5.
ko: 2007년 초에 우리는 이웃나라('연락처')로부터 '헬레코니아 롱가'('종의 식물') 묘목 5점을 받았다. 올해 첫 번째 인수였기 때문에 우리는 그들에게 2007.0001이라는 이름을 붙였고 우리는 그들 모두를 하나의 "위치"에 하나의 "식물"으로 그리고 또한 5개의 "식물"으로 심었다.
uk: На початку 2007 року ми отримали п'ять саджанців *Heliconia longa* (``Вид`` рослини) від нашого сусіда (джерело ``Контакт``). Оскільки це було перше придбання року, ми назвали їх 2007.0001 (ми надали їм єдиний унікальний код ``Приєднання``, з кількістю 5) і ми посадили їх усіх разом в одному ``Розташування`` як одиничне ``Насадження``, також з кількістю 5.

source: At the time of writing, nine years later, ``Accession`` 2007.0001 has 6 distinct ``Plantings``, each at a different ``Locations`` in our garden, obtained vegetatively (asexually) from the original 5 plants. Our only intervention was splitting, moving, and of course writing this information in the database. Total plant quantity is above 40.
es: En el momento de la escritura, nueve años más tarde, la ``Accession`` 2007.0001 tiene 6 ``Plant`` distintas, cada una en un diferente ``Location`` en nuestro jardín, que se dieron vegetativamente (asexualmente) de las 5 plantas originales. Nuestra intervención sólo fue dividir, mover y por supuesto escribir esta información en la base de datos. La cantidad total de la planta está por encima de 40.
it: Al momento della scrittura, nove anni più tardi, l'``accessione`` 2007.0001 ha 6 ``piante`` distinte, ognuna in una diversa ``ubicazione`` nel nostro giardino, ottenute per via vegetativa (asessualmente) dalle 5 piante originali. Il nostro unico intervento era separare, spostare e naturalmente scrivere queste informazioni nel database. La quantità totale delle varie ``piante`` è ora superiore a 40.
ko: 9년이 지난 2007.0001은 9년이 지난 현재 우리 정원에 있는 각기 다른 '위치'에 있는 6개의 '식물'이 원래의 5개 식물에서 채소를 (성적으로) 얻었다. 우리의 유일한 개입은 분할, 이동, 그리고 물론 데이터베이스에 이 정보를 작성하는 것이었습니다. 총 플랜트 수량이 40개 이상입니다.
uk: На момент написання, через дев'ять років, ``Приєднання`` 2007.0001 має 6 окремих ``Насаджень``, кожне в іншому ``Розташуванні`` у нашому саду, отриманих вегетативно (безстатево) від оригінальних 5 рослин. Наше єдине втручання було поділ, переміщення, і, звичайно, записати цю інформацію в базі даних. Загальна кількість рослин перевищує 40.

source: New ``Plantings`` obtained by (assisted) sexual ``Propagation`` come in our database under different ``Accession`` codes, where our garden is the ``Contact`` source and where we know which of our ``Plantings`` is the seed parent.
es: Nuevas ``Plant`` obtenidas por ``Propagation`` sexual (asistida) entran en nuestra base de datos bajo diferentes códigos de ``Accession``, en que nuestro jardín es la fuente de ``Contact`` y donde sabemos cuál de nuestras ``Plant`` el padre de semilla.
it: Nuove ``piante`` ottenute per ``propagazione`` sessuale assistita entrano nel nostro database sotto codici di ``accessione`` diversi, dove il nostro giardino è la fonte di ``contatto`` e dove sappiamo quale delle nostre ``piante`` è da considerarsi la madre.
ko: 성적인 ''전파''가 입수한 새로운 ''전파''는 우리의 데이터베이스에 우리 정원이 ``접촉"의 원천이고 ``전파" 중 어느 것이 종자 부모인지 우리가 아는 다른 ``접근" 코드로 나온다.
uk: Нові ``Насадження``, отримані (допоміжним) половим ``Розповсюдженням``, надходять в нашу базу даних за різними кодами ``Приєднання``, де наш сад є джерелом ``Контакт``, і де ми знаємо, який із наших ``Насаджень`` - батько сім'ї.

source: the above three cases translate into several short usage stories:
es: los tres casos anteriores se traducen en varias historias de uso:
it: questi tre casi si traducono in diverse brevi storie d'uso:
ko: 위의 세 가지 사례는 몇 가지 짧은 사용 사례로 해석됩니다:
uk: ці три випадки переводяться в кілька коротких історій використання:

source: activate the menu Insert → Accession, verify the existence and correctness of the ``Species`` *Heliconia longa*, specify the initial quantity of the ``Accession``; add its ``Planting`` at the desired ``Location``.
es: activar el menú Insertar → accesión, verificar la existencia y corrección de la ``Species`` *Heliconia longa*, especificar la cantidad inicial de la ``Accession``; añadir su ``Plant`` en la ``Location`` deseada.
it: attivare il menu Inserisci → accessione, verificare l'esistenza e la correttezza della specie *Heliconia longa*, specificare la quantità iniziale del'accessione '; aggiungere il suo planting nella posizione preferita.
ko: → 등록 삽입 메뉴를 활성화하고, "종" *헬리코니아 longa*의 존재와 정확성을 확인하고, "접속"의 초기 수량을 지정하고, 원하는 "위치"에 "식물"을 추가합니다.
uk: Активізуйте меню Вставка → Приєднання, перевірте існування та правильність ``Види`` *Heliconia longa*, вкажіть початкову кількість ``Приєднання``; додайте своє ``Насадження`` на бажане ``Розташування``.

source: edit ``Planting`` to correct the amount of living plants — repeat this as often as necessary.
es: Editar ``Plant`` para corregir la cantidad de plantas vivas, repetir este proceso tantas veces como sea necesario.
it: modificare ' planting ' in modo da tener aggiornata la quantità di piante viventi — ripetere questa operazione quando necessario.
ko: "식물 재배"를 수정하여 생식물의 양을 수정하고 필요한 경우 이를 자주 반복한다.
uk: відредагуйте ``Насадження`` для виправлення кількості живих рослин - повторіть це так часто, як це необхідно.

source: edit ``Planting`` to split it at separate ``Locations`` — this produces a different ``Planting`` under the same ``Accession``.
es: Editar ``Plant`` dividiendo en las ``Location`` diferentes, esto produce distintas ``Plant`` bajo la misma ``Accession``.
it: modificare ' planting ' per dividerlo in sedi separate del ' ' — questo produce un diverso 'planting ' sotto la stessa 'accessione '.
ko: ``플랜팅"을 편집해 별도의 ``위치"로 나누면 같은 ``액세스" 하에서 다른 ``플랜팅"이 나온다.
uk: відредагуйте ``Насадження``, щоб розділити його на окремі ``Розташування`` - це створює інші ``Насадження`` під тим самим ``Приєднанням``.

source: edit ``Planting`` to add a (seed) ``Propagation``.
es: Editar '' siembra '' para agregar una (semilla) '' propagación ''.
it: modificare ' planting ' per aggiungere un ' propagazione ' (seme).
ko: '심기'를 편집해 '전파'를 붙인다.
uk: редагувати ``Насадження``, щоб додати (насіння) ``Розповсюдження``.

source: edit ``Planting`` to update the status of the ``Propagation``.
es: Editar ``Plant`` para actualizar el estado de la ``Propagation``.
it: modificare per aggiornare lo stato della 'propagazione ' che ' pianta '.
ko: '플랜팅'을 편집해 '전파'의 위상을 새롭게 하다.
uk: редагувати ``Насадження`` щоб оновити статус ``Розповсюдження``.

source: activate the menu Insert → Accession to associate an accession to a successful ``Propagation`` trial; add the ``Planting`` at the desired ``Location``.
es: activar el menú Insertar → Accesión para asociar una accesión a un intento exitoso de ``Propagation``; agregar la nueva ``Plant`` en la ``Location`` deseada.
it: attivare il menu Inserisci → accessione per associare un'accessione a un processo di ' propagazione ' successo; aggiungere la piantatura del ' ' nella posizione desiderata del ' '.
ko: → 등록 삽입 메뉴를 활성화하여 성공적인 ``전파" 재판에 등록하고 원하는 "위치"에 "플랜팅"을 추가합니다.
uk: активізуйте меню Вставити → Приєднання, щоб пов'язати приєднання до успішної пробної версії ``Розповсюдження``; додайте ``Насадження`` у бажаному ``Розташуванні``.

source: In particular the ability to split a ``Planting`` at several different ``Locations`` and to keep all uniformly associated to one ``Species``, or the possibility to keep information about ``Plantings`` that have been removed from the collection, help justify the presence of the ``Accession`` abstraction level.
es: En particular la capacidad de dividir un ``Plant`` en varias ``Location`` diferentes y que todas queden uniformemente asociadas a una ``Species``, o la posibilidad de mantener información sobre ``Plant`` que se han ido de la colección, ayudar a justificar la presencia del nivel de abstracción ``Accession``.
it: In particolare la capacità di dividere una piantatura del ' ' in diverse località diverse del ' ' e per mantenere tutte le uniformemente associato a una 'specie ', o la possibilità di mantenere informazioni su 'planting ' che sono stati rimossi dalla raccolta, contribuire a giustificare la presenza del livello di astrazione di 'Accessione '.
ko: 특히 ``식물"을 여러 다른 ``위치"에 분할하고 하나의 ``종"과 모든 연관성을 균일하게 유지할 수 있는 능력이나 수집에서 제거된 ``식물"에 대한 정보를 유지할 수 있는 가능성은 "접근" 추상화 수준의 존재를 정당화하는 데 도움이 된다.
uk: Зокрема, можливість розділити ``Насадження`` в декількох різних ``Розташуваннях`` і тримати все рівномірно асоційованими з одним ``Видом``, або можливість зберегти інформацію про ``Насадження`` які були вилучені з колекції, допоможе підтвердити наявність рівня абстракції ``Приєднання``.

source: Hypersimplified view
ko: 지나치게 단순화된 보기

source: People using Ghini only sporadically may prefer ignoring the database structure and look at it as two nested sequences of objects, each element of the sequence being necessary to add element at the next level.
ko: Ghini를 산발적으로만 사용하는 사람들은 데이터베이스 구조를 무시하고 다음 단계에서 요소를 추가하는 데 필요한 두 개의 중첩된 객체 시퀀스로 보는 것을 선호할 수열의 각 요소는 다음과 같다.

source: In order to get down to an Accession, you will need four levels, as in this example:
ko: 등록으로 이동하려면 다음 예와 같이 네 가지 수준이 필요합니다:

source: A quite complete set of Families and Genera are inserted in your database at the moment Ghini initializes it. So all you need is adding Species and Accessions, in this order.
ko: Ghini가 데이터베이스를 초기화하는 순간 완전한 패밀리 및 제네레이션 집합이 데이터베이스에 삽입됩니다. 따라서 종과 접근법만 추가하면 됩니다.

source: When placing a physical Plant (relative to an Accession) somewhere in the garden, you need to describe this "somewhere" digitally, as a Location in the garden.
ko: (등록과 관련된) 실제 식물을 정원 어딘가에 배치할 때, 여러분은 이 "어딘가"를 디지털로, 정원의 위치라고 설명할 필요가 있습니다.

source: Highlights
es: Puntos destacados
it: Punti principali
ko: 하이라이트
uk: Підсвічування

source: not-so-brief list of highlights, meant to whet your appetite.
es: no-tan-breve lista de destacados, para abrir tu apetito.
it: non-così-breve elenco delle principali attrattive, destinata stuzzicare l'appetito.
ko: 식욕을 돋우기 위한 하이라이트 목록이야.
uk: не такий короткий перелік основних моментів, мав на увазі, щоб підігріти апетит.

source: taxonomic information
es: información taxonómica
it: informazioni tassonomiche
ko: 분류학적 정보
uk: класифікаційна інформації

source: When you first start Ghini, and connect to a database, Ghini will initialize the database not only with all tables it needs to run, but it will also populate the taxon tables for ranks family and genus, using the data from the “RBG Kew's Family and Genera list from Vascular Plant Families and Genera compiled by R. K. Brummitt and published by the Royal Botanic Gardens, Kew in 1992”. In 2015 we have reviewed the data regarding the Orchidaceae, using “Tropicos, botanical information system at the Missouri Botanical Garden - www.tropicos.org” as a source.
es: Cuando primero arrancas Ghini y conectas a una base de datos, Ghini inicializa la base de datos no sólo con todas las tablas que necesita para funcionar, sino también importa en las tablas de taxonomía los datos de la "RBG Kew's Family and Genera list from Vascular Plant Families and Genera compiled by R. K. Brummitt and published by the Royal Botanic Gardens, Kew in 1992". En 2015 se han revisado los datos sobre Orchidaceae, utilizando "Tropicos, sistema de información botánica en el jardín botánico de Missouri - www.tropicos.org" como fuente.
ko: Ghini를 처음 시작하고 데이터베이스에 연결하면, Ghini는 데이터베이스를 실행해야 하는 모든 테이블로 초기화할 뿐만 아니라 R.K. Brummt가 컴파일한 "RBG Kew's Family and General list"의 데이터를 사용하여 순위 패밀리와 속에서의 Taxon 테이블도 채울 수 있습니다.1992년 큐우 왕립 식물원" 2015년에는 "Tropicos, 미주리 식물원의 식물 정보 시스템 - www.tropicos.org"을 출처로 사용하여 난초과와 관련된 데이터를 검토하였다.
uk: Коли ви вперше запустите Ghini, і підключитися до бази даних, Ghini буде ініціалізувати базу даних не тільки з усіма таблицями, які потрібно запустити, але і заповнювати таблиці таксонів для рангів сім'ї і роду, використовуючи дані з “RBG Kew's Family and Genera list from Vascular Plant Families and Genera compiled by R. K. Brummitt and published by the Royal Botanic Gardens, Kew in 1992”. У 2015 році ми переглянули дані щодо Orchidaceae, використовуючи, як джерело, “Tropicos, botanical information system at the Missouri Botanical Garden - www.tropicos.org”.

source: importing data
es: importar data
it: Importa dati
ko: 데이터 가져오기
uk: імпорт даних

source: Ghini will let you import any data you put in an intermediate json format. What you import will complete what you already have in the database. If you need help, you can ask some Ghini professional to help you transform your data into Ghini's intermediate json format.
es: Ghini le permitirá importar los datos que pones en formato json intermedio. Lo que importa completa lo que ya tienes en la base de datos. Si usted necesita ayuda, puede pedir algún profesional Ghini para ayudarle a transformar sus datos en formato de json intermedio de Ghini.
it: Ghini vi permetterà di importare i dati che hai messo in un formato intermedio json. Che cosa è importare completerà a quello che hai già nel database. Se hai bisogno di aiuto, si può chiedere qualche professionista Ghini per aiutarti a trasformare i dati in formato json intermedio di Ghini.
ko: Ghini는 중간 json 형식으로 입력한 모든 데이터를 가져올 수 있도록 합니다. 가져온 내용은 데이터베이스에 이미 있는 내용을 완료합니다. 도움이 필요한 경우 Ghini 전문가에게 데이터를 Ghini의 중간 json 형식으로 변환하도록 도움을 요청할 수 있습니다.
uk: Ghini дозволить вам імпортувати будь-які дані, які ви помістили в проміжному форматі json. Те, що ви імпортуєте, завершить те, що ви вже маєте в базі даних. Якщо вам потрібна допомога, ви можете попросити фахівця Ghini допомогти вам перетворити ваші дані в проміжний Ghini формат json.

source: synonyms
es: sinónimos
it: sinonimi
ko: 동의어
uk: синоніми

source: Ghini will allow you define synonyms for species, genera, families. Also this information can be represented in its intermediate json format and be imported in an existing Ghini database.
es: Ghini le permite definir sinónimos para especies, géneros, familias. También esta información puede ser representada en el formato json de intercambio y puede ser importada in una base de datos Ghini.
it: Ghini vi permetterà che si definiscono sinonimi per specie, generi e famiglie. Anche questa informazione può essere rappresentata nel formato json intermedio ed essere importata in un database esistente di Ghini.
ko: Ghini 당신 종, 속, 가정들은 동의어들을 정의할 것이다.또한 이 정보를 대한 중간json 형식으로 기존 Ghini 데이터베이스에 수입될 표시할 수 있다.
uk: Ghini дозволить визначити синоніми для видів, родів, сімейств. Крім того, ця інформація може бути представлена в проміжному форматі json і імпортована в існуючу базу даних Ghini.

source: scientific responsible
es: científicamente responsable
it: scientifica responsabile
ko: 과학적 책임이 있는
uk: наукова відповідальність

source: Ghini implements the concept of 'accession', intermediate between physical plant (or a group thereof) and abstract taxon. Each accession can associate the same plants to different taxa, if two taxonomists do not agree on the identification: each taxonomist can have their say and do not need overwrite each other's work. All verifications can be found back in the database, with timestamp and signature.
es: Ghini implementa el concepto de “accesión”, conexión abstracta entre la planta física (o un grupo de plantas físicas) y la especie o taxón a que pertenecen. Cada accesión puede asociar todo el mismo grupo de plantas que le pertenece a uno o más taxones, en el caso no haya acuerdo entre los taxónomos a disposición del jardín: cada taxónomo puede insertar su opinión en la base de datos, sin necesitar borrar la información anteriormente presente. Todas las verificaciones se encuentran en la base de datos, con fecha y firma.
it: Ghini implementa il concetto di «accessione», intermedio tra planting fisico (o un gruppo di loro) e astratte taxon. Ogni accessione possibile associare le stesse piante di diversi taxa, se due tassonomisti non concordano sull'identificazione: ogni tassonomista possono dire la loro e non è necessario sovrascrivere il lavoro di altri. Tutte le verifiche possono essere trovate nel database, con timestamp e firma.
ko: 기니는 '접근'의 개념, 물리적 식물(또는 물리적 식물 그룹)과 추상적 과세(taxon)의 중간 개념을 구현한다. 두 명의 분류학자가 식별에 동의하지 않는 경우, 각 분류학자는 서로 다른 분류학에 동일한 식물을 연관시킬 수 있으며, 서로의 작업을 덮어쓸 필요가 없다. 모든 확인은 타임스탬프와 서명을 사용하여 데이터베이스에서 다시 찾을 수 있습니다.
uk: Ghini реалізує концепцію 'приєднань', як проміжну між фізичною рослиною (або їх групою) і абстрактним таксоном. Кожне приєднання може пов'язати ті ж рослини з різними таксонами, якщо два систематики не згодні з ідентифікації: кожен систематик може мати свою думку і не потрібно перезаписати роботу один одного. Всі перевірки можуть бути знайдені в базі даних, з відміткою часу і підписом.

source: helps off-line identification
es: facilita la identificación a distancia
it: Aiuta identificazione off-line
ko: 오프라인 식별에 도움이 됩니다
uk: допомагає офф-лайн ідентифікації

source: Ghini allows you associate pictures to physical plants, this can help recognize the plant in case a sticker is lost, or help taxonomic identification if a taxonomist is not available at all times.
es: Ghini le permite asociar fotos a plantas físicas, esto puede ayudarle a reconocer la planta en caso de que se pierda la nota, o ayudar a la identificación taxonómica si no está disponible un taxónomo.
it: Ghini permette di associare immagini alle piante fisiche, questo può aiutare a riconoscere la pianta, nel caso in cui un adesivo è perso, o identificazione tassonomica aiuto se un tassonomista non è disponibile a tutti volte.
ko: 기니를 사용하면 그림을 물리적 식물과 연결할 수 있으며, 스티커가 분실된 경우 식물을 인식하는 데 도움이 될 수 있으며, 분류학자를 항상 사용할 수 없는 경우 분류법을 식별하는 데 도움이 될 수 있습니다.
uk: Ghini дозволяє асоціювати фотографії з фізичними рослинами, це може допомогти розпізнати рослину в разі втрати етикетки, або допомогти таксономічній ідентифікації, якщо систематик не доступний весь час.

source: exports and reports
es: exportación e informes
it: esportazioni e rapporti
ko: 수출과 보고
uk: експорт і звіти

source: Ghini will let you export a report in whatever textual format you need. It uses a powerful templating engine named 'mako', which will allow you export the data in a selection to whatever format you need. Once installed, a couple of examples are available in the mako subdirectory.
es: Ghini le permite exportar los datos en cualquier formato textual le parezca útil. Ghini utiliza un motor de plantillas muy flexible, que se llama “mako”, con el cual solo su imaginación es el límite a los formatos en que exportar los datos. Una vez instalado, hay varios ejemplos en la carpeta `mako`.
it: Ghini ti consente di esportare un report in qualsiasi formato testuale che avete bisogno. Utilizza un motore di template potente denominato 'mako', che vi permetterà che si esportano i dati in una selezione in qualsiasi formato che avete bisogno. Una volta installato, un paio di esempi sono disponibili nella sottodirectory mako.
ko: Ghini 당신이 원하는 모든 것이 텍스트 형식에서 너가 필요한 보고서를 내보내 줄 것이다.그것은 선택에서 무엇이든지 형식이 필요할 수 있도록 데이터를 수출하게 할 강력한 templating 엔진 'mako'이라고 이름을 사용합니다.한번 설치한 뒤에는 두개의 예들은mako 디렉터리에서 이용할 수 있다.
uk: Ghini дозволить вам експортувати звіт в будь-якому текстовому форматі. Він використовує потужний шаблонний движок під назвою 'mako', який дозволить експортувати дані вибравши будь-який формат, що вам потрібний. Після установки, кілька прикладів можна знайти в підкаталозі mako .

source: annotate your info
es: anotar la información
it: annotare le informazioni
ko: 정보에 주석을 달다
uk: анотувати ваші дані
