Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Our ghini database is called ``bauble``, and ``bauble`` is also the name of our database super user, the only user with ``CREATEROLE`` privilege.
es: Nuestra base de datos de ghini se llama ``bauble``, y ``bauble`` es también el nombre de nuestro super usuario base de datos, el único usuario con privilegio ``CREATEROLE``.
ko: 우리의 기니 데이터베이스는 "바보블"이라고 불리며 "바보블"은 "크리에테롤" 특권을 가진 유일한 사용자인 우리의 데이터베이스 수퍼유저의 이름이기도 하다.
uk: Наша база даних ghini називається ``bauble``, і ``bauble`` також ім'я суперкористувача нашої бази даних, єдиного користувача з ``CREATEROLE`` привілеєм.

source: For example, the following invocation would create the user ``willem`` with password ``orange``, on the ``bauble`` database hosted at 192.168.5.6::
es: Por ejemplo, la invocación siguiente crearía el usuario ``willem`` con contraseña ``orange``, en la base de datos ``bauble``, en el anfitrión 192.168.5.6::
ko: 예를 들어, 다음 호출은 비밀번호가 "주황색"인 사용자 "윌렘"을 192.168.5.6에 호스팅되는 "보블" 데이터베이스에 생성한다::
uk: Наприклад, наступний виклик створить користувача ``willem`` з паролем ``orange`` у базі ``bauble``, розміщених на 192.168.5.6::

source: Understanding when to update
es: Entender cuándo se debe actualizar
it: Capire quando aggiornare
ko: 업데이트 시기 이해
uk: Розуміння того, коли оновлювати

source: Updating the system
es: Actualizar el sistema
it: Aggiornare il sistema
ko: 시스템 업데이트
uk: Оновлення системи

source: Ubuntu updates are a lot lighter and easier than with Windows. So whenever the system suggests an update, we let it do that. Generally, there's no need to wait during the update nor to reboot after it's done.
es: Poner al día Ubuntu es una tarea mucho más liviana que poner al día Windows. Si el sistema sugiere una puesta al día, se puede dejárselo hacer sin problemas: mientras tanto el sistema estará a disposición y nunca te obligará a reinicializar.
ko: Ubuntu 업데이트는 Windows보다 훨씬 가볍고 쉽습니다. 그래서 시스템이 업데이트를 제안할 때마다, 우리는 그렇게 하도록 내버려 둡니다. 일반적으로 업데이트 중에 기다릴 필요도 없고 업데이트 후 재부팅할 필요도 없습니다.
uk: Оновлення Ubuntu набагато легше і простіше, ніж у Windows. Тому коли система пропонує оновлення, ми дозволимо це зробити. Як правило, не потрібно чекати під час оновлення, ані перезавантажувати після завершення.

source: Updating ghini
es: Actualizar Ghini
it: Aggiornare Ghini
ko: 지니 업데이트
uk: Оновлення ghini

source: The first window presented by Ghini looks like this. Normally, you don't need do anything in this window, just press enter and get into the main program screen.
es: La primera ventana presentada por Ghini se ve así. Normalmente, usted no necesita hacer nada en esta ventana, sólo tiene que pulsar Conectar y seguir a la pantalla principal del programa.
it: La prima finestra presentata da Ghini assomiglia a questo. Normalmente non devi fare nulla in questa finestra, solo premere invio ed entrare nella schermata principale del programma.
ko: 기니가 처음 선물한 창문은 이렇게 생겼습니다. 일반적으로 이 창에서는 아무것도 할 필요가 없습니다. Enter 키를 누르고 메인 프로그램 화면으로 들어가시면 됩니다.
uk: Перше вікно, представлене Ghini, виглядає так. Зазвичай у цьому вікні вам нічого не потрібно робити, просто натисніть клавішу Enter і потрапите у головний екран програми.

source: Occasionally, at the top of the screen an information text will appear, telling you that a newer version is available on-line.
es: Ocasionalmente, en la parte superior de la pantalla aparece un texto de información, diciéndole que una versión más reciente está disponible en línea.
it: Occasionalmente, nella parte superiore dello schermo apparirà un testo, che t'informa che una versione aggiornata è disponibile on-line.
ko: 때때로 화면 맨 위에 최신 버전을 온라인으로 사용할 수 있음을 알리는 정보 텍스트가 나타납니다.
uk: Іноді у верхній частині екрана з'являється інформаційний текст, в якому повідомляється, що нова версія доступна в режимі онлайн.

source: The update procedure is simple, and it depends on the operating system you use, we're not explaining here again.
es: El procedimiento de actualización es sencillo, y depende del sistema operativo que utilice, no estamos explicando aquí de nuevo.
it: La procedura di aggiornamento è semplice, e dipende dal sistema operativo in uso, non stiamo a spiegarlo di nuovo.
ko: 업데이트 절차는 간단하며, 사용하는 운영 체제에 따라 다릅니다. 여기서는 다시 설명하지 않습니다.
uk: Процедура оновлення проста, і це залежить від використовуваної вами операційної системи, ми не пояснюємо тут ще раз.

source: It is generally a good idea updating the software. If in doubt, contact the author, or write to the group.
es: Es generalmente una buena idea actualizar el software. En caso de duda, póngase en contacto con el autor, o escribir al grupo.
it: È generalmente una buona idea aggiornare il software. In caso di dubbio, contattare l'autore, o scrivere al gruppo.
ko: 일반적으로 소프트웨어를 업데이트하는 것이 좋습니다. 확실하지 않은 경우 작성자에게 문의하거나 그룹에 기록합니다.
uk: Як правило, хороша ідея оновлення програмного забезпечення. Якщо у вас сумніви, зв'яжіться з автором або напишіть у групу.

source: understanding ghini initial screen
es: Entender la pantalla inicial de ghini
it: la schermata iniziale di ghini
ko: 기니 초기 화면 이해
uk: розуміння початкового екрану ghini

source: Complete screen
es: Pantalla completa
it: Schermo completo
ko: 전체 화면
uk: Повний екран

source: At the moment of writing, our initial screen looked like this:
es: En el momento de la escritura, nuestra pantalla inicial se veía así:
it: Al momento di scrivere, la nostra schermata iniziale si presentava così:
ko: 글을 쓰는 순간, 우리의 초기 화면은 다음과 같았다:
uk: На момент написання наш початковий екран виглядав так:

source: Apart from the main application menu, Ghini offers three special interface sections with information and tools to explore the database.
es: Aparte del menú principal de la aplicación, el interfaz de Ghini ofrece tres secciones especiales, con información y herramientas para explorar la base de datos.
it: Oltre al menù principale dell'applicazione, Ghini offre tre sezioni di interfaccia speciale con informazioni e strumenti per esplorare il database.
ko: 기본 응용 프로그램 메뉴 외에도 Ghini는 데이터베이스를 탐색할 수 있는 정보와 도구가 포함된 세 가지 특수 인터페이스 섹션을 제공합니다.
uk: Крім основного меню додатків, Ghini пропонує три розділи спеціального інтерфейсу з інформацією та інструментами для вивчення бази даних.

source: Numeric overview
es: Resumen numérico
it: Panoramica numerica
ko: 숫자 개요
uk: Числовий огляд

source: The table in the right half of the screen presents a summary of all the registered plants can be observed. Each entry printed in bold is a link to the query selecting the corresponding objects.
es: La tabla en la mitad derecha de la pantalla muestra un resumen de todas las plantas registradas. Cada entrada en negrita es un enlace a la consulta que selecciona los objetos correspondientes.
it: La tabella nella parte destra dello schermo presenta un riepilogo di tutte le piange nel database. Ogni voce in grassetto è un link alla query che seleziona gli oggetti corrispondenti.
ko: 화면 오른쪽의 표에는 모든 등록된 식물을 관찰할 수 있는 요약이 나와 있습니다. 굵게 인쇄된 각 항목은 해당 개체를 선택하는 쿼리에 대한 링크입니다.
uk: Таблиця у правій половині екрана, яка містить зведення всіх зареєстрованих рослин, можна спостерігати. Кожна запис, надрукований жирним шрифтом, є посиланням на запит, вибравши відповідні об'єкти.

source: Stored queries
es: Consultas almacenadas
it: Query memorizzate
ko: 저장된 쿼리
uk: Збережені запити

source: The lower half of the right hand side contains a set of stored queries. While you can edit them to your liking, our hints include selecting those accessions that have not been identified at rank species. And one for the database history.
es: La mitad inferior del lado derecho contiene un conjunto de consultas almacenadas. Usted las puede editar a su gusto, sin embargo nuestras sugerencias incluyen seleccionar aquellas accesiones que no han sido identificados en rango especie. Y una para la historia de la base de datos.
it: La metà inferiore del lato destro contiene un set di query memorizzate. Mentre è possibile modificarle a proprio piacimento, suggeriamo includere la selezione di accessioni non identificate al rango specie. E uno per la cronologia del database.
ko: 오른 쪽 하반신은 저장된 쿼리의 집합이 들어 있습니다.반면 당신은 당신의 좋아하는 그들 편집할 수 있는, 우리의 힌트는 계급종에 밝혀지지 않고 있는 accessions 선택 포함한다.중의 하나는 데이터베이스 역사로.
uk: Нижня половина правої сторони містить набір збережених запитів. Хоча ви можете редагувати їх за вашим бажанням, наші підказки включають вибір тих приєднань, які не були ідентифіковані за категоріями видів. І один для історії бази даних.

source: Query and action buttons
es: Botones de acción y consulta
it: Pulsanti di azione e di query
ko: 쿼리 및 작업 단추
uk: Кнопки запиту та дії

source: At the top of this screen you can find the field in which you would enter your searches.
es: En la parte superior de esta pantalla usted puede encontrar el campo en el que introducir sus búsquedas.
it: Nella parte superiore della schermata sta il campo in cui immettere le ricerche.
ko: 이 화면 상단에서 검색을 입력할 필드를 찾을 수 있습니다.
uk: У верхній частині цього екрана ви можете знайти поле, в яке потрібно ввести ваші пошуки.

source: With the |100000000000001C00000020F4C7873186014F2F_png| button, in the form of a house, you can return from your searches to the main screen.
es: Con el |100000000000001C00000020F4C7873186014f2f_png| botón, en la forma de una casa, usted puede volver de sus búsquedas en la pantalla principal.
it: Con il pulsante |100000000000001C00000020F4C7873186014F2F_png|, una casa, è possibile tornare dalle tue ricerche alla schermata principale.
ko: |1000000000001C00000020F4C7873186014F2로F_png| 버튼은 집 형태로 검색에서 기본 화면으로 돌아갈 수 있습니다.
uk: З |100000000000001C00000020F4C7873186014F2F_png| кнопки, у вигляді будинку, ви можете повернутися з ваших пошуків на головний екран.

source: With the |100000000000001B000000207EC6F9075C9D3669_png| button, in the form of an arrow, you can return to your last search.
es: Con el |100000000000001B000000207EC6F9075c9d3669_png| botón en forma de flecha, puede volver a su última búsqueda.
it: Con il pulsante |100000000000001B000000207EC6F9075C9D3669_png|, una freccia, è possibile tornare alla ultima ricerca.
ko: |100000000001B0000207로EC6F9075C9D3669_png| 버튼 화살표 형태로 마지막 검색으로 돌아갈 수 있습니다.
uk: З |100000000000001B000000207EC6F9075C9D3669_png| кнопки, у формі стрілки, ви можете повернутися до вашого останнього пошуку.

source: With the |100000000000001C0000001FB8A1F75F7A5EF877_png| button, in the form of a gear, you can start the "Query Builder", which helps you compose complex searches in a simple, graphical way.
es: Con el botón |100000000000001C0000001FB8A1F75F7a5ef877_png| en forma de engranaje, usted puede iniciar la "Query Builder", que le ayuda a componer complejas búsquedas en una simple forma gráfica.
it: Con il pulsante |100000000000001C0000001FB8A1F75F7A5EF877_png|, un ingranaggio, è possibile avviare il "Generatore di Query", che ti aiuta a comporre ricerche complesse in modo semplice, grafico.
ko: |1000000001C00001로FB8A1F75F7A5EF877_png| 버튼은 "Query Builder"를 시작할 수 있으며, 이는 복잡한 검색을 간단하고 그래픽으로 구성할 수 있도록 도와줍니다.
uk: З |100000000000001C0000001FB8A1F75F7A5EF877_png| кнопки, у формі передач, ви можете запустити "Query Builder", який допоможе вам скласти складні пошуки в простий, графічний спосіб.

source: We often have volunteers who only work at the garden for a very short time. It was with them in mind that we have developed a `hyper-simplified view <goal.html#hypersimplified-view>`_ on the ghini database structure.
es: A menudo tenemos voluntarios que trabajan en el jardín sólo por un tiempo muy corto. Es con ellos en la mente que hemos desarrollado una `vista hipersimplificada <goal.html#hypersimplified-view>`_ en la estructura de la base de datos de ghini.
it: Abbiamo spesso volontari che lavorano presso il giardino per un tempo molto breve. Pensando a loro abbiamo sviluppato una `vista ultrasemplificata <goal.html#hypersimplified-view>`_ della struttura del database di ghini.
ko: 우리는 종종 아주 짧은 시간 동안만 정원에서 일하는 자원봉사자들을 가지고 있다. 우리가 기니 데이터베이스 구조에 대한 '초간단 뷰(hyper-simplified view)'를 개발한 것은 그들을 염두에 둔 것이었다.
uk: У нас часто є добровольці, які працюють тільки в саду дуже короткий час. Саме це маючи на увазі, ми розробили `hyper-simplified view <goal.html#hypersimplified-view>`_ на Ghini структури бази даних.

source: Details
es: Detalles
it: Dettagli
ko: 상세
uk: Деталі

source: The two figures here show all that our temporary collaborators need to know.
es: Las dos figuras aquí muestran todo lo que necesitan saber nuestros colaboradores temporales.
it: Le due figure qui mostrano tutto ciò che i nostri collaboratori temporanei devono sapere.
ko: 여기 이 두 수치는 임시 협력자들이 알아야 할 모든 것을 보여줍니다.
uk: Дві цифри тут показують все, що наші тимчасові співробітники повинні знати.

source: Taxonomy & Collection
es: Taxonomia y colección
it: Tassonomia & collezione
ko: 분류법 & 수집
uk: Таксономія та колекція

source: Garden
es: Jardín
it: Giardino
ko: 정원
uk: Сад

source: At times, the program gives error messages. |dontpanic_png|, retry, or report to the developers.
es: A veces, el programa da mensajes de error. |dontpanic_png|, reintente, o informe a los desarrolladores.
it: A volte, il programma dà messaggi di errore. |dontpanic_png|, riprova, o informa gli sviluppatori.
ko: 때때로, 프로그램은 오류 메시지를 줍니다. |panspanic_the|, 다시 시도하거나 개발자에게 보고합니다.
uk: Іноді програма повідомляє про помилку. |dontpanic_png|, повторіть спробу або повідомте розробникам.

source: Network problems
es: Problemas de red
it: Problemi di rete
ko: 네트워크 문제
uk: Мережеві проблеми

source: In order to work, the program needs a stable network connection to the database server. It can happen: you start the program, and it can't connect to our database server. You would then get a rather explicit but very badly typeset error message.
es: Para trabajar, el programa necesita una conexión de red estable con el servidor de base de datos. Puede suceder que: se inicia el programa, y no se puede conectar a nuestro servidor de base de datos. El mensaje de error obtenido es bastante explícito pero también muy mal compuesto.
it: Per poter funzionare, il programma ha bisogno di una connessione di rete stabile al server di database. Può succedere: si avvia il programma, e non è possibile connettersi al nostro server di database. Si ottiene un messaggio di errore abbastanza chiaro ma molto mal composto.
ko: 이 프로그램이 작동하기 위해서는 데이터베이스 서버에 대한 안정적인 네트워크 연결이 필요합니다. 프로그램을 시작하면 데이터베이스 서버에 연결할 수 없습니다. 그런 다음 명시적이지만 매우 잘못된 형식의 오류 메시지가 표시됩니다.
uk: Для роботи програма потребує стабільного мережевого підключення до сервера баз даних. Це може статися: ви запускаєте програму, і вона не може підключитися до нашого сервера баз даних. Потім ви отримаєте досить явне, але дуже погано набираєме повідомлення про помилку.

source: Just ignore it and try again.
es: Sólo ignorarlo y vuelva a intentarlo.
it: Basta ignorarlo e riprovare.
ko: 그냥 무시하고 다시 해보세요.
uk: Просто ігноруйте його і повторіть спробу.

source: Search fails with error
es: La búsqueda falla con error
it: La ricerca ha esito negativo con errore
ko: 검색 실패 오류
uk: Пошук не вдається з помилкою

source: Sometimes and without any apparent cause, a search will not run successfully, and a window with an error message will be displayed. In this case you only have to try to perform the same search again.
es: A veces sin causa aparente, una búsqueda no se ejecutará correctamente y aparecerá una ventana con un mensaje de error. En este caso sólo tienes que intentar realizar la misma búsqueda otra vez.
it: A volte e senza alcuna causa apparente, una ricerca non è eseguita correttamente e appare una finestra con un messaggio di errore. In questo caso prova a eseguire nuovamente la stessa ricerca.
ko: 경우에 따라 뚜렷한 원인 없이 검색이 성공적으로 실행되지 않고 오류 메시지가 표시된 창이 표시됩니다. 이 경우 동일한 검색을 다시 시도하기만 하면 됩니다.
uk: Іноді і без будь-якої очевидної причини пошук не буде успішно виконуватися, і з'явиться вікно з повідомленням про помилку. У цьому випадку вам доведеться спробувати виконати той самий пошук ще раз.

source: An example of such an error message:
es: Un ejemplo de un mensaje de error:
it: Un esempio di un tale messaggio di errore:
ko: 이러한 오류 메시지의 예:
uk: Приклад такого повідомлення про помилку:

source: Search does not return something I just inserted
es: La búsqueda no devuelve algo que acabo de insertar
it: La ricerca non restituisce qualcosa che ho appena inserito
ko: 방금 삽입한 내용이 검색에서 반환되지 않습니다
uk: Пошук не повертає те, що я щойно вставив

source: Accession codes starting with zero and composed of just numbers, as for example ``016489`` are considered by the software as numbers, so if you don't enclose the search string in quotes, any leading 0 will be stripped and the value will not be found.
es: Códigos de accesión que empiezan con cero y compuesto de sólo cifras, como por ejemplo ``016489`` son considerados por el software como números, así que si usted no incluye la cadena de búsqueda entre comillas, cualquier 0 inicial será eliminado y el valor no se encuentra.
it: Codici di accessione che iniziano con zero e composti di sole cifre, come ad esempio ``016489`` sono considerati dal software come numeri, quindi se non si racchiude la stringa di ricerca fra virgolette, tutti gli 0 iniziali verranno eliminati e il valore non verrà trovato.
ko: 예를 들어 "016489"와 같이 0으로 시작하고 숫자로만 구성된 등록 코드는 소프트웨어에서 숫자로 간주되므로 검색 문자열을 따옴표로 묶지 않으면 선행 0이 제거되고 값을 찾을 수 없습니다.
uk: Коди приєднання, що починаються з нуля і складаються з чисел, наприклад, ``016489`` розглядаються програмним забезпеченням як числа, тому якщо ви не вкладете рядок пошуку в лапки, будь-який провідний 0 буде знятий і значення буде не знайдено.

source: Try again, but enclose your search string in single or double quotes.
es: Vuelva a intentarlo, pero encierran su cadena en comillas simples o dobles.
it: Riprovare, ma racchiudere la stringa di ricerca tra virgolette singole o doppie.
ko: 다시 시도하지만 검색 문자열을 작은 따옴표나 큰 따옴표로 묶습니다.
uk: Спробуйте ще раз, але додайте свій пошуковий рядок в одинарні або подвійні лапки.

source: Number on the label
es: Número en la etiqueta
it: Numero sull'etichetta
ko: 레이블의 번호
uk: Номер на етикетці

source: corresponding search
es: búsqueda correspondiente
it: ricerca corrispondente
ko: 상응하는 수색
uk: відповідний пошук

source: Please note: when you look for a Plant code, not an Accession, the leading zero becomes optional, so in the above example it's maybe easier to type ``16489.1``.
es: Nota: cuando usted busque un código de planta, no una accesión, los ceros iniciales se vuelven opcionales, por lo que en el ejemplo anterior tal vez es más fácil escribir ``16489.1``.
ko: 참고: 가입이 아닌 플랜트 코드를 찾으면 선행 0이 선택 사항이 되므로 위의 예에서 "16489.1"을 입력하는 것이 더 쉬울 수 있습니다.
uk: Будь ласка, зверніть увагу: коли ви шукаєте код рослини, а не приєднання, провідний нуль стає необов'язковим, тому в наведеному вище прикладі може бути простіше вводити ``16489.1``.

source: A serious situation happened once, and we absolutely want to prevent it from happening again: a user deleted a genus, with everything that was below it, species and accessions, and synonyms.
es: Una situación grave sucedió una vez, y absolutamente queremos evitar que vuelva a suceder: un usuario elimina un género, con todo lo que estaba abajo, especies y accesiones y sinonimias.
ko: 심각한 상황이 한 번 일어났고, 우리는 다시는 이런 일이 일어나지 않게 하고 싶습니다. 한 사용자가 그 아래에 있는 모든 것, 종과 접속, 동의어를 포함하는 속들을 삭제했습니다.
uk: Серйозна ситуація трапляється один раз, і ми абсолютно хочемо запобігти цьому: знову користувач видалив рід, все, що було нижче, види і приєднання та синоніми.

source: Solving it with user permissions
es: Solucionandolo con permisos de usuario
ko: 사용자 권한으로 해결
uk: Вирішення з правами користувачів

source: We propose to have different connection profiles, associated to different database users, each user with all needed permissions.
es: Una forma sería a través de diferentes perfiles, asociado a usuarios de base de datos, cada usuario con permisos diferentes.
ko: 우리는 필요한 모든 권한을 가진 각 사용자에게 서로 다른 데이터베이스 사용자와 관련된 다른 연결 프로필을 가질 것을 제안한다.
uk: Ми пропонуємо мати різні профілі з'єднання, пов'язані з різними користувачами баз даних, кожен користувач із усіма необхідними правами доступу.

source: Full permission (BD-JBQ)
es: Permiso completo (BD-JBQ)
ko: 전체 권한(BD-JBQ)
uk: Повний дозвіл (BD-JBQ)

source: Only qualified personnel get this kind of access.
es: Solamente el personal calificado obtiene este tipo de acceso.
ko: 자격을 갖춘 사람만 이런 종류의 접근을 할 수 있다.
uk: Тільки кваліфікований персонал отримує такий доступ.

source: Insert and update (BD-JBQ-limitado)
es: Insert y update (BD-JBQ-limitado)
ko: 삽입 및 업데이트(BD-JBQ-limitado)
uk: Вставити та оновити (BD-JBQ-limitado)

source: We use this one for those users who come help us for a limited time, and who did not get a complete introduction to database concepts. It is meant to prevent costly mistakes.
es: Usamos éste para aquellos usuarios que vienen a ayudarnos por un tiempo limitado, y que no recibieron una completa introducción a los conceptos de base de datos. Está destinado a evitar errores costosos.
ko: 우리는 제한된 시간 동안 우리를 도와 주고, 이들 완전한 도입 얻지 못하는 그런 사용자들의 이러한 걸 쓰도록 해요.그것은 비용이 많이 드는 실수를 막기 위해 의도된 것이다.
uk: Ми використовуємо цю програму для тих користувачів, які нам допомагають протягом обмеженого часу, і які не отримали повного введення в концепції бази даних. Вона призначена для запобігання серйозних помилок.

source: Read only (BD-JBQ-lectura)
es: Sólo lectura (BD-JBQ-lectura)
ko: 읽기 전용(BD-JBQ-electura)
uk: Тільки для читання (BD-JBQ-lectura)

source: it can be shared with anyone visiting the garden
es: puede ser compartido con cualquier persona que visita el jardín
ko: 그것은 정원을 방문하는 모든 사람과 공유할 수 있다
uk: це може бути доступним для всіх, хто відвідує сад

source: You select the connection at start-up, and the software asks you for the password corresponding to the connection you selected.
es: Seleccione la conexión en el inicio, y el software le pide la contraseña correspondiente a la conexión seleccionada.
ko: 시작 시 연결을 선택하면 소프트웨어가 선택한 연결에 해당하는 암호를 묻습니다.
uk: Ви вибираєте підключення під час запуску, а програма запитає вас про пароль, що відповідає обраному вами з'єднанню.

source: If you want to review the details of the connection, click on the ▶ next to 'Connection Details', it will change to ▼, and the connection window will be displayed as one of the following:
es: Si usted quiere revisar los detalles de la conexión, haga clic en el ▶ junto a 'Detalles de la conexión', cambiará a ▼ y la ventana de conexión aparecerá como una de las siguientes:
ko: 연결 세부 정보를 검토하려면 '연결 세부 정보' 옆의 ▶를 클릭하면 ▼로 변경되고 연결 창이 다음 중 하나로 표시됩니다:
uk: Якщо ви хочете переглянути деталі підключення, натисніть кнопку ▶ поруч із пунктом «Подробиці підключення», вона змінюється на ▼, і вікно з'єднання відображатиметься як одне з наступних:

source: As you can see, we are connecting to the same database server, each connection uses the same database on the server, but with different user.
es: Como se puede ver, estamos conectando al mismo servidor de base de datos, cada conexión utiliza la misma base de datos en el servidor, pero con diferente usuario.
ko: 보시는 것처럼 동일한 데이터베이스 서버에 연결하고 있으며, 각 연결은 서버에서 동일한 데이터베이스를 사용하지만 사용자는 다릅니다.
uk: Як бачимо, ми підключаємося до того ж сервера баз даних, кожен зв'язок використовує ту саму базу даних на сервері, але з іншим користувачем.

source: Thinking further about it
es: Pensándolo más
ko: 그것에 대해 더 깊이 생각하면서
uk: Думаю далі про це
