Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Searching allows you to view, browse and create reports from your data. You can perform searches by either entering the queries in the main search entry or by using the Query Builder to create the queries for you. The results of Ghini searches are listed in the main window.
es: Buscar le permite ver, navegar y crear informes a partir de los datos. Puede realizar búsquedas introduciendo las consultas en el formato principal de búsqueda o utilizando el generador de consultas para que cree las consultas para usted. Los resultados de las búsquedas de Ghini se enumeran en la ventana principal.
it: Ricerca permette di visualizzare, esplorare e creare rapporti dai dati. È possibile eseguire ricerche inserendo le query nella voce di ricerca principale o utilizzando il generatore di Query per creare le query per voi. I risultati delle ricerche di Ghini sono elencati nella finestra principale.
ko: 검색을 통해 데이터에서 보고서를 보고, 찾아보고, 만들 수 있습니다. 기본 검색 항목에 쿼리를 입력하거나 쿼리 작성기를 사용하여 쿼리를 만들어 검색을 수행할 수 있습니다. Ghini 검색 결과는 기본 창에 나열됩니다.
uk: Пошук дозволяє представляти, перегляд і створювати звіти з ваших даних. Ви можете виконувати пошук ввівши запит в основному компоненті пошуку або використати Query Builder для створення запитів. Результати пошуку Ghini виводяться в головному вікні.

source: Search Strategies
es: Estrategias de Búsqueda
it: Strategie di ricerca
ko: 검색 전략
uk: Стратегії пошуку

source: Ghini offers four distinct search strategies:
es: Ghini ofrece cuatro estrategias de búsqueda distinctas:
it: Ghini offre quattro strategie di ricerca distinte:
ko: Ghini는 다음과 같은 네 가지 검색 전략을 제공합니다:
uk: Ghini пропонує чотири різні стратегії пошуку:

source: by value — in all domains;
es: por valor — implícitamente en todos dominios;
it: per valore — in tutti i domini;
ko: 값 기준 — 모든 도메인에서;
uk: за значенням - у всіх доменах;

source: by expression — in a few implicit fields in one explicit domain;
es: por expresión — en unos campos implícitos de un dominio explícito;
it: per espressione — in alcuni campi impliciti in un dominio esplicito;
ko: 표현에 의해 — 하나의 명시적 도메인에 있는 몇 개의 암시적 필드에;
uk: за виразом - в декількох неявних полях в одній явній області;

source: by query — in one domain;
es: por query — en un sólo dominio;
it: per query — in un dominio;
ko: 쿼리 기준 - 하나의 도메인에서;
uk: за запитом - в одному домені;

source: by binomial name — only searches the Species domain.
es: por nombre binomial — busca solo el dominio Especies.
it: di nome binomiale — cerca solo nel dominio di ``Species``.
ko: 이항 이름 기준 - 종 도메인만 검색합니다.
uk: за біномічним ім'ям - пошук лише в домені Вид.

source: All search strategies —with the notable exception of the binomial name search— are case insensitive.
es: Todas estrategias de búsqueda, con la notable excepción de la búsqueda del nombre binomial: son minúsculas.
it: Tutte le strategie di ricerca —ad eccezione di ‘ricerca nome binomiale’— non fanno distinzione tra maiuscole e minuscole.
ko: 이항 이름 검색을 제외하고 모든 검색 전략은 대소문자를 구분하지 않습니다.
uk: Усі стратегії пошуку - за винятком пошуку біноміальних назв - нечутливі до регістру.

source: Search by Value
es: Búsqueda por valor
it: Ricerca per valore
ko: 값별 검색
uk: Пошук за значенням

source: Search by value is the simplest way to search. You enter one or more strings and see what matches. The result includes objects of any type (domain) where one or more of its fields contain one or more of the search strings.
es: Búsqueda por valor es la forma más sencilla de búsqueda. Ingrese una o más cadenas y ver qué partidos. El resultado incluye objetos de cualquier tipo (dominio) donde una o más de sus campos contienen uno o más de las cadenas de búsqueda.
it: Ricerca per valore è il modo più semplice per la ricerca. Immettere una o più stringhe e vedere che cosa corrisponde. Il risultato include oggetti di qualsiasi tipo (dominio), dove uno o più dei relativi campi contengono uno o più delle stringhe di ricerca.
ko: 값으로 검색하는 것이 가장 간단한 방법입니다. 하나 이상의 문자열을 입력하고 일치하는 항목을 확인합니다. 결과에는 하나 이상의 필드에 하나 이상의 검색 문자열이 포함된 모든 유형의 개체(도메인)가 포함됩니다.
uk: Пошук за значенням - це найпростіший спосіб пошуку. Ви вводите одне або декілька рядків і дізнаєтеся, які збіги. Результат включає об'єкти будь-якого типу (домену), де один або декілька його полів містять одне або кілька пошукових рядків.

source: You don't specify the search domain, all are included, nor do you indicate which fields you want to match, this is implicit in the search domain.
es: No se especifica el dominio de búsqueda, todos están incluidos, ni indica los campos que desea, esto está implícito en el dominio de búsqueda.
it: Non si specifica il dominio di ricerca, tutti sono inclusi, né è necessario indicare quali campi si desidera far corrispondere, questo è implicito nel dominio di ricerca.
ko: 검색 도메인을 지정하지 않고 모두 포함되며 일치시킬 필드를 표시하지 않습니다. 이 필드는 검색 도메인에 암시적입니다.
uk: Ви не вкажете пошуковий домен, всі вони включені, а також ви не вкажете, які поля потрібно підібрати, це неявно в пошуковому домені.

source: The following table helps you understand the results and guides you in formulating your searches.
es: La siguiente tabla ayuda a entender los resultados y te guía en la formulación de sus búsquedas.
it: Nella tabella seguente consente di comprendere i risultati e vi guida nel formulare le ricerche.
ko: 다음 표는 결과를 이해하는 데 도움이 되며 검색을 공식화하는 데 도움이 됩니다.
uk: Наступна таблиця допоможе вам зрозуміти результати та допоможе вам у формулюванні ваших пошуків.

source: search domain overview
es: Buscar dominio Resumen
it: Panoramica sui domini di ricerca
ko: 검색 도메인 개요
uk: огляд пошукового домену

source: name and shorthands
es: nombre y abreviaturas
it: nome ed abbreviazioni
ko: 이름과 속기
uk: ім'я та короткі терміни

source: field
es: campo
it: campo
ko: 밭을 갈다
uk: поле

source: result type
es: Tipo de resultado
it: tipo di risultato
ko: 결과형
uk: тип результату

source: name
es: nombre
ko: 이름을 짓다
uk: ім'я

source: Examples of searching by value would be: Maxillaria, Acanth, 2008.1234, 2003.2.1, indica.
es: Ejemplos de búsqueda por valor serían: Maxillaria, Acanth, 2008.1234, 2003.2.1, indica.
it: Esempi di ricerca per valore sarebbe: Maxillaria, Acanth, 2008.1234, 2003.2.1, indica.
ko: 값으로 검색하는 예로는 Maxillaria, Acanth, 2008.1234, 2003.2.1, indicata가 있습니다.
uk: Приклади пошуку за значенням будуть: Maxillaria, Acanth, 2008.1234, 2003.2.1,indica.

source: Unless explicitly quoted, spaces separate search strings. For example if you search for ``Block 10`` then Ghini will search for the strings Block and 10 and return all the results that match either of these strings. If you want to search for Block 10 as one whole string then you should quote the string like ``"Block 10"``.
es: A menos que explícitamente citado, espacios separan las cadenas de búsqueda. Por ejemplo, si usted busca '' bloque 10'' luego Ghini buscará las cadenas bloque y 10 y volver todos los resultados que coincidan con cualquiera de estas cadenas. Si desea buscar para bloque de 10 como una cadena entera entonces debe citar a la cadena como ""Block 10"''.
it: A meno di non includere fra virgolette, gli spazi separano le stringhe di ricerca. Per esempio se si cerca ``Block 10``, Ghini cerca le due stringhe ``blocco`` e ``10`` e restituisce tutti i risultati che corrispondono a una di queste due voci. Se si desidera cercare Block 10 come una stringa intera basterà usare le virgolette, così: ``"Block 10"``.
ko: 명시적으로 따옴표가 지정되지 않은 경우 공백은 검색 문자열을 구분합니다. 예를 들어 "Block 10"을 검색하면 Ghini는 Block 및 10 문자열을 검색하여 이 문자열 중 하나에 일치하는 결과를 모두 반환합니다. 블록 10을 하나의 전체 문자열로 검색하려면 "블록 10"과 같은 문자열을 따옴표로 묶어야 합니다.
uk: Рядок пошуку розділений пробілами. Наприклад, якщо ввести в рядок пошуку ``Block 10`` то Ghini буде шукати рядки Block і 10 та поверне всі результати, які відповідають цим рядкам. Якщо ви хочете знайти безроздільно Block 10 у рядку, то ви повинні ввести в рядок пошуку, як цитату ``"Block 10"``.

source: × Composite Primary Keys
es: × Claves primarias compuestas
it: × Chiavi primarie composte
ko: × 복합 기본 키
uk: × складні первинні ключі

source: A **species** epithet means little without the corresponding genus, likewise a **planting** code is unique only within the accession to which it belongs. In database theory terminology, epithet and code are not sufficient to form a **primary key** for respectively species and planting. These domains need a **composite** primary key.
es: Un epíteto de **especie** significa poco sin el género correspondiente, asimismo un código de **planta** es único solamente dentro de la accesión a la que pertenece. En la terminología de la teoría de la base de datos, epíteto y código no son suficientes para formar una **clave primaria** respectivamente para especies y planta. Estos dominios necesitan una **clave primaria compuesta**.
it: Un epiteto di **specie** significa poco senza il genere corrispondente, allo stesso modo un codice di **planting** è univoco solo nell'ambito dell'accessione a cui appartiene. Nella terminologia della teoria dei database, epiteto e codice non sono sufficienti per formare un **chiave primaria** per rispettivamente specie e le planting. Questi domini necessitano di una **chiave primaria composta**.
ko: **종*** 부호는 해당 속 없이 별 의미가 없으며, 마찬가지로 **식물* 코드는 해당 부호가 속한 등록 내에서만 고유하다. 데이터베이스 이론 용어에서, 각 종과 식물에 대해 **기본 키***를 구성하기에는 상피와 코드가 충분하지 않다. 이러한 도메인에는 **복합** 기본 키가 필요합니다.
uk: Епітет **вид** означає мало, без відповідного роду, також код **рослин** унікальний тільки в рамках приєднання, до якого вони належать. У теорії термінологія бази даних, епітету і коду недостатньо для формування **первинного ключа** для відповідних видів та посадок. Ці домени потребують первинного ключа **composite**.

source: Search by value lets you look for **plantings** by their complete planting code, which includes the accession code. Taken together, Accession code and Planting code do provide a **composite primary key** for plantings. For **species**, we have introduced the binomial search, described below.
es: Búsqueda por valor le permite buscar **plantas** por su código de planta completo, que incluye el código de la accesión. Tomados en conjunto, código de accesión y código de planta forman una **clave primaria compuesta** para plantas. Para **especies**, hemos introducido la búsqueda binomial, que se describe a continuación.
it: Ricerca per valore consente di cercare **planting** dal loro codice planting completo, che include il codice di accessione. Presi insieme, il codice di accessione e la piantatura del codice forniscono uns **chiave primaria composito** per gli planting. Per **specie**, abbiamo introdotto la ricerca binomiale, descritta di seguito.
ko: 값으로 검색하면 등록 코드가 포함된 전체 심기 코드로 **심기**를 찾을 수 있습니다. 등록 코드와 식재 코드는 식물에 **복합 기본 키**를 제공합니다. **종**의 경우 아래에 설명된 이항 검색을 도입했습니다.
uk: Пошук по значеннях дозволяє шукати **посадки** за їх повним кодом посадки, який включає код приєднання. Взагалі, код приєднання та код посадки забезпечують **складний первинний ключ** для посадок. Для **виду** ми представили біноміальний пошук, описаний нижче.

source: Search by Expression
es: Búsqueda por la expresión
it: Ricerca per espressione
ko: 식을 기준으로 검색
uk: Пошук за виразом

source: Searching with expression gives you a little more control over what you are searching for. You narrow the search down to a specific domain, the software defines which fields to search within the domain you specified.
es: Búsqueda con expresión le da un poco más control sobre lo que está buscando. Usted restringe la búsqueda a un dominio específico, el software define los campos de búsqueda dentro del dominio especificado.
it: Ricerca per espressione vi dà un po' più controllo su ciò che stai cercando. Permette di restringere la ricerca ad un dominio specifico, il software definisce i campi per la ricerca all'interno del dominio indicato.
ko: 식을 사용하여 검색하면 검색 중인 항목을 조금 더 제어할 수 있습니다. 검색 범위를 특정 도메인으로 좁히면 소프트웨어는 지정한 도메인 내에서 검색할 필드를 정의합니다.
uk: Пошук за допомогою виразу дає вам трохи більше контролю над тим, що ви шукаєте. Ви обмежуєте пошук до певного домену, програмне забезпечення визначає, які поля потрібно шукати в зазначеному вами домені.

source: An expression is built as ``<domain> <operator> <value>``. For example the search: ``gen=Maxillaria`` would return all the genera that match the name Maxillaria. In this case the domain is ``gen``, the operator is ``=`` and the value is ``Maxillaria``.
es: Una expresión se construye como ``<domain> <operator> <value>``. Por ejemplo la búsqueda: ``gen = Maxillaria`` devuelve todos los géneros que coinciden con el nombre Maxillaria. En este caso el dominio es ``gen``, el operador es ``=`` y el valor es ``Maxillaria``.
it: Un'espressione è costruita come ``<domain> <operator> <value>``. Ad esempio la ricerca: ``gen = Maxillaria`` restituisce tutti i generi che corrispondono al nome Maxillaria. In questo caso il dominio è ``gen``, l'operatore è ``=`` e il valore è ``Maxillaria``.
ko: 식은 "<domain> <operator> <value>"로 작성됩니다. 예를 들어 "gen=Maxillaria"를 검색하면 Maxillaria라는 이름에 일치하는 모든 gen이 반환됩니다. 이 경우 도메인은 ''gen², 연산자는 ''=maxilaria', 값은 ''Maxillaria'"이다.
uk: Вираз будується як ``<domain> <operator> <value>``. Наприклад, пошук: ``gen=Maxillaria`` поверне усі роди, які відповідають імені Maxillaria. У цьому випадку домен ``gen``, оператор ``=`` і значення ``Maxillaria``.

source: The above search domain overview table tells you the names of the search domains, and, per search domain, which fields are searched.
es: La tabla resumen búsqueda dominio te dice los nombres de los dominios de búsqueda, y por el dominio de búsqueda, los campos que se buscan.
it: La tabella *Panoramica sui domini di ricerca* poco sopra ti indica i nomi dei domini di ricerca, e, per ogni dominio di ricerca, quali campi vengono inclusi implicitamente nelle ricerche.
ko: 위의 검색 도메인 개요 표는 검색 도메인의 이름 및 검색 도메인별로 검색되는 필드를 알려줍니다.
uk: У наведеній вище таблиці огляду пошукових доменів вказані імена пошукових доменів, а також для кожного пошукового домену, які поля шукаються.

source: The search string ``loc like block%`` would return all the Locations for which name or code start with "block". In this case the domain is ``loc`` (a shorthand for ``location``), the operator is ``like`` (this comes from SQL and allows for "fuzzy" searching), the value is ``block%``, the implicitly matched fields are ``name`` and ``code``. The percent sign is used as a wild card so if you search for ``block%`` then it searches for all values that start with ``block``. If you search for ``%10`` it searches for all values that end in ``10``. The string ``%ck%10`` would search for all value that contain ``ck`` and end in ``10``.
es: La cadena de búsqueda ``loc like block%`` devolverá todas las ubicaciones cuyo nombre o código comience en "block". En este caso el dominio es ``loc`` (una abreviatura para ``location``), el operador es ``like`` (esto viene del SQL y permite buscar "fuzzy"), el valor es ``block%``, los campos implícitamente examinados son ``name`` y ``code``. El signo de porcentaje es utilizado como comodín por lo que si se busca ``block%`` se encontrarán todos los valores que comienzan con ``block``. Si usted busca ``%10``, busca todos los valores que terminan en ``10``. La cadena ``%ck%10`` busca todos los valores que contienen ``ck`` y acaban en ``10``.
it: La stringa di ricerca ``loc like blocco%`` restituisce tutte le collocazioni il cui nome o codice inizia con "blocco". In questo caso il dominio è ``loc`` (un'abbreviazione per ``location``), l'operatore è ``like`` (questo viene dall'SQL ed aggiunge un fattore di approssimazione nella ricerca), il valore è ``blocco%``, i campi di ricerca sono implicitamente ``nome`` e ``codice``. Il segno di percentuale viene utilizzato come jolly, pertanto se si cerca ``max%`` ricercherà tutti i valori che iniziano con "max". Se si cerca ``%10`` ricerca per tutti i valori che terminano in ``10``. La stringa ``%ck%10`` indica la ricerca di tutto ciò che contenga ``ck`` e termini in ``10``.
ko: 검색 문자열 "loc like block%"는 이름 또는 코드가 "block"으로 시작하는 모든 위치를 반환합니다. 이 경우 도메인이 ''loc''('위치'의 약자)이고, 연산자는 ''like''(이것은 SQL에서 왔으며 'fuzzy' 검색을 허용한다)이며, 값은 암시적으로 일치하는 필드가 "name"과 "code"인 경우 "block%"이다. 백분율 기호는 와일드카드로 사용되므로 ''블록%''를 검색하면 ''블록''으로 시작하는 모든 값을 검색합니다. "%10"을 검색하면 "10"으로 끝나는 모든 값을 검색합니다. "%ck%10"이라는 문자열은 "ck"가 포함된 모든 값을 검색하여 "10"으로 끝난다.
uk: Рядок пошуку ``loc like block%`` повертає всі місця, для яких ім'я або код починається з "block". У цьому випадку домен є ``loc`` (скорочення для ``location``), оператор є ``like`` (це походить з SQL і дозволяє "fuzzy" пошук) значення є ``block%``, поля, що неявно співпадають ``ім'я`` і ``код``. Знак відсотка використовується як динамічна карта, тому якщо ви шукаєте ``block%``, то він шукає всі значення, що починаються з ``block``. Якщо ви шукаєте ``%10``, він шукає всі значення, які закінчуються ``10``. Рядок ``%ck%10`` буде шукати всі значення, яке містить ``ck`` і закінчується на ``10``.

source: When a query takes ages to complete
es: Cuando una consulta toma edades para completar
it: Quando una query richiede molto tempo per completare
ko: 쿼리를 완료하는 데 시간이 오래 걸리는 경우
uk: Скільки часу потрібно на запит

source: You give a query, it takes time to compute, the result contains unreasonably many entries. This happens when you intend to use a strategy, but your strings do not form a valid expression. In this case Ghini falls back to *search by value*. For example the search string ``gen lik maxillaria`` will search for the strings ``gen``, ``lik``, and ``maxillaria``, returning all that match at least one of the three criteria.
es: Dar una consulta, se necesita tiempo para calcular, el resultado contiene injustificadamente muchas entradas. Esto sucede cuando desea utilizar una estrategia, pero las cadenas no forman una expresión válida. En este caso Ghini cae de nuevo a * búsqueda por valor *. Por ejemplo la cadena de búsqueda '' gen lik maxillaria'' buscará la cadenas '' gen'', '' como '' y '' maxillaria'', devolver todo lo que coincida con al menos uno de los tres criterios.
it: Si dà una query, ci vuole davvero tempo per calcolare il risultato e questo contiene una quantità irragionevolmente di voci. Questo accade quando si intende utilizzare una strategia, ma le stringhe inserite non formano un'espressione valida. In questo caso Ghini ricorre al caso *ricerca per valore*. Ad esempio, la stringa di ricerca ``gen lik maxillaria`` cercherà le stringhe ``gen``, ``lik`` e ``maxillaria``, restituendo tutto ciò che soddisfi almeno uno dei tre criteri.
ko: 쿼리를 제공하고 계산하는 데 시간이 걸리며 결과에 너무 많은 항목이 포함되어 있습니다. 이 문제는 전략을 사용하려고 하지만 문자열이 올바른 식을 형성하지 않을 때 발생합니다. 이 경우 Ghini는 *값별 검색*으로 돌아갑니다. 예를 들어 검색 문자열인 "gen like maxillaria"는 "gen", "lik", "maxillaria" 중 적어도 세 가지 기준 중 하나와 일치하는 모든 문자열을 검색하게 된다.
uk: Ви даєте запит, це вимагає часу для обчислення, результат містить необґрунтовано багато записів. Це трапляється, коли ви маєте намір використати стратегію, але ваші рядки не утворюють дійсного виразу. У цьому випадку Ghini повертається до *пошуку за значенням*. Наприклад, рядок пошуку ``gen lik maxillaria`` буде шукати рядки ``gen``, ``lik`` і ``maxillaria``, повертаючи всі, що відповідають хоча б одному з трьох критеріїв.

source: Binomial search
es: Búsqueda de binomio
it: Ricerca binomiale
ko: 이항 검색
uk: Біноміальний пошук

source: You can also perform a search in the database if you know the species, just by placing a few initial letters of genus and species epithets in the search engine, correctly capitalized, i.e.: **Genus epithet** with one leading capital letter, **Species epithet** all lowercase.
es: También puede realizar una búsqueda en la base de datos si sabes la especie, simplemente colocando unas letras iniciales del género y especie epítetos en el motor de búsqueda correctamente capitalizado, es decir: ** género epíteto ** con una letra capital principal, ** especie epíteto ** todo en minusculas.
it: È inoltre possibile eseguire una ricerca nel database, se si conosce la specie, semplicemente inserendo alcune lettere iniziali di epiteti di genere e la specie nel motore di ricerca, in maiuscolo correttamente, vale a dire: **genere epiteto** con una lettere maiuscole iniziali, **specie epiteto** tutte le lettere minuscole.
ko: 또한 해당 종을 알고 있는 경우 검색 엔진에 몇 개의 초기 문자(예: 대문자 표시)를 올바르게 배치하면 데이터베이스에서 검색을 수행할 수 있습니다. **Genus spitm**의 대문자 **종류 spitm* 모두 소문자입니다.
uk: Ви також можете виконати пошук у базі даних, якщо ви знаєте цей вид, просто розмістивши в пошуковій системі декілька початкових букв епітетів роду та виду, правильно надруковані, тобто: **Епітет роду** з однією заголовною великою буквою, **Епітет видів ** всі літери.

source: This way you can perform the search ``So ha``.
es: De esta manera usted puede realizar la búsqueda '' así ha''.
it: In questo modo è possibile eseguire la ricerca ``So ha``.
ko: 이렇게 하면 "소하" 검색을 수행할 수 있습니다.
uk: Таким чином ви можете виконати пошук ``So ha``.

source: These would be the initials for Solanum hayesii, or Solanum havanense.
es: Estos serían las iniciales de Solanum hayesii, o Solanum havanense.
it: Queste sarebbero le iniziali per il Solanum hayesii, o Solanum havanense.
ko: 이것은 Solanum hayesii 또는 Solanum havanense의 이니셜이 될 것이다.
uk: Це були б ініціали для Solanum hayesii, або Solanum havanense.

source: Binomial search comes to compensate the limited usefulness of the above search by expression when trying to look for a species.
es: La búsqueda de binomio viene a compensar la limitada utilidad de la búsqueda anterior por la expresión cuando se trata de buscar una especie.
it: Ricerca nome binomiale viene a compensare la limitata utilità della succitata ricerca per espressione quando si tenta di cercare una specie.
ko: 이항 검색은 종을 검색하려고 할 때 표현으로 위의 검색의 제한된 유용성을 보상하기 위해 제공됩니다.
uk: Біноміальний пошук приходить до компенсації обмеженої корисності вищезгаданого пошуку за виразом при спробі шукати вид.

source: It is the correct capitalization **Xxxx xxxx** that informs the software of your intention to perform a binomial search. The software's second guess will be a search by value, which will possibly result in far more matches than you had expected.
es: Es la capitalización correcta ** Xxxx xxxx ** que informa el software de su intención de realizar una búsqueda de binomio. Guess segundo del software será una búsqueda por valor, que posiblemente resultará en más partidos que había esperado.
it: È la lettera maiuscola corretta **Xxxx xxxx** che informa il software della vostra intenzione di eseguire una ricerca binomiale. Seconda ipotesi del software sarà una ricerca per valore, che possibilmente si tradurrà in molti più risultati del previsto.
ko: 이항 검색을 수행할 의도를 소프트웨어에 알려주는 올바른 대문자로 **Xxxxxx**입니다. 소프트웨어의 두 번째 추측은 값별 검색으로, 예상한 것보다 훨씬 더 많은 일치 항목이 발생할 수 있습니다.
uk: Це правильна капіталізація **Xxxx xxxx **, яка інформує програмне забезпечення про свій намір виконувати пошук у біноміалі. Друга помилка програмного забезпечення - пошук за значенням, що, можливо, призведе до набагато більшої кількості значень, ніж ви очікували.

source: The similar request ``so ha`` will return, in a fresh install, over 3000 objects, starting at Family "Acalyp(**ha**)ceae", ending at Geography "Western (**So**)uth America".
es: La solicitud similar '' por lo que ha'' volverá de nuevo, en una instalación nueva, más de 3000 objetos, empezando por la familia "Acalyp(**ha**)ceae", y terminando en geografía "Western (** para **) uth America".
it: La richiesta affatto simile ``so ha`` restituisce, in una nuova installazione, oltre 3000 oggetti, a partire da famiglia "Acalyp(**ha**)ceae", per finire con la geografia "Western (**So**)uth America".
ko: 비슷한 요청인 "소하"는 "Acalyp (**ha***)ceae"에서 시작하여 지리 "서양 (*****)남미"에서 끝나는 3000개 이상의 객체로 새로 설치될 것이다.
uk: Аналогічний запит ``so ha`` поверне в новій установці понад 3000 об'єктів, починаючи з сім'ї "Acalyp(**ha**)ceae", закінчуючи географією "Western (**So**)uth America".

source: Search by Query
es: Buscar por consulta
it: Ricerca per Query
ko: 조회별 검색
uk: Пошук по запиту
