Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: The ``dist`` folder will now contain a full working copy of the software in a frozen, self contained state, that can be transferred however you like and will work in place. (e.g. placed on a USB flash drive for demonstration purposes or copied manually to ``C:\Program Files`` with a shortcut created on the desktop). To start ghini.desktop double click ``ghini.exe`` in explorer (or create a shortcut to it). If you have issues with the UI not displaying correctly you need to run the script ``win_gtk.bat`` from the ``dist`` folder to set up paths to the GTK components correctly. (Running ``build_win /e`` will place this script in the dist folder for you or you can copy it from the ``scripts`` folder yourself.) You will only need to run this once each time the location of the folder changes. Thereafter ``ghini.exe`` will run as expected.
uk: Папка ``dist`` тепер міститиме повну робочу копію програмного забезпечення у замороженому, автономному стані, який може бути розміщений, як вам подобається і буде працювати на місці. (наприклад, розміщено на флеш-пам'ять USB для демонстраційних цілей або скопійовано вручну в ``C:\Program Files`` за допомогою ярлика, створеного на робочому столі). Щоб запустити ghini.desktop, двічі клацніть ``ghini.exe`` у провіднику (або створіть ярлик для нього). Якщо у вас виникли проблеми з тим, що користувацький інтерфейс не відображається правильно, вам слід запустити скрипт ``win_gtk.bat`` з папки ``dist`` для правильного налаштування шляхів до компонентів GTK. (Запуск ``build_win / e`` помістить цей скрипт у папку dist для себе або ви можете скопіювати його з папки ``scripts`` самі.) Вам потрібно буде запускати це лише один раз при кожній зміні розташування папки. Після цього ``ghini.exe`` буде працювати, як очікувалося.

source: This should leave a file named ``ghini.desktop-<version>-setup.exe`` in the ``scripts`` folder. This is your Windows installer.
uk: Слід залишити файл з іменем ``ghini.desktop-<version>-setup.exe`` в папці ``scripts``. Це ваш інсталятор Windows.

source: If you're using Ghini, or if you feel like helping its development anyway, please consider `donating <https://pledgie.com/campaigns/29188>`_
es: Si usted utiliza Ghini, o si le parece poder apoyar su desarrollo, por favor considere una `donación <https://pledgie.com/campaigns/29188>`_
it: Se utilizzi Ghini, o se ti sembra giusto aiutarne lo sviluppo, puoi considerare una `donazione <https://pledgie.com/campaigns/29188>`_
uk: Якщо ви використовуєте Ghini, або якщо ви хочете допомогти її розвитку, будь ласка, розгляньте питання `пожертвування <https://pledgie.com/campaigns/29188>`_

source: Query Grammar
es: Gramática de consulta
it: Grammatica delle Query
uk: Граматика запиту

source: Stream role description
es: Flujos de datos y sus relevancias

source: tell the world about it: on facebook, the google group, linkedin, ...
es: decirle al mundo acerca de él: en facebook, el grupo de google, linkedin,...
it: raccontare al mondo: su facebook, il gruppo google, linkedin,...

source: *Synonyms* allow you to add other families that are synonyms with the family you are currently editing. To add a new synonyms type in a family name in the entry. You must select a family name from the list of completions. Once you have selcted a family name that you want to add as a synonym click on the Add button next to the synonym list and the software adds the selected synonym to the list. To remove a synonym, select the synonym from the list and click on the Remove button.
es: *Sinónimos* permite añadir familias que sean sinónimo de la familia que estás editando. Para añadir un nuevo sinónimo, escriba el nombre de la familia en el campo. Es necesario seleccionar un nombre de la lista. Cuando se haya seleccionado el nombre de la familia que es un sinónimo, presionar *añadir*. Para eliminar una sinonimía, seleccionar el sinónimo de la lista y activar la tecla Remove.
it: *Sinonimi* consente di aggiungere altre famiglie che sono sinonimi con la famiglia che si sta modificando. Per aggiungere un nuovo sinonimo iniziare a scriverne il nome nella voce *sinonimi*. È necessario selezionare un nome di famiglia dalla lista dei completamenti. Una volta che hai selezionato un nome di famiglia che si desidera aggiungere come sinonimo, fare clic sul pulsante Aggiungi accanto all'elenco sinonimi e il software aggiunge il sinonimo selezionato all'elenco. Per rimuovere un sinonimo, selezionarlo nell'elenco e fare clic sul pulsante Rimuovi.

source: *Synonyms* allow you to add other genera that are synonyms with the genus you are currently editing. To add a new synonyms type in a genus name in the entry. You must select a genus name from the list of completions. Once you have selcted a genus name that you want to add as a synonym click on the Add button next to the synonym list and it will add the selected synonym to the list. To remove a synonym select the synonym from the list and click on the Remove button.
es: *Sinónimos* le permite añadir otros géneros que son sinónimos del género que esté editando. Para agregar un nuevo sinónimo escriba un nombre de género. Debe seleccionar un género de la lista. Una vez haya seleccionado el nombre del género que desea agregar, pulse sobre el botón Añadir que se encuentra junto a la lista de sinónimos y se agregará a la lista el sinónimo seleccionado. Para eliminar un sinónimo, selecciónelo de la lista y pulse el botón Borrar.
it: * Sinonimi * consentono di aggiungere altri generi che sono sinonimi con il genere che si sta modificando. Per aggiungere un nuovo tipo di sinonimi in un nome di genere nella voce. È necessario selezionare un nome di genere dall'elenco dei completamenti. Una volta che hai selcted un nome del genere che si desidera aggiungere come sinonimo, fare clic sul pulsante Aggiungi accanto all'elenco sinonimo e aggiungerà il sinonimo selezionato all'elenco. Per rimuovere un sinonimo selezionare il sinonimo dall'elenco e fare clic sul pulsante Rimuovi.

source: download the batch file you will use to stay up-to-date with the production line you chose to follow:
es: descargue también el archivo para poner al día su instalación::
it: scaricare il file di batch che si utilizzerà per rimanere sempre aggiornati con la linea di produzione che si è scelto di seguire:

source: if you are on a recent Ghini installation, each time you start the program, Ghini will check on the development site and alert you of any newer ghini release within your chosen production line.
es: si está utilizando una versión suficientemente nueva, al arrancar el programa, ese averiguerá si hay una versión más recién en el repositorio central.
it: Se siete su una recente installazione di Ghini, ogni volta che si avvia il programma, Ghini controllerà sul sito di sviluppo e avviso di qualsiasi più recenti ghini rilasciare entro la linea di produzione selezionata.

source: A database without exporting facilities is of little use. Ghini lets you export your data in table format (open them in your spreadsheet editor of choice), as labels (to be printed or engraved), as html pages or pdf or postscript documents.
es: Una base de datos sin exportar servicios es de poca utilidad. Ghini le permite exportar los datos en formato de tabla (abrirlos en su editor de hoja de cálculo de la opción), como etiquetas (para ser impreso o grabado), como páginas html o documentos pdf o postscript.
it: Un database senza esportare strutture è di scarsa utilità. Ghini consente di esportare i dati in formato tabella (aprirli nel vostro editor di fogli di calcolo di scelta), come le etichette (per essere stampata o incisa), come pagine html o documenti pdf o postscript.

source: This page describes the two tools Ghini offers for these tasks.
es: Esta página describe las dos herramientas que Ghini ofrece para estas tareas.
it: Questa pagina descrive i due strumenti che Ghini offre per queste attività.

source: Please refer to the official documentation. A very thorough discussion of your backup options starts at `chapter_24`_.
it: Prego riferirsi alla documentazione ufficiale. Una dettagliata discussione sulle varie opzioni di backup inizia al `capitolo 24 <http://www.postgresql.org/docs/9.1/static/backup.html>`_.

source: The Ghini User's Plugin will allow you to create and manage the permissions of users for your Ghini database.
it: Plugin Ghini per la gestione utenti vi permetterà di creare e gestire le autorizzazioni degli utenti per il database di Ghini.
