Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: please use the ``publish.sh`` script, in the ``scritps`` directory. This one takes care of every single step, and produces recognizable commit comments, it publishes the release on pypi, and in perspective it will contain all steps for producing a ``deb`` file, and a windows executable.
ko: ``scritps ''디렉토리에있는``publish.sh ''스크립트를 사용하십시오. 이것은 모든 단일 단계를 처리하고 인식 가능한 커밋 주석을 생성하고 pypi에 릴리스를 게시하며 관점에서``deb ''파일 및 Windows 실행 파일을 생성하는 모든 단계를 포함합니다.

source: you can also do this by hand:
ko: 이 작업을 직접 수행 할 수도 있습니다.:
uk: Ви також можете це зробити вручну:

source: open the pull request page using as base a production line ``ghini-x.y``, compared to ``ghini-x.y-dev``.
es: abrir el tirón solicitud página usando como base una cadena de producción '' ghini-x.y'', en comparación con '' ghini-x.y-dev''.
it: Aprire il pull richiesta pagina utilizzando come base una linea di produzione ``ghini-x.y``, rispetto al ``ghini-x.y-dev``.
ko: ``ghini-x.y-dev ''와 비교하여``ghini-x.y ''생산 라인을 기본으로 사용하여 풀 요청 페이지를 엽니 다.
uk: відкрийте сторінку запиту, використовуючи як основу виробничу лінію ``ghini-x.y`` у порівнянні з ``ghini-x.y-dev``.

source: make sure a ``bump`` commit is included in the differences.
es: Asegúrese de que confirmar '' bache '' está incluido en las diferencias.
it: Assicurarsi che un commit ``bump`` è incluso nelle differenze.
ko: 차이점에``범프 ''커밋이 포함되어 있는지 확인하십시오.
uk: переконайтеся що ``bump`` фіксація включена в розбіжностях.

source: it should be possible to automatically merge the branches.
es: debe ser posible fusionar automáticamente las ramas.
it: dovrebbe essere possibile unire automaticamente i rami.
ko: 분기를 자동으로 병합 할 수 있어야합니다.
uk: повинна бути забезпечена можливість автоматичного злиття гілок.

source: create the new pull request, call it as “publish to the production line”.
es: crear la nueva solicitud de extracción, lo llaman como "publicar en la línea de producción".
it: creare la nuova richiesta di pull, lo chiamano come "pubblica la linea di produzione".
ko: 새로운 풀 리퀘스트를 생성하고이를 "생산 라인에 게시"라고합니다.
uk: створити новий пул запиту, викличте його як “publish to the production line”.

source: you possibly need wait for travis-ci to perform the checks.
es: posiblemente necesita esperar para que travis-ci realizar los controles.
it: Forse devi aspettare per travis-ci eseguire i controlli.
ko: travis-ci가 검사를 수행 할 때까지 기다려야 할 수도 있습니다.
uk: вам, можливо, буде потрібно почекати travis-ci для виконання перевірки.

source: merge the changes.
es: combinar los cambios.
it: unire le modifiche.
ko: 변경 사항을 병합하십시오.
uk: об'єднати зміни.

source: don't forget to tell the world about the new release: on `facebook <https://www.facebook.com/bauble.thesoftware/>`_, the `google group <https://groups.google.com/forum/#!forum/bauble>`_, in any relevant linkedin group, and on `our web page <http://ghini.github.io/>`_.
ko: 새로운 릴리스에 대해 전 세계에 알리는 것을 잊지 마십시오.`facebook <https://www.facebook.com/bauble.thesoftware/>`_,`google 그룹 <https://groups.google.com/ forum / #! forum / bauble>`_, 관련 링크드 인 그룹 및`우리 웹 페이지 <http://ghini.github.io/>`_.
uk: не забудьте розповісти світові про новий випуск: на facebook <https://www.facebook.com/bauble.thesoftware/>`_, the `google group <https://groups.google.com/forum/#!forum/bauble>`_, у будь-якій відповідній пов'язаній групі на нашій веб-сторінці <http://ghini.github.io/>`_.

source: your own fork
es: su propio 'fork'
ko: 자신의 포크
uk: ваша власна гілка

source: If you want to keep your own fork of the project, keep in mind this is full force work in progress, so staying up to date will require some effort from your side.
es: Si desea mantener su propio fork del proyecto, tenga en cuenta que esto está en continuo progreso, por lo que mantenerse actualizado requerirá algún esfuerzo de su parte.
ko: 자신의 프로젝트 포크를 유지하고 싶다면 이것이 진행중인 작업이므로 최신 정보를 유지하려면 약간의 노력이 필요합니다.
uk: Якщо ви хочете зберегти власну гілку проекту, майте на увазі, що це робота в повну силу над результатом, і щоб бути в курсі, потрібні певні зусилля з вашої сторони.

source: The best way to keep your own fork is to focus on some specific issue, work relatively quickly, often open pull requests for your work, make sure that you get it accepted. Just follow Ghini's coding style, write unit tests, concise and abundant, and there should be no problem in having your work included in Ghini's upstream.
es: La mejor manera de mantener el propio 'fork' consiste en enfocarse en algún tema específico, trabajar relativamente rápido, a menudo abrir solicitudes de 'pull' para su trabajo, y asegurarse que sea aceptado. Sólo siga el estilo de programación de Ghini, añada pruebas unitarias, concisas y abundantes, y no habrá ningún problema en ver su trabajo incluido en Ghini.
ko: 자신의 포크를 유지하는 가장 좋은 방법은 특정 문제에 집중하고, 비교적 빠르게 작업하고, 종종 작업에 대한 풀 요청을 열고, 수락했는지 확인하는 것입니다. Ghini의 코딩 스타일을 따르고 단위 테스트를 작성하고 간결하고 풍부하며 Ghini의 업스트림에 작업을 포함시키는 데 문제가 없을 것입니다.
uk: Найкращий спосіб зберегти власну гілку полягає в тому, щоб сфокусуватися на певній конкретній проблемі, часто відкривають тягові запити для вашої роботи, переконайтеся, що ви це приймаєте. Просто дотримуйтесь стилю кодування Ghini, пишіть одиничні тести, лаконічні та ясні, і не повинно бути ніяких проблем в тому, щоб ваша робота була включена до Ghini.

source: If your fork got out of sync with Ghini's upstream: read, understand, follow the github guides `configuring a remote for a fork <https://help.github.com/articles/configuring-a-remote-for-a-fork/>`_ and `syncing a fork <https://help.github.com/articles/syncing-a-fork/>`_.
es: Si su *fork* se puso fuera de sincronización con Ghini de upstream: leer, entender, seguir el guía de github sobre `configurar los remotos <https://help.github.com/articles/configuring-a-remote-for-a-fork/>`_ y `como sincronizar <https://help.github.com/articles/syncing-a-fork/>`_.
ko: 포크가 Ghini의 업스트림과 동기화되지 않은 경우 : 읽고 이해하고 github 가이드`포크 용 원격 구성 <https://help.github.com/articles/configuring-a-remote-for-a-fork />`_ 및`포크 동기화 <https://help.github.com/articles/syncing-a-fork/>`_.
uk: Якщо гілка вийшла з синхронізації з Ghini вгору: читати, зрозуміти, слідкувати за github довідниками `configuring a remote for a fork <https://help.github.com/articles/configuring-a-remote-for-a-fork/>`_ і `syncing a fork <https://help.github.com/articles/syncing-a-fork/>`_.

source: closing step
es: paso final
it: Fase di
ko: 마감 단계
uk: крок закриття

source: review this workflow. consider this as a guideline, to yourself and to your colleagues. please help make it better and matching the practice.
es: revisar el flujo de trabajo. considerar esto como una guía, a ti y a tus compañeros. por favor, ayudar a hacer mejor y coincidencia de la práctica.
it: Scrivi una recensione su questo flusso di lavoro. considerare questo come una linea guida, a voi stessi e ai vostri colleghi. si prega di contribuire a rendere migliore e la pratica di corrispondenza.
ko: 이 워크 플로우를 검토하십시오. 이것을 자신과 동료에게 지침으로 고려하십시오. 더 좋게 만들고 연습과 일치하도록 도와주세요.
uk: розглянути цей робочий процес. розглядати це в якості орієнтира, до себе і до своїх колег. будь ласка, допоможіть зробити його краще і відповідно практичним.

source: Distributing ghini.desktop
ko: ghini.desktop 배포

source: Python Package Index - PyPI
ko: Python 패키지 색인-PyPI

source: This is not much mentioned, but we keep ghini.desktop on the Python Package Index, so you could install it by no more than::
ko: 별로 언급되지는 않았지만 Python 패키지 색인에 ghini.desktop을 보관하므로 다음과 같은 방법으로 설치할 수 있습니다::

source: There are a couple packages that can't be installed with ``pip``, but otherwise that's really all you need to type, and it's platform independent.
ko: ``pip ''로 설치할 수없는 몇 가지 패키지가 있지만 그렇지 않으면 입력해야 할 모든 것이 있으며 플랫폼에 독립적입니다.

source: Publishing on PyPI is a standard ``setup`` command::
ko: PyPI에 게시하는 것은 표준``setup ''명령입니다:

source: Windows
ko: 윈도우

source: For building a Windows installer or executable you need a running Windows system. The methods described here has been used successfully on Windows 7, 8 and 10. Windows Vista should also work but has not been tested.
ko: Windows 설치 프로그램 또는 실행 파일을 빌드하려면 실행중인 Windows 시스템이 필요합니다. 여기에 설명 된 방법은 Windows 7, 8 및 10에서 성공적으로 사용되었습니다. Windows Vista도 작동해야하지만 테스트를 거치지는 않았습니다.

source: If you are on GNU/Linux, or on OSX, you are not interested in the remainder of this section. None of Ghini's contributors knows how to produce a Windows installer without having a Windows system.
ko: GNU / Linux 또는 OSX를 사용하는 경우이 섹션의 나머지 부분에 관심이 없습니다. Ghini의 기여자 중 누구도 Windows 시스템없이 Windows 설치 프로그램을 만드는 방법을 모릅니다.

source: The goal of the present instructions is to help you produce a Windows installer, that is a single executable that you can run on any Windows workstation and that will install a specific version of ghini.desktop. This is achieved with the NSIS script-driven installer authoring tool.
ko: 현재 지침의 목표는 모든 Windows 워크 스테이션에서 실행할 수 있고 특정 버전의 ghini.desktop을 설치하는 단일 실행 파일 인 Windows 설치 프로그램을 생성하는 데 도움을주는 것입니다. 이는 NSIS 스크립트 기반 설치 프로그램 저작 도구를 통해 이루어집니다.

source: As a side product of the installer production, you will have a massive but relocatable directory, which you can copy to a USB drive and which will let you use the software without needing an installation.
ko: 설치 프로그램 프로덕션의 부수적 인 제품으로, USB 드라이브에 복사 할 수 있고 설치할 필요없이 소프트웨어를 사용할 수있는 대규모이지만 재배치 가능한 디렉토리가 있습니다.

source: The files and directories relevant to this section:
ko: 이 섹션과 관련된 파일 및 디렉토리 :

source: ``scripts/build-win.bat`` — the single batch script to run.
ko: ``scripts / build-win.bat`` — 실행할 단일 배치 스크립트입니다.

source: ``setup.py`` — implements the NSIS and py2exe commands.
ko: ``setup.py ''— NSIS 및 py2exe 명령을 구현합니다.

source: ``scripts/build-multiuser.nsi`` — the nsis script, used by the above.
ko: ``scripts / build-multiuser.nsi ''— 위에서 사용 된 nsis 스크립트.

source: ``nsis/`` — contains redistributable NSIS files, put here for conveniency.
ko: ``nsis /``— 재배포 가능한 NSIS 파일을 포함하며 편의를 위해 여기에 넣습니다.

source: ``ghini-runtime/`` — built by ``py2exe``, used by ``nsis``.
ko: ``ghini-runtime /``—``py2exe``에 의해 빌드되고``nsis``에 사용됩니다.

source: ``dist/`` — receives the executable installation file.
ko: ``dist /``— 실행 가능한 설치 파일을받습니다.

source: Most steps are automated in the ``build-win.bat`` script. Installation of a few tools needs to be done manually:
ko: 대부분의 단계는``build-win.bat`` 스크립트에서 자동화됩니다. 몇 가지 도구를 수동으로 설치해야합니다:

source: Download and install Git, Python 2.7 and PyGTK.
ko: Git, Python 2.7 및 PyGTK를 다운로드하여 설치합니다.

source: This is outlined in the ``devinstall``-based :ref:`installation` instructions.
ko: 이것은``devinstall ''기반 : ref :`installation` 지침에 설명되어 있습니다.

source: Download and install `NSIS v3 <http://nsis.sourceforge.net/Download>`_.
ko: `NSIS v3 <http://nsis.sourceforge.net/Download>`_를 다운로드하여 설치합니다.

source: A **reboot** is recommended.
ko: ** 재부팅 **이 권장됩니다.
uk: Рекомендується **перезавантажити**.

source: Clone the ghini.desktop repository.
ko: ghini.desktop 저장소를 복제합니다.

source: Use your own fork if you plan contributing patches, or the organization's repository ``https://github.com/Ghini/ghini.desktop.git`` if you only wish to follow development.
ko: 패치를 제공 할 계획이라면 자체 포크를 사용하고 개발 만 따르고 싶다면 조직의 저장소``https : // github.com / Ghini / ghini.desktop.git``을 사용하십시오.

source: Clone the repository from GitHub to wherever you want to keep it, and checkout a branch. Replace ``<path-to-keep-ghini>`` with the path of your choice, e.g. ``Local\github\Ghini\``. Production branch ``ghini-1.0`` is recommended as used in the example.
ko: GitHub에서 보관하려는 위치로 저장소를 복제하고 브랜치를 체크 아웃합니다. ``<path-to-keep-ghini>``를 선택한 경로로 바꾸십시오. ``로컬 \ github \ Ghini \``. 예제에 사용 된대로 프로덕션 브랜치``ghini-1.0 ''을 권장합니다.

source: To do this, open a command prompt and type these commands::
ko: 이렇게하려면 명령 프롬프트를 열고 다음 명령을 입력하십시오:

source: The result of the above is a complete development environment, on Windows, with NSIS. Use it to follow development, or to propose your pull requests, and to build Windows installers.
ko: 위의 결과는 Windows에서 NSIS를 사용하는 완전한 개발 환경입니다. 이를 사용하여 개발을 따르거나 풀 요청을 제안하고 Windows 설치 프로그램을 빌드하십시오.

source: All subsequent steps are automated in the ``scripts\build_win.bat`` script. Run it, and after a couple of minutes you should have a new ``dist\ghini.desktop-<version>-setup.exe`` file, and a working, complete relocatable directory named ``ghini-runtime``.
ko: 모든 후속 단계는``scripts \ build_win.bat`` 스크립트에서 자동화됩니다. 그것을 실행하고 몇 분 후에 새로운``dist \ ghini.desktop- <version> -setup.exe`` 파일과``ghini-runtime``이라는 이름의 작동하고 완전한 재배치 가능한 디렉토리가 있어야합니다.

source: Read the rest if you need details about the way the script works.
ko: 스크립트 작동 방식에 대한 세부 정보가 필요하면 나머지를 읽으십시오.

source: The ``build_win.bat`` script
ko: ``build_win.bat`` 스크립트

source: A batch file is available that can complete the last few steps. To use it use this command::
ko: 마지막 몇 단계를 완료 할 수있는 배치 파일을 사용할 수 있습니다. 이를 사용하려면 다음 명령을 사용하십시오::
uk: Доступний пакетний файл, який може завершити останні кілька кроків. Для його використання скористайтеся цією командою:

source: ``build_win.bat`` accepts 2 arguments:
ko: ``build_win.bat``는 2 개의 인수를받습니다:
uk: ``build_win.bat`` приймає 2 аргументи:

source: ``/e`` — executable only.
ko: ``/ e ''— 실행 만 가능합니다.

source: Produce an executable only, skipping the extra step of building an installer, and will copy ``win_gtk.bat`` into place.
ko: 설치 프로그램 빌드의 추가 단계를 건너 뛰고 실행 파일 만 생성하고``win_gtk.bat``를 제자리에 복사합니다.

source: ``venv_path`` — A path to the location for the virtual environment to use.
ko: ''venv_path'' - 가상 환경에서 사용할 위치에 대한 경로입니다.

source: Defaults to ``"%HOMEDRIVE%%HOMEPATH%"\.virtualenvs\%CHECKOUT%-exe``, where ``CHECKOUT`` corresponds to the name of the branch you checked out.
ko: 기본값은`` "% HOMEDRIVE %% HOMEPATH %"\. virtualenvs \ % CHECKOUT % -exe``이며, 여기서``CHECKOUT``은 체크 아웃 한 브랜치의 이름에 해당합니다.

source: If you want to produce an executable only and use a virtual environment in a folder beside where you have ghini.desktop, you could execute ``scripts\build_win.bat /e ..\ghi2exe``
ko: 실행 파일 만 생성하고 ghini.desktop이있는 폴더 옆에있는 가상 환경을 사용하려면``scripts \ build_win.bat / e .. \ ghi2exe``를 실행할 수 있습니다

source: py2exe will not work with eggs
es: py2exe no funciona con eggs
ko: py2exe는 계란과 함께 작동하지 않습니다
uk: py2exe не буде працювати з eggs

source: Building a Windows executable with py2exe requires packages **not** be installed as eggs. There are several methods to accomplish this, including:
es: Para producir un ejecutable Windows no debes instalar los paquetes como eggs. Hay varios métodos para alcanzarlo, por ejemplo:
ko: py2exe로 Windows 실행 파일을 빌드하려면 달걀로 설치되지 ** 않는 ** 패키지가 필요합니다. 이를 수행하는 방법은 다음과 같습니다:
uk: Створення виконуваного файлу Windows із py2exe вимагає встановлення пакетів ** не** як eggs. Для цього є кілька методів, зокрема:

source: Install using ``pip``. The easiest method is to install into a virtual environment that doesn't currently have any modules installed as eggs using ``pip install .`` as described below. If you do wish to install over the top of an install with eggs (e.g. the environment created by ``devinstall.bat``) you can try ``pip install -I .`` but your mileage may vary.
ko: ``pip ''를 사용하여 설치합니다. 가장 쉬운 방법은 아래에 설명 된대로``pip install .``을 사용하여 현재 계란으로 설치된 모듈이없는 가상 환경에 설치하는 것입니다. 달걀을 사용하여 설치 위에 설치하려면 (예 :``devinstall.bat ''로 만든 환경)``pip install -I .``를 시도 할 수 있지만 마일리지는 다를 수 있습니다.

source: By adding::
ko: 추가하여::
uk: Додавши:

source: to setup.cfg (or similarly ``zip_safe = False`` to ``setuptools.setup()`` in ``setup.py``) you can use ``python setup.py install`` but you will need to download and install `Microsoft Visual C++ Compiler for Python 2.7 <http://aka.ms/vcpython27>`_ to get any of the C extensions and will need a fresh virtual environment with no dependent packages installed as eggs.
ko: setup.cfg (또는 유사하게``zip_safe = False``에서``setup.py ''의``setuptools.setup ()``으로)``python setup.py install``을 사용할 수 있지만 다음이 필요합니다. C 확장을 얻으려면`Microsoft Visual C ++ Compiler for Python 2.7 <http://aka.ms/vcpython27>`_을 다운로드하여 설치하고, 종속 패키지가 달걀로 설치되지 않은 새로운 가상 환경이 필요합니다.
uk: до setup.cfg (або аналогічним чином ``zip_safe = False`` до ``setuptools.setup()`` в ``setup.py``) можна використовувати ``python setup.py install``, але вам необхідно завантажити та встановити `Microsoft Visual C++ Compiler для Python 2.7 <http://aka.ms/vcpython27>`_щоб отримати будь-яке розширення C, і йому буде потрібно свіже віртуальне середовище без залежних пакетів, встановлених як eggs.

source: The included ``build-win`` script uses the ``pip`` method.
ko: 포함 된``build-win ''스크립트는``pip ''메소드를 사용합니다.

source: installing virtualenv and working with environments
ko: virtualenv 설치 및 환경 작업

source: Install virtualenv, create a virtual environment and activate it.
ko: virtualenv를 설치하고 가상 환경을 만들고 활성화합니다.

source: With only Python 2.7 on your system (where ``<path-to-venv>`` is the path to where you wish to keep the virtual environment) use::
ko: 시스템에 Python 2.7 만있는 경우 (여기서``<path-to-venv>``는 가상 환경을 유지하려는 경로입니다) 다음을 사용하십시오::

source: On systems where Python 3 is also installed you may need to either call pip and virtualenv with absolute paths, e.g. ``C:\Python27\Scripts\pip`` or use the Python launcher e.g. ``py -2.7 -m pip`` (run ``python --version`` first to check. If you get anything other than version 2.7 you'll need to use one of these methods.)
ko: Python 3도 설치된 시스템에서는 절대 경로로 pip 및 virtualenv를 호출해야 할 수 있습니다. ``C : \ Python27 \ Scripts \ pip ''또는 Python 런처 (예 : ``py -2.7 -m pip ''(먼저``python --version``을 실행하여 확인하십시오. 버전 2.7이 아닌 다른 것이 있으면이 방법 중 하나를 사용해야합니다.)

source: Populate the virtual environment
ko: 가상 환경 채우기

source: Install dependencies and ghini.desktop into the virtual environment::
ko: 가상 환경에 종속성 및 ghini.desktop을 설치합니다::
uk: Встановити залежності та ghini.desktop у віртуальне середовище:

source: Compile for Windows
ko: Windows 용 컴파일

source: Build the executable::
ko: 실행 파일 빌드 ::
uk: Створіть виконуваний файл:

source: The ``ghini-runtime`` folder will now contain a full working copy of the software in a frozen, self contained state.
ko: 이제``ghini-runtime ''폴더에는 고정 된 자체 포함 상태의 소프트웨어의 전체 작업 복사본이 포함됩니다.

source: This folder is what is packaged by NSIS.
ko: 이 폴더는 NSIS에서 패키징 한 것입니다.

source: This same folder can also be transferred however you like and will work in place. (e.g. placed on a USB flash drive for demonstration purposes or copied manually to ``C:\Program Files`` with a shortcut created on the desktop). To start ghini.desktop double click ``ghini.exe`` in explorer (or create a shortcut to it).
ko: 이 동일한 폴더도 원하는대로 전송할 수 있으며 제자리에서 작동합니다. (예 : 데모 목적으로 USB 플래시 드라이브에 배치하거나 바탕 화면에 생성 된 바로 가기를 사용하여``C : \ Program Files``에 수동으로 복사). ghini.desktop을 시작하려면 탐색기에서``ghini.exe``를 두 번 클릭하거나 바로 가기를 만듭니다.

source: Fixing paths to GTK components.
ko: GTK 구성 요소에 대한 경로 수정.

source: If you run the relocatable compiled program, unpackaged, you might occasionally have trouble with the GUI not displaying correctly.
ko: 재배치 가능한 컴파일 된 프로그램 (패키지 해제)을 실행하면 GUI가 올바르게 표시되지 않는 문제가 발생할 수 있습니다.

source: Should this happen, you need to set up paths to the GTK components correctly. You can do this by running the ``win_gtk.bat``, from the ``ghini-runtime`` folder.
ko: 이 경우 GTK 구성 요소에 대한 경로를 올바르게 설정해야합니다. ``ghini-runtime ''폴더에서``win_gtk.bat``를 실행하면됩니다.

source: You will only need to run this once each time the location of the folder changes. Thereafter ``ghini.exe`` will run as expected.
ko: 폴더 위치가 변경 될 때마다 한 번만 실행하면됩니다. 그 후``ghini.exe``가 예상대로 실행됩니다.

source: Finally, invoke NSIS
ko: 마지막으로 NSIS를 호출합니다

source: Build the installer::
ko: 설치 프로그램 빌드 ::
uk: Створіть встановлювач:

source: This should leave a file named ``ghini.desktop-<version>-setup.exe`` in the ``dist`` folder. This is your Windows installer.
ko: 그러면``dist ''폴더에``ghini.desktop- <version> -setup.exe``라는 파일이 남습니다. 이것은 Windows 설치 프로그램입니다.

source: about the installer
ko: 설치 프로그램에 대해
uk: про програму установки

source: Capable of single user or global installs.
ko: 단일 사용자 또는 글로벌 설치가 가능합니다.
uk: Можливість однокористувацької або глобальної інсталяції.

source: At this point in time ghini.desktop installed this way will not check or or notify you of any updated version. You will need to check yourself.
ko: 이 시점에서 이렇게 설치된 ghini.desktop은 업데이트 된 버전을 확인하거나 알리지 않습니다. 자신을 확인해야합니다.
uk: На даний момент ghini.desktop, встановлений таким чином, що не буде перевіряти або повідомляти вам про оновлену версію. Вам потрібно буде перевірити це самому.

source: Capable of downloading and installing optional extra components:
ko: 선택적 추가 구성 요소를 다운로드하고 설치할 수 있습니다:
uk: Можливість завантаження та встановлення необов'язкових додаткових компонентів:

source: Apache FOP - If you want to use xslt report templates install FOP. FOP requires Java Runtime. If you do not currently have it installed the installer will let you know and offer to open the Oracle web site for you to download and install it from.
ko: Apache FOP-xslt 보고서 템플릿을 사용하려면 FOP를 설치하십시오. FOP에는 Java 런타임이 필요합니다. 현재 설치되어 있지 않은 경우 설치 프로그램이이를 알려주고 Oracle 웹 사이트를 열어 다운로드하여 설치할 수 있도록 제안합니다.
uk: Apache FOP - Якщо ви хочете використовувати шаблони звітів xslt, встановіть FOP. FOP вимагає Java Runtime. Якщо у вас цього не встановлено, програма установки повідомить вас і запропонує відкрити веб-сайт Oracle для завантаження та встановлення з нього.

source: MS Visual C runtime - You most likely don't need this but if you have any trouble getting ghini.desktop to run try installing the MS Visual C runtime (e.g. rerun the installer and select this component only).
ko: MS Visual C 런타임 - 이 기능이 필요하지 않을 수 있지만 MS Visual C 런타임(예: 설치 프로그램을 다시 실행하고 이 구성 요소만 선택)을 실행하는 데 문제가 있는 경우 설치를 시도하십시오.
uk: MS Visual C runtime - Ви, швидше за все, цього не потребуєте, але якщо у вас виникли проблеми з запуском ghini.desktop, спробуйте встановити час виконання MS Visual C (наприклад, перезапустити програму встановлення та вибрати лише цей компонент).

source: Can be run silently from the commandline (e.g. for remote deployment) with the following arguments:
ko: 다음 인수를 사용하여 명령줄(예: 원격 배포용)에서 자동으로 실행할 수 있습니다:
uk: Може бути запущено без використання командного рядка (наприклад, для віддаленого розгортання) з наступними аргументами:

source: ``/S`` for silent;
ko: 침묵을 위한 ''/S'';
uk: ``/S`` для тихого;

source: ``/AllUser`` (when run as administrator) or ``/CurrentUser``
ko: "/AllUser"(관리자로 실행될 경우) 또는 "/현재 사용자"
uk: ``/ AllUser`` (при запуску від імені адміністратора) або ``/CurrentUser``

source: ``/C=[gFC]`` to specify components where:
ko: "/C=[gFC]"로 구성 요소를 지정합니다:
uk: ``/C = [gFC]``, щоб вказати компоненти, де:

source: ``g`` = Deselect the main ghini.desktop component (useful for adding optional component after an initial install)
ko: ''g² = main ghini.component 선택 취소(초기 설치 후 선택적 구성 요소를 추가하기 위한 선택 사항)
uk: ``g`` = Скасувати вибір основного компонента ghini.desktop (корисний для додавання додаткового компонента після первинної установки)

source: ``F`` = select Apache FOP
ko: "F" = Apache FOP 선택
uk: ``F`` = вибрати Apache FOP

source: ``C`` = select MS Visual C runtime
ko: ''C'' = MS Visual C 런타임 선택
uk: ``C`` = вибрати MS Visual C runtime

source: Debian
ko: 기변

source: Between 2009 and 2010 someone packaged the then already obsolete Bauble 0.9.7 for Debian, and the package was included in Ubuntu. That version is `still being distributed <https://packages.ubuntu.com/xenial/bauble>`_, regardless being it impossible to install.
ko: 2009년과 2010년 사이에 누군가가 당시 이미 쓸모없었던 바우블 0.9.7을 데비안을 위해 포장했고, 이 패키지는 우분투에 포함되었다. 이 버전은 설치가 불가능하더라도 https://packages.ubuntu.com/xenial/bauble으로 배포되고 있다. 높임말.
