Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: On the other hand, we are questioning if it is at all appropriate, letting any user delete something at such high level as a family, or a genus, or, for that matters, of anything connected to accessions in the collection.
es: Por otro lado, se estamos cuestionando si es del todo apropiado, dejar que cualquier usuario borre algo a un nivel tan alto como una familia, o un género, o, para lo que importa, de cualquier cosa que implique la eliminación inmediata de accesiones de la colección.
ko: 반면에, 우리는 그것이 적절한지에 대해 의문을 제기하고 있습니다. 어떤 사용자라도 컬렉션에 있는 접근과 관련된 어떤 것에 대한 가족, 속, 또는 그 문제에 대한 높은 수준에서 어떤 것을 삭제하도록 합니다.
uk: З іншого боку, ми ставимо під сумнів, чи це взагалі доречно, дозволяючи будь-якому користувачеві видалити щось на такому високому рівні, як сім'я або рід, або, у зв'язку з цим, щось пов'язане з приєднаннями до колекції.

source: The ghini way to question the software features, is by opening a `corresponding issue <https://github.com/Ghini/ghini.desktop/issues/218>`_.
es: En ghini la forma de cuestionar las características de software es abriendo un `asunto correspondiente <https://github.com/Ghini/ghini.desktop/issues/218>`_.
ko: 소프트웨어 기능에 의문을 제기할 수 있는 가장 중요한 방법은 'https://github.com/Ghini/ghini.desktop/issues/218'이라는 최신호를 여는 것이다.
uk: Спосіб, за допомогою якого ghini поставив запитання про функції програмного забезпечення, полягає у відкритті відповідної проблеми <https://github.com/Ghini/ghini.desktop/issues/218> `_.

source: When contacting the developers, they will definitely ask for technical information, or at least to see a screen-shot. Help them help you.
es: Al contactar los desarrolladores, sin duda pedirán información técnica o por lo menos para ver una captura de pantalla. Ayúdales a ayudarte.
ko: 개발자에게 문의할 때 기술 정보를 요청하거나 스크린샷이라도 볼 수 있습니다. 그들이 널 도울수 있게 도와줘.
uk: При зверненні до розробників вони обов'язково просять технічну інформацію або, принаймні, побачити екранний знімок. Допоможіть їм допомогти вам.

source: Taking a screen-shot
es: Tomar una captura de pantalla
ko: 스크린샷 찍기
uk: Зйомка екрану

source: On Linux there are three ways to create a screen-shot, all involve hitting the 'PrtSc' key. The most practical one is possibly hitting the 'PrtSc' key in combination with Ctrl and Shift. This will start an interactive screen copy tool. You select a rectangle and the area is copied in the clipboard. Paste it in the email you're writing, or in the chat line where the developers are trying to help you.
es: En Linux hay tres formas de crear una captura de pantalla, todas implican golpear la tecla 'PrtSc'. Posiblemente la más práctica es pulsando la tecla 'PrtSc' en combinación con Ctrl y Shift. Esto iniciará una herramienta de copia de la pantalla interactiva. Selecciona un rectángulo y este es copiado en el portapapeles. Pegarlo en el correo que estás escribiendo, o en la línea de chat donde los desarrolladores están tratando de ayudarle.
ko: Linux에서는 스크린샷을 만드는 세 가지 방법이 있으며, 모든 방법은 'PrtSc' 키를 누르는 것입니다. 가장 실용적인 것은 Ctrl 및 Shift 키와 함께 'PrtSc' 키를 치는 것입니다. 이렇게 하면 대화형 화면 복사 도구가 시작됩니다. 사각형을 선택하면 영역이 클립보드에 복사됩니다. 작성 중인 전자 메일이나 개발자가 도우려는 채팅 줄에 붙여넣습니다.
uk: У Linux існує три способи створення знімка екрана, все включається натисканням клавіші 'PrtSc'. Найбільш практичний варіант, можливо, комбінація клавіш 'PrtSc' з Ctrl і Shift. Запуститься інтерактивний інструмент копіювання екрана. Ви вибираєте прямокутник і область буде скопійована в буфер обміну. Вставте його в електронний лист, який ви пишете, або в чаті, де розробники намагатимуться вам допомогти.

source: Where are the logs
es: Donde están los log
it: Dove stanno i log
ko: 로그는 어디에 있습니까
uk: Де знаходяться журнали

source: Ghini continuously saves a very informative log file, in the ``~/.bauble/bauble.log`` file. Don't bother opening it, just send it over. It contains loads of technical information.
es: Ghini escribe continuamente en un archivo de registro muy informativo, ``~/.bauble/bauble.log``. No se moleste en abrirlo, envíelo no más. Contiene mucha información técnica.
ko: Ghini는 매우 유용한 로그 파일을 "~~/.bauable/boule"에 지속적으로 저장합니다.로그 파일 열어볼 필요 없이 그냥 보내 주세요. 여기에는 많은 기술 정보가 포함되어 있습니다.
uk: Ghini постійно зберігає дуже інформативний файл журналу у файлі ``~/.bauble/bauble.log``. Не хвилюйтеся відкриваючи його, просто надішліть його. Він містить багато технічної інформації.

source: Continuous unmanned alerting
es: Alerta continua no tripulada
ko: 연속 무인 경보
uk: Безперервне безпілотне оповіщення

source: An other option is to activate the sentry handler. It will notify our sentry server of any serious situations in the software. If you registered, the developers will know how to contact you if necessary.
es: Otra opción es activar el controlador Sentry. Notificará a nuestro servidor Sentry de cualquier situación grave en el software. Si te has registrado, los desarrolladores sabrá cómo comunicarse con usted si es necesario.
ko: 다른 옵션은 보초 처리기를 활성화하는 것입니다. 그러면 소프트웨어의 심각한 상황을 당사의 Sentry 서버에 알립니다. 등록하신 경우, 필요한 경우 개발자가 귀하에게 연락할 방법을 알게 됩니다.
uk: Інший варіант - активувати обробник sentry. Він повідомить наш сторожовий сервер про будь-які серйозні ситуації в програмному забезпеченні. Якщо ви зареєструвалися, розробники будуть знати, як з вами зв'язуватися, якщо це необхідно.

source: To the healthy paranoid: we're not monitoring what you're doing, we're monitoring how our software works. You can always opt out.
es: Para el paranoico de buena salud: no estamos supervisando lo que estás haciendo, estamos supervisando el funcionamiento de nuestro software. Siempre puede optar hacia fuera.
ko: 건강한 편집증 환자에게 : 우리는 당신이 무엇을 하고 있는지 감시하는 것이 아니라 우리의 소프트웨어가 어떻게 작동하는지 감시하는 것입니다. 언제든지 탈퇴할 수 있습니다.
uk: Для здорових песимістів: ми не стежимо за тим, що ви робите, ми стежимо за тим, як працює наше програмне забезпечення. Ви завжди можете відмовитися.

source: You activate the Sentry handler in the ``:prefs`` page: look for the row with name ``bauble.use_sentry_handler``, if the value is not what you wish, double click on the line and it will change to the other value.
es: Activar el controlador Sentry en la página ``:prefs``: buscar la fila con el nombre '' bauble.use_sentry_handler'', si el valor es no lo que desea, haga doble clic en la línea y cambiará a otro valor.
ko: '':prefs'' 페이지에서 Sentry 핸들러를 활성화합니다. "bauable.use_sentry_handler"라는 이름의 행을 찾고, 이 값이 원하는 값이 아니면 줄을 두 번 클릭하면 다른 값으로 변경됩니다.
uk: Ви активуєте обробник Sentry на сторінці ``: prefs``: шукайте рядок з назвою ``bauble.use_sentry_handler``, якщо значення не є тим, що ви хочете, двічі натисніть по лінії, і вона зміниться на інше значення.

source: Taxonomy
es: Taxonomía
ko: 분류법
uk: Таксономія

source: Introduction
es: Introducción
it: Introduzione
ko: Taxonomy
uk: Введення

source: Orchidaceae taxonomic complexity
es: Complejidad taxonómica de Orchidaceae
ko: 난초과 분류학적 복잡성
uk: Таксономічна складність орхідей

source: At the JBQ, we work most of all with orchids, family Orchidaceae, one of the largest plant families, with no less than 850 genera, organized —according to Dressler— in approximately 70 subtribes, 22 tribes, 5 subfamilies. How we represent this information is not obvious and needs be explained.
es: En el JBQ, trabajamos sobre todo con orquídeas, familia Orchidaceae, una de las más grandes familias de plantas, con no menos de 850 géneros, organizados – según Dressler, en aproximadamente 70 subtribus, 22 tribus, 5 subfamilias. Cómo representamos esta información no es obvio y necesita ser explicado.
ko: JBQ에서는 850개 이상의 속(Dressler)을 가진 가장 큰 식물군 중 하나인 난초과(Ochidaceae)와 함께 70여 개의 아족, 22개 부족, 5개 아족으로 구성되어 있습니다. 우리가 이 정보를 어떻게 표현하느냐는 명확하지 않으며 설명이 필요하다.
uk: У JBQ ми найбільше працюємо з орхідеями сімейства Orchidaceae, однією з найбільших рослинних сімейств, з не менш 850 родів, організованих - згідно з Dressler - приблизно 70 субтрибами, 22 трибами, 5 підродин. Як ми представляємо цю інформацію, це не є очевидним і потребує пояснення.

source: The taxonomy of the Orchidaceae family is continuously being reviewed. Genera get added, refused, reorganized, recognized as synonyms, some taxonomists prefer grouping species or genera in a new way, others split them again and differently, botanists of different nationalities may have different views on the matter. All this sounds very complex and specialistic, but it's part of our daily routine, and it can all be stored in our Ghini database.
es: La taxonomía de la familia Orchidaceae es continuamente revisada. Géneros se agregan, se rechazan, se reorganizan, son reconocido como sinónimos, algunos taxónomos prefieren otra agrupación de especies o géneros, otros vuelven a dividir y de manera otra vez diferente, los botánicos de diferentes nacionalidades pueden tener diferentes opiniones sobre el asunto. Todo esto suena muy complejo y especializado, pero es parte de nuestra rutina diaria, y que puede ser almacenado en nuestra base de datos Ghini.
ko: 난초과의 분류법은 지속적으로 검토되고 있다. 추가, 거부, 재구성, 동의어로 인식되고, 어떤 분류학자들은 종이나 속들을 새로운 방식으로 분류하는 것을 선호하며, 다른 분류학자들은 그것들을 다시 나누고, 다르게, 다른 국적의 식물학자들은 이 문제에 대해 다른 견해를 가질 수 있다. 이 모든 것은 매우 복잡하고 특별하게 들리지만, 이것은 우리의 일상 생활의 일부이고, 우리의 Ghini 데이터베이스에 저장될 수 있습니다.
uk: Таксономія сімейства Orchidaceae постійно переглядається. Роди додаються, відмовляються, реорганізуються, визнаються синонімами, деякі таксономісти віддають перевагу групі видів або пологів по-новому, інші розділяють їх знову і по-різному, ботаніки різних національностей можуть мати різні погляди на цю справу. Все це звучить дуже складно і спеціально, але це є частиною нашої повсякденної роботи, і все це можна зберегти в нашій базі даних Ghini.

source: Identifying at rank Genus, or Family
es: Identificar a rango género o familia
ko: 순위 속, 또는 패밀리에서
uk: Визначення по рангу роду або сім'ї

source: At rank genus
es: Al rango género
ko: 랫속
uk: По родовому рангу

source: Ghini-1.0 prescribes that an accession is identified at rank species, in all cases. The current maintainer acknowledges that this is a mistake, coming from the early Bauble days, and which Ghini-1.0 has in common with other botanic software. Until this is fixed, we rely on established practices.
es: Ghini 1.0 prescribe que una accesión se identifique al rango especie, en todos los casos. El responsable actual reconoce que esto es un error, procedente de los primeros días de Bauble y que Ghini 1.0 tiene en común con otros software botánicos. Hasta que esto se corrija, contamos con las prácticas establecidas.
ko: Ghini-1.0은 모든 경우에 순위 종에서 등록 여부를 확인한다고 규정한다. 현재의 관리인은 이것이 초기 바우블 시대의 실수이며, 기니-1.0이 다른 식물 소프트웨어와 공통적으로 가지고 있다는 것을 인정한다. 이 문제가 해결될 때까지 우리는 확립된 관행에 의존합니다.

source: If an accession is identified at rank genus, we add a fictive species in that genus, we don't specify its species epithet (we don't know that) and we add an unranked epithet in the infraspecific information section, like this:
es: Si se identifica una accesión al rango género, agregamos una especie ficticia en ese género, sin especificar su epíteto de especie (pues lo desconocemos) y añadimos un epíteto sin clasificar en la sección de información infraespecífica, como este:
ko: 순위 속에서의 등록이 확인되면, 우리는 그 속에 가공 종을 추가하고, 그 종의 별칭을 지정하지 않으며(우리는 그것을 알지 못한다), 다음과 같이 초특정 정보 섹션에 순위 없는 별칭을 추가한다:
uk: Якщо приєднання визначається по родовому рангу, ми додаємо вигадані види в цьому роді, ми не вказуємо епітет свого виду (ми цього не знаємо), і ми додаємо незареєстрований епітет у розділі інфрачервоної інформації, як це:

source: When displayed in a search result, it shows like this:
es: Cuando aparece en un resultado de búsqueda, se muestra como este:
ko: 검색 결과에 표시되는 내용은 다음과 같습니다:
uk: Коли він відображається в результатах пошуку, він виглядає так:

source: At rank family
es: Al rango familia
ko: 랭크 패밀리
uk: По сімейному рангу

source: If an accession is only identified at rank family, we need a fictive genus, to which we can add the fictive species. Since our garden is primarily focusing on Orchidaceae, we use the very short name **Zzz** for the fictive genus within the family, like this:
es: Si una accesión es identificada sólo al rango de la familia, también necesitamos un género ficticio, a que podemos añadir la especie ficticia. Puesto que nuestro jardín se concentra principalmente en Orchidaceae, utilizamos el nombre corto **Zzz** para el género ficticio dentro de la familia, como este:
ko: 만약 입주가 순위 과에서만 확인된다면, 우리는 가공의 종을 추가할 수 있는 가공의 속(,)을 필요로 한다. 우리 정원은 주로 난초과(Ochidaceae)에 초점을 맞추고 있기 때문에, 우리는 다음과 같은 가공의 속명을 **Zz***로 쓴다:
uk: Якщо приєднання визначається лише по рангу сім'ї, нам потрібен вигаданий рід, до якого ми можемо додати фіктивні види. Оскільки наш сад в першу чергу орієнтується на Orchidaceae, ми використовуємо дуже коротке ім'я **Zzz** для вигаданого роду в сім'ї, як це:

source: The current maintainer suggests to use the prefix **Zzz-** and behind the prefix to write the family name, possibly removing the trailing **e**. Removal of the trailing **e** is useful in order not to get results that include genus names when you as for stuff ending in **aceae**.
es: El responsable actual sugiere utilizar el prefijo **Zzz-** y detrás del prefijo escribir el nombre de la familia, posiblemente eliminando la **e** final. La eliminación de la **e** final es útil para no obtener resultados que incluyan nombres de género cuando busca cosas que terminen en **aceae**.
ko: 현재 유지 관리자는 접두사 **Zz-**와 접두사 뒤에 있는 **e*를 사용하여 패밀리 이름을 쓸 것을 제안하며, 후행 **e**를 제거할 수 있습니다. **e**로 끝나는 물건의 경우 **e**로 끝나는 물건의 경우 속명을 포함하는 결과를 얻지 않는 데 유용합니다.
uk: Поточний супровідник пропонує використовувати префікс **Zzz-** і за префіксом для написання імені сім'ї, можливо, зняття закінчення **e**. Видалення пробілу **e** корисно для того, щоб не отримувати результатів, які містять назви родів, коли ви, як для речовини, що закінчується **aceae**.

source: Apart from the aforementioned **Zzz** genus in the Orchidaceae family, we follow this suggested practice, so for example our collection would include *Zzz-cactacea* or *Zzz-bromeliacea*.
es: Con la excepción del ya mencionado género **Zzz**, de la familia Orchidaceae, sí seguimos esta práctica aconsejada, así que por ejemplo nuestra colección incluye *Zzz-cactacea* y *Zzz-bromeliacea*.
ko: 앞에서 언급한 **Zz** 속과와 별도로, 우리는 제안된 관행을 따르므로, 예를 들어 우리의 컬렉션에는 *Zz-cactacea* 또는 *Zz-bromeliacea*가 포함된다.
uk: Окрім вищезазначеного **Zzz** у сімействі Orchidaceae, ми дотримуємося запропонованої практики, тому, наприклад, наша колекція включатиме *Zzz-cactacea* або *Zzz-bromeliacea*.

source: Remember: our **Zzz** genus is a fictive genus in the **Orchidaceae** family, do not use it as unspecified genus in other families.
es: Recuerde: nuestro **Zzz** representa un género desconocido en la familia **Orchidaceae**, no lo utilice como género desconocido en otras familias.
ko: 기억하라: 우리의 **Zz** 속은 **Orchidaceae* 과의 가공 속이며, 다른 과에서는 지정되지 않은 속으로서 사용하지 말라.
uk: Пам'ятайте: наш **Zzz** рід є вигаданим родом у сім'ї **Orchidaceae**, не використовуйте його як невизначений рід в інших сім'ях.

source: Identifying at a rank that is not allowed by the software (eg: Subtribe, or Subfamily)
es: Identificar en un rango que no está permitido por el software (por ejemplo: Subtribu o subfamilia)
ko: 소프트웨어에서 허용되지 않는 순위 식별(예: 하위 항목 또는 하위 제품군)
uk: Визначення за рангом, яке не дозволено програмним забезпеченням (наприклад: Subtribe або підсемейство)

source: At rank subtribe
es: Al rango subtribu
ko: 서열로
uk: По рангу субтриб

source: We sometimes can't identify a taxon at rank genus, but we do manage to be more precise than just "it's an orchid". Quite often we are able to indicate the subtribe, this is useful when you want to produce hybrids.
es: A veces no podemos identificar un taxón en el género de rango, pero logramos ser más precisas que tan sólo "es una orquídea". Muy a menudo somos capaces de indicar la subtribu, esto es útil cuando se desee producir híbridos.
ko: 우리는 때때로 랭크 속에서는 분류법을 확인할 수 없지만, 우리는 단지 "그것은 난초"일 뿐 아니라 더 정확하게 할 수 있다. 우리는 종종 하위 계급을 나타낼 수 있습니다. 이것은 여러분이 하이브리드를 생산하고 싶을 때 유용합니다.
uk: Ми іноді не можемо визначити таксонів у родовому класі, але нам вдається бути точнішим, ніж просто "це орхідея". Часто ми можемо вказати субтриб, це корисно, коли ви хочете виготовити гібриди.

source: The software does not let us store ranks which are intermediate between family and genus, so we need to invent something, and this is what we do:
es: El software no nos permite almacenar rangos intermedios entre familia y género, así que tuvimos que inventar algo, y esto es lo que hacemos:
ko: 소프트웨어는 우리가 가족과 속 사이의 중간 순위를 저장할 수 있도록 해주지 않습니다. 그래서 우리는 무언가를 발명해야 합니다. 그리고 이것이 우리가 하는 일입니다:
uk: Програмне забезпечення не дозволяє нам зберігати ряди, які є проміжними між сім'єю та родом, тому нам потрібно щось винайти, і це ми робимо:

source: We insert a fictive genus, naming it as the subtribe, prefixing it with 'Zzx-', like in this example:
es: Insertamos un género ficticio, nombrando como la Subtribu, prefijando con 'Zzx-', como en este ejemplo:
ko: 우리는 이 예에서와 같이 'Zzx-'로 앞에 붙이는, 그것을 하위 종족으로 명명하는 가공의 속들을 삽입한다:
uk: Ми вставляємо вигаданий рід, називаючи його сабтриб, передусім називаючи його 'Zzx-', як у цьому прикладі:

source: This Zzx-Laeliinae is some genus in the Laeliinae subtribe.
es: Este Zzx-Laeliinae es algún género de la subtribu Laeliinae.
ko: Zzx-Laelliinae속은 Laelliinae속(Laeliae)에 속하는 속이다.
uk: Це Zzx-Laeliinae є деяким родом в Laeliinae субтрибу.

source: In order to be able to select genera by subtribe, we also add a note to the Zzx-Laeliinae fictive genus as well as for all real genera in that subtribe, note category subtribus, note value the subtribe name.
es: Con el fin de poder seleccionar géneros por subtribu, también vamos a añadir una nota al género ficticio Zzx-Laeliinae, así como para todos los géneros en la misma subtribu: categoría subtribus, valor el nombre de la subtribu.
ko: 하위 계통별로 범주를 선택할 수 있도록 Zzx-Laelliinae 가상 속뿐만 아니라 해당 하위 계통, 노트 범주 하위 계통, 노트 값 하위 계통의 모든 실제 속에도 노트를 추가한다.
uk: Щоб мати можливість вибирати рід за допомогою subtribe, ми також додаємо нотатку до вигаданого роду Zzx-Laeliinae, а також для всіх справжніх родів у цьому підзаголовоку, примітку категорії subtribus, відзначимо значення імені субтиба.

source: This allows for queries like:
es: Esto permite consultas como:
ko: 이렇게 하면 다음과 같은 쿼리가 허용됩니다:
uk: Це дозволяє виконувати такі запити, як:

source: We are very much looking forward to seeing that `issue-9 <https://github.com/Bauble/bauble.classic/issues/9>`_ solved!
es: También esperamos con impaciencia que el `problema-9 <https://github.com/Bauble/bauble.classic/issues/9>`_ sea solucionado!
ko: 우리는 '이슈-9 https://github.com/Bauble/bauble.classic/issues/9'이 해결되기를 매우 고대하고 있다!
uk: Ми дуже з нетерпінням чекаємо цього `issue-9 <https://github.com/Bauble/bauble.classic/issues/9>`_ вирішено!

source: At rank subfamily, tribe
es: Al rango subfamilia o tribu
ko: 계급 하위 가족, 부족
uk: По рангу підродини, триба

source: Just as we reserved the prefix Zzx- for subtribe, we reserve the prefixes Zzy- for tribe, Zzw- for subfamily.
es: Como hemos reservado el prefijo Zzx - para la subtribu, nos reservamos los prefijos Zzy - para la tribu, Zzw - para la subfamilia.
ko: 우리가 하위 계급을 위해 접두사 Zzx-를 예약한 것처럼, 부족의 경우 Zzy-, 하위 계열의 경우 Zzw-를 예약한다.
uk: Оскільки ми зарезервували префікс Zzx- для субтрибу, ми зберігаємо префікси Zzy для трибу, Zzw- для підродини.

source: In particular, the subfamily information is relevant, because there are subfamilies within the Orchidaceae family which are not further separated.
es: En particular, la información de la subfamilia es relevante, porque hay subfamilias dentro de la familia Orchidaceae, que no están más separados.
ko: 특히 난초과에는 더 이상 분리되지 않는 아과가 존재하기 때문에 아과 정보가 관련이 있다.
uk: Зокрема інформація підродини є актуальною, оскільки в сімействах Orchidaceae є підродини, які ще не розділені.

source: Editing the Accession identification - the Species details
es: Edición de la identificación de accesión - los detalles de las especies
ko: 등록 ID 편집 - 종 세부 정보
uk: Редагування ідентифікації приєднання - відомості виду

source: Placeholder species for individual accessions
es: Especie comodín para accesiones individuales
ko: 개별 접근을 위한 자리 표시자 종
uk: Покажчик місця заповнення видів для окремих приєднань

source: Scenario one describes the identification of a single accession, which had been associated to a "generic", placeholder species, something like “*Zzz* sp” or “*Vanda* sp”;
es: Escenario uno describe la identificación de una accesión individual, que había sido asociada a una especie comodín genérica, algo así como "*Zzz* sp" o "*Vanda* sp";
ko: 시나리오 1은 "일반" 자리 표시자 종과 연관된 단일 등록의 식별을 설명한다. "*Zzz*sp" 또는 "*Vanda*sp"와 같은 것;
uk: Сценарій описує ідентифікацію єдиного приєднання, яке було пов'язане з "родовим", заповнювачем видів, щось типу “*Zzz* sp” або “*Vanda* sp”;

source: In this case, when the plant species becomes known, we change the association in the accession, selecting a different species.
es: En este caso, cuando se da a conocer las especies de la planta, cambiamos la asociación en la accesión, seleccionando una especie diferente.
ko: 이 경우, 식물 종이 알려지면, 우리는 다른 종을 선택하면서 등록에서 연관성을 바꿉니다.
uk: У цьому випадку, коли виявляється вид рослини, ми змінюємо асоціацію при приєднанні, вибираючи інший вид.

source: We do not edit the species, because there might be totally unrelated accessions connected to the same placeholder species.
es: No editamos la especie comodín, pues esta puede estar conectada a otras accesiones totalmente sin relación con la que identificamos.
ko: 우리는 그 종을 편집하지 않습니다. 왜냐하면 같은 자리 표시자 종에 전혀 관련이 없는 접근법이 연결되어 있을 수 있기 때문입니다.
uk: Ми не редагуємо види, оскільки можуть бути абсолютно незв'язані приєднання, пов'язані з тими ж типами заповнювачів.

source: Unknown species for multiple accessions
es: Especie desconocida para accesiones múltiples
ko: 다중 액세스에 대해 알 수 없는 종
uk: Невідомі види для численних приєднань

source: A different case is when we have a whole batch of accessions, all obviously the same species, but we haven't been able to identify it. In this case, we associate the accessions with an incompletely specified species, something like “*Zzz* sp-59”, preferably adding the taxonomist's name, who made the association.
es: Un caso diferente es cuando tenemos un lote entero de accesiones, todas obviamente la misma especie, pero no hemos sido capaces de identificarla. En este caso, asociamos las accesiones con una especies incompletamente especificada, algo así como "*Zzz* sp-59", preferiblemente añadiendo el nombre del taxónomo, que hizo la asociación.
ko: 우리가 accessions, 분명히 같은 종의 전체를 배치한 다르지만, 우리는 그것을 식별할 수 있는 안 했어요.이 경우 우리는 불완전하게 지정된 종들과 함께로 사전의 분류 학자의 이름을 추가하는 협회 만든 accessions“*Zzz* sp-59”처럼 뭔가 연관시킨다.
uk: Інша справа - коли ми маємо цілу партію приєднань, все це, очевидно, є одним і тим же видом, але ми не змогли його ідентифікувати. У цьому випадку ми пов'язуємо приєднання з неповним зазначеним видом, щось на кшталт “*Zzz* sp-59”, бажано додати ім'я таксономіста, який створив асоціацію.

source: A species like “*Vanda* sp-018599” is not a placeholder species, it is a very concrete species, which we haven't yet identified.
es: Una especie como "*Vanda* sp-018599" no es una especie comodín, es una especie muy concreta, que aún no hemos identificado.
ko: "*반다* sp-018599"와 같은 종은 자리 표시자 종이 아니라, 우리가 아직 확인하지 못한 매우 구체적인 종입니다.
uk: Вид, як “*Vanda* sp-018599”, не є заповнювачем, це дуже конкретний вид, який ми ще не визначили.
