Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: On the other hand, if you want to connect more than one bauble workstation to the same database, or if you want to make your data available for other clients, as could be a web server in a LAMP setting, you should consider keeping your database in a database management system like `PostgreSQL <http://www.postgresql.org>`_ or `MySQL/MariaDB <https://mariadb.org/>`_, both supported by Ghini.
es: Por otro lado, si desea conectar más de una estación de trabajo a la misma base de datos, o si desea ponerlos a disposición de otros clientes, como podría ser un servidor web en ambiente LAMP, debe considerar mantener su base de datos en un sistema de gestión de base de datos como `PostgreSQL <http://www.postgresql.org>`_ o `MySQL/MariaDB <https://mariadb.org/>`_, ambos apoyados por Ghini.
it: D'altra parte, se si desidera collegare più di una workstation ghini allo stesso database o se si desidera rendere disponibili i dati per altri client, come potrebbe essere un server web in una configurazione LAMP, è consigliabile mantenere il database in un database management system come `PostgreSQL <http://www.postgresql.org>`_ o `MySQL/MariaDB <https://mariadb.org/>`_, entrambi supportati da Ghini.
ko: 반면, 둘 이상의 바우블 워크스테이션을 동일한 데이터베이스에 연결하거나 LAMP 설정에서 웹 서버일 수 있는 다른 클라이언트에서 데이터를 사용할 수 있도록 하려면 데이터베이스를 "Postgre"와 같은 데이터베이스 관리 시스템에 보관하는 것을 고려해야 합니다.SQL http://www.postgresql.org'_ 또는 'MySQL/MariaDB https://mariadb.org/'은 둘 다 Ghini가 지원합니다.
uk: З іншого боку, якщо ви хочете підключити більше однієї робочої станції до тієї ж бази даних, або якщо ви хочете зробити свої дані доступними для інших клієнтів, як це може бути веб-сервер у налаштуваннях LAMP, слід враховувати збереження вашої бази даних В системі управління базами даних, як `PostgreSQL <http://www.postgresql.org>`_ або `MySQL/MariaDB <https://mariadb.org/>`_, обидва варіанти підтримуються Ghini.

source: When connecting to a database server as one of the above, you have to manually do the following: Create at least one user; Create your database; Give at least one user full permissions on your database; If you plan having more database users: Give one of your users the ``CREATEROLE`` privilege; Consider the user with the ``CREATEROLE`` privilege as a super-user, not meant to handle data directly; Keep your super-user credentials in a very safe place.
ko: 데이터베이스 서버에 위 중 하나로 연결할 때 수동으로 다음 작업을 수행해야 합니다. 하나 이상의 사용자 만들기, 데이터베이스 만들기, 데이터베이스에 대한 하나 이상의 사용자에게 전체 사용 권한 부여, 만약 당신이 더 많은 데이터베이스 사용자를 가질 계획이라면: 당신의 사용자 중 한 명에게 "CREATEROLE" 권한을 부여하라; 데이터를 직접 처리하려는 것이 아니라 "CREATEROLE" 권한을 가진 사용자를 수퍼유저로 간주하라; 당신의 수퍼유저 자격증은 매우 안전한 장소에 보관하라.

source: When this is done, Ghini will be able to proceed, creating the tables and importing the default data set. The process is database-dependent and it falls beyond the scope of this manual.
ko: 이 작업이 완료되면 Ghini가 계속 진행하여 테이블을 만들고 기본 데이터 세트를 가져올 수 있습니다. 프로세스는 데이터베이스에 따라 다르며 이 매뉴얼의 범위를 벗어납니다.

source: If you already got the chills or sick at your stomach, no need to worry, just stick with SQLite, you do not miss on features nor performance.
es: Si ya tienes escalofríos o dolores de estómago, no se preocupe más, simplemente adopte SQLite, sin perder características ni prestaciones.
it: Se già vi tremano le ginocchia, non c'è bisogno di preoccuparsi, basta restare con SQLite, senza perdere in funzionalità né prestazioni.
ko: 이미 위가 오싹하거나 아프면 걱정할 필요 없이 SQLite만 고수하면 기능이나 성능을 놓치지 않습니다.
uk: Якщо у вас вже є озноб або біль в животі, немає необхідності турбуватися, просто тримайтеся SQLite, ви не зазнаєте невдачі на особливостях, ні в продуктивності.

source: Some more hints if you need PostgreSQL
ko: Postgre가 필요한 경우 추가 힌트SQL

source: Start simple, don't do all at the same time. Review `the online manual <https://www.postgresql.org/docs/9.4/static/index.html>`_, or download and study `the offline version <https://www.postgresql.org/files/documentation/pdf/9.4/postgresql-9.4-A4.pdf>`_.
ko: 단순하게 시작하세요, 동시에 모든 것을 하지 마세요. 온라인 매뉴얼 https://www.postgresql.org/docs/9.4/static/index.html을 검토하거나 오프라인 버전 https://www.postgresql.org/files/documentation/pdf/9.4/postgresql-9.4-A4.pdf을 다운로드하여 학습한다.

source: As said above, create a database, a user, make this user the owner of the database, decide whether you're going to need multiple users, and preferably reserve a user for database and normal user creation. This super-user should be your only user with ``CREATEROLE`` privilege.
ko: 위에서 설명한 대로 데이터베이스를 만들고, 사용자를 데이터베이스의 소유자로 설정하고, 여러 명의 사용자가 필요한지 여부를 결정하며, 데이터베이스 및 일반 사용자 작성을 위해 사용자를 예약하는 것이 좋습니다. 이 수퍼유저는 "CREATEROLE" 권한이 있는 유일한 사용자여야 합니다.

source: All normal users will need all privileges on all tables and sequences, something you can do from the :menuselection:`Tools-->Users` menu. If you have any difficulty, please `open an issue <https://github.com/Ghini/ghini.desktop/issues/new>`_ about it.
ko: 모든 일반 사용자는 다음 메뉴 선택에서 수행할 수 있는 모든 테이블 및 시퀀스에 대한 모든 권한이 필요합니다.'도구-->사용자' 메뉴입니다. 어려운 점이 있으면 https://github.com/Ghini/ghini.desktop/issues/new을 열어 주십시오.

source: Connect using the ``psql`` interactive terminal. Create a ``~/.pgpass`` file (read more about it in `the manual <https://www.postgresql.org/docs/9.4/static/libpq-pgpass.html>`_), tweak your ``pg_hba.conf`` and ``postgresql.conf`` files, until you can connect using the command::
ko: ''psql'' 대화형 단자를 사용하여 연결합니다. 다음 명령을 사용하여 연결할 수 있을 때까지 ''~/.pgpassfilename 파일('manual https://www.postgresql.org/docs/9.4/static/libpq-pgpass.html'_에서 자세히 보기)을 생성하고 ''pg_pg_postgresql.confilename 파일'을 수정합니다::

source: With the above setup, connecting from ghini will be an obvious task.
ko: 위의 설정으로 기니에서 연결하는 것은 명백한 작업이 될 것이다.

source: Connecting to a database
es: Conectarse a una base de datos
it: Connettersi ad una base dati
ko: 데이터베이스에 연결
uk: Підключення до бази даних

source: When you start Ghini the first thing that comes up is the connection dialog.
es: Al arrancar Ghini, lo primero que aparece es una ventana en que seleccionar la conexión.
it: All'avviare Ghini, la prima cosa che appare è la finestra per la scelta della connessione.
ko: Ghini를 시작할 때 가장 먼저 나타나는 것은 연결 대화 상자입니다.
uk: При запуску Ghini вперше спливає діалогове вікно підключення.

source: Quite obviously, if this is the first time you start Ghini, you have no connections yet and Ghini will alert you about it.
es: Pues si esta es la primera vez que arranca Ghini por supuesto no hay conexiones. Ghini se lo deja notar.
it: Abbastanza naturalmente, la prima volta che si avvia Ghini non ci saranno connessioni a disposizione. Ghini mostra una finestra di avviso.
ko: 기니를 처음 시작하면 아직 연줄이 없습니다. 기니가 경고를 해 줄 겁니다.
uk: Цілком очевидно, що, якщо це перший раз, коли ви запускаєте Ghini, у вас немає ще підключення і Ghini попередить вас про це.

source: This alert will show at first activation and also in the future if your connections list becomes empty. As it says: click on **Add** to create your first connection.
es: Esta alerta se mostrará en primera activación y también en el futuro si su lista de conexiones se vuelva vacía. Como dice: haga clic en ** Agregar ** para crear tu primera conexión.
it: Questo avviso vi mostrerà alla prima attivazione e anche in futuro se il tuo elenco di connessioni diventa vuota. Come l'avviso stesso dice: fare clic su **aggiungere** per creare la prima connessione.
ko: 이 알림은 처음 활성화될 때와 나중에 연결 목록이 비어 있는 경우에도 표시됩니다. 표시된 대로 **추가**를 클릭하여 첫 번째 연결을 만듭니다.
uk: Це сповіщення буде показано при першій активації, а також у майбутньому, якщо список ваших з'єднань стане порожнім. Як говориться: натисніть **Додати**, щоб створити своє перше з'єднання.

source: Just insert a name for your connection, something meaningful you associate with the collection to be represented in the database (for example: “my home garden”), and click on **OK**. You will be back to the previous screen, but your connection name will be selected and the Connection Details will have expanded.
es: No más inserte el nombre de la conexión, algo sencillo y relevante, que se asocie a la colección que va a poner en la base de datos (por ejemplo: "parques municipales"), y pise **OK**. Ghini vuelve a la ventana anterior, donde el nombre de la conexión está seleccionada y los Detalles de conexión se han expandido.
it: Semplicemente: inserire un nome per la connessione, una cose semplice e significativa che si associ naturalmente alla collezione che si vuol inserire (che so, "alberi monumentali"), e scegliere **OK**. Ghini torna allo schermo precedente, ma il nome della connessione sarà selezionato e la sezione Dettagli della Connessione sarà visibile.
ko: 데이터베이스에 표시할 컬렉션과 관련된 의미 있는 연결 이름(예: "내 집 정원")을 클릭하고 **OK**를 클릭합니다. 이전 화면으로 돌아가지만 연결 이름이 선택되고 연결 세부 정보가 확장됩니다.
uk: Просто вставте ім'я для підключення, щось значуще що ви асоціюєте з колекцією для представлення в базі даних (наприклад: «мій домашній сад») і натисніть **OK**. Ви повернетеся до попереднього екрана, але ваше ім'я з'єднання буде обрано і Деталі Підключення будуть розширені.

source: **specify the connection details**
es: **especificar la información de conexión**
it: **specificare i dettagli della connessione**
ko: **접속내역 확인**
uk: **вказати параметри з'єднання**

source: If you do not know what to do here, Ghini will help you stay safe. Activate the **Use default locations** check box and create your first connection by clicking on **Connect**.
es: Si no sabría que hacer acá, Ghini le da una mano. Active el **Utilice los valores por defecto** y finalice el crear la conexión pisando **Conectar**.
it: Se non si conosce cosa fare qui, Ghini vi aiuterà a stare al sicuro. Attivare il **utilizzare la casella di controllo posizioni** di predefinito e creare il tuo primo collegamento facendo clic su **Connect**.
ko: 여기서 무엇을 해야 할지 모른다면, 기니는 여러분이 안전하게 지낼 수 있도록 도와줄 거예요. **기본 위치 사용** 확인란을 활성화하고 **연결*을 클릭하여 첫 번째 연결을 만듭니다.
uk: Якщо ви не знаєте, що робити тут, Ghini допоможе вам залишатися в безпеці. Активуйте **Використання розташування за замовчуванням** шляхом встановлення прапорця і створіть перше з'єднання, натиснувши на **Підключення**.

source: You may safely skip the remainder of this section for the time being and continue reading to the following section.
es: El resto de esta sección da más detalles de natura técnica. Si no quiere adentrarse, puede seguir con la sección siguiente.
it: Si può tranquillamente ignorare il resto di questa sezione per il momento e continua a leggere la sezione seguente.
ko: 당분간 이 섹션의 나머지 부분을 안전하게 건너뛰고 다음 섹션을 계속 읽으실 수 있습니다.
uk: На даний момент ви можете сміливо пропустити решту цього розділу і продовжити читати наступний розділ.

source: **fine-tune the connection details**
es: **detalles de conexión: sintonización fina**
it: **mettere a punto i dettagli di connessione**
ko: **접속내역 미세조정**
uk: **точно налаштувати деталі з'єднання**

source: By default Ghini uses the file-based SQLite database. During the installation process you had the choice (and you still have after installation), to add database connectors other than the default SQLite.
es: Ghini utiliza por defecto el archivo base de datos de SQLite. Durante el proceso de instalación tenía la opción (y aún la tiene después de la instalación), para agregar conectores de base de datos distintos del predeterminado SQLite.
it: Per impostazione predefinita Ghini utilizza SQLite database basato su file. Durante il processo di installazione si aveva la scelta (e avete ancora dopo l'installazione), per aggiungere connettori di database diverso da quello predefinito SQLite.
ko: 기본적으로 Ghini는 파일 기반 SQLite 데이터베이스를 사용합니다. 설치 프로세스 중에 기본 SQLite 이외의 데이터베이스 커넥터를 추가할 수 있는 선택(설치 후에도 계속)이 있었습니다.
uk: За замовчуванням Ghini використовує файл бази даних на основі SQLite. В процесі установки у вас був вибір (і він у вас залишається і після установки), додати інші, ніж SQLite за замовчуванням з'єднувачі бази даних.

source: In this example, Ghini can connect to SQLite, PostgreSQL and MySQL, but no connector is available for Oracle or MS SQL Server.
es: En este ejemplo, Ghini puede conectarse a SQLite, PostgreSQL y MySQL, pero no hay conectores para Oracle o MS SQL Server.
it: In questo esempio, Ghini può connettersi a SQLite, PostgreSQL e MySQL, ma nessun connettore è disponibile per MS SQL Server o Oracle.
ko: 이 예에서 Ghini는 SQLite, Postgre에 연결할 수 있습니다.SQL 및 MySQL이지만 Oracle 또는 MS SQL Server에 사용할 수 있는 커넥터가 없습니다.
uk: У цьому прикладі, Ghini може підключитися до SQLite, PostgreSQL і MySQL, але немає з'єднувачів доступних для Oracle або MS SQL Server.

source: If you use SQLite, all you really need specify is the connection name. If you let Ghini use the default filename then Ghini creates a database file with the same name as the connection and ``.db`` extension, and a pictures folder with the same name and no extension, both in ``~/.bauble`` on Linux/MacOSX or in ``AppData\Roaming\Bauble`` on Windows.
es: Si utiliza SQLite, lo único que realmente necesita especificar es el nombre de la conexión. Si permite a Ghini utilizar el nombre predeterminado, Ghini crea el archivo de base de datos con el mismo nombre que la conexión y con extensión ``.db`` y una carpeta de fotos con el mismo nombre y sin extensión, que se encontrarán en ``~/.bauble`` en Linux/MacOSX o en ``AppData\Roaming\Bauble`` en Windows.
it: Se si utilizza SQLite, è davvero necessario specificare solo il nome di connessione. Se permetti che Ghini utilizzi il nome file predefinito, Ghini crea un file di database con lo stesso nome come la connessione ed estensione ``.db`` e una cartella di immagini ancora con lo stesso nome ma senza estensione, entrambe in ``~/.bauble`` su Linux/MacOSX o in ``AppData\Roaming\Bauble`` su Windows.
ko: SQLite를 사용하는 경우 연결 이름만 지정하면 됩니다. 만약 당신이 Ghini가 기본 파일 이름을 사용하도록 한다면 Ghini는 연결과 ".db" 확장자와 이름이 같고 확장자가 없는 그림 폴더를 Linux/MacOSX의 "~/.bauble" 또는 Windows의 "AppData\Roaming\Bauble"에서 생성한다.
uk: Якщо ви використовуєте SQLite, все, що вам дійсно потрібно це вказати ім'я з'єднання. Якщо ви дозволите Ghini використовувати ім'я файлу за замовчуванням, то Ghini створює файл бази даних з тим же ім'ям, що і з'єднання і ``.db`` розширення, і папку зображень з таким же ім'ям і без розширення, як в ``~/.bauble``в Linux/MacOSX або в ``AppData\Roaming\Bauble`` в Windows.

source: Still with SQLite, you might have received or downloaded a bauble database, and you want to connect to it. In this case you do not let Ghini use the default filename, but you browse in your computer to the location where you saved the Ghini SQLite database file.
es: Siempre con SQLite, usted quizás recibió o descargó un archivo de base de datos, y quiere utilizarlo. En este caso no deje a Ghini utilizar el nombre predeterminado, sino busque en su computadora la ubicación donde guardó ese archivo SQLite.
it: Ancora con SQLite, si potrebbe avere ricevuto o scaricato un database bauble, e si desidera connettersi ad esso. In questo caso non lasciate Ghini utilizzare il nome file predefinito, ma navighi nel vostro computer nel percorso dove è stato salvato il Ghini SQLite database file.
ko: 여전히 SQLite에서는 보블 데이터베이스를 수신하거나 다운로드했을 수 있으며, 이 데이터베이스에 연결하려고 합니다. 이 경우 Ghini가 기본 파일 이름을 사용하도록 허용하지 않지만 컴퓨터에서 Ghini SQLite 데이터베이스 파일을 저장한 위치로 이동합니다.
uk: Проте з SQLite, ви, можливо, отримали або завантажили bauble базу даних, і ви хочете підключитися до неї. В цьому випадку ви не дозволяєте Ghini використовувати ім'я файлу за замовчуванням, лише перегляньте на комп'ютері в тому місці, де ви зберегли Ghini SQLite файл бази даних.

source: If you use a different database connector, the dialog box will look different and it will offer you the option to fine tune all parameters needed to connect to the database of your choice.
es: Si utiliza otro conector de base de datos, el cuadro de diálogo se verá diferente y le ofrecerá la opción de afinar todos los parámetros necesarios para conectarse a la base de datos de su elección.
it: Se si utilizza un connettore diverso database, finestra di dialogo avrà un aspetto diverso e vi offrirà l'opzione di mettere a punto tutti i parametri necessari per connettersi al database di vostra scelta.
ko: 다른 데이터베이스 커넥터를 사용하는 경우, 대화상자는 다르게 보이고 사용자가 선택한 데이터베이스에 연결하는 데 필요한 모든 매개변수를 미세 조정할 수 있는 선택사항을 제공합니다.
uk: Якщо ви використовуєте інше з'єднання бази даних, діалогове вікно буде виглядати по-іншому і вам запропонують варіант для точної настройки всіх параметрів необхідних для підключення до бази даних за вашим вибором.

source: If you are connecting to an existing database you can continue to :ref:`editing-and-inserting-data` and subsequently :ref:`searching-in-ghini`, otherwise read on to the following section on initializing a database for Ghini.
ko: 기존 데이터베이스에 연결하는 심판::계속할 수 있다.`editing-and-inserting-data`과 그 이후:심판:`searching-in-ghini`, 그렇지 않으면은 후술 하는 부분 Ghini를 위한 데이터베이스를 초기화하기 계속 읽어 보세요.

source: If you plan to associate pictures to plants, specify also the *pictures root* folder. The meaning of this is explained in further detail at :ref:`plant-pictures` in :ref:`editing-and-inserting-data`.
es: Si va a asociar fotos a las plantas, también indique la *carpeta raíz* para las imágenes. El significado de esto se explica con mayor detalle en :ref:`plant-pictures` en :ref:`edición-y-insertar-data`.
it: Se si prevede di associare immagini alle piante, specificare anche il * cartella radice * immagini. Il significato di questo è spiegato in dettaglio a: ref: 'pianta-immagini' in: ref: 'editing-e-inserimento-dati'.
ko: 만약 당신이 식물을 것도 *picturesroot* 폴더 지정하는 사진을 연결할 계획이다.이것의 의미를 더 자세히 심판:`plant-pictures':에서 심판의:설명되어 있다.`editing-and-inserting-data`.
uk: Якщо ви плануєте пов'язати фотографії з установкою, вкажіть *pictures root* папку. Сенс цього пояснено більш детально в :ref:`editing-and-inserting-data`.

source: A sample SQLite database
ko: 샘플 SQLite 데이터베이스

source: Indeed we have a sample database, from our pilot garden "El Cuchubo", in Mompox, Colombia. We have a zipped `sample database for ghini-1.0 <http://www.ghini.me/cuchubo-1.0.zip>`_.
ko: 실제로 콜롬비아의 Mmpox에 있는 우리의 시범 정원인 "El Cuchubo"에 있는 샘플 데이터베이스를 가지고 있습니다. 우리는 'ghini-1.0용 샘플 데이터베이스'를 보유하고 있다. http://www.ghini.me/cuchubo-1.0.zip'.

source: Download and unzip it to the location of your choice, then start Ghini, create a connection named possibly ``cuchubo``, or ``sample``, and edit the Connection Details. Keep the connection type at the default SQLite, but instead of using the default locations, make sure that Filename points to your unpacked ``cuchubo.db`` file.
ko: 선택한 위치에 다운로드하여 압축을 푼 다음 기니를 시작하고 "쿠추보" 또는 "샘플"이라는 이름을 가진 연결을 만든 다음 연결 세부 정보를 편집합니다. 연결 유형을 기본 SQLite에 유지하되 기본 위치를 사용하는 대신 파일 이름이 압축되지 않은 ''cuchubo.db'' 파일을 가리키는지 확인하십시오.

source: Initialize a database
es: Inicializar una base de datos
it: Inizializzare la base dati
ko: 데이터베이스 초기화
uk: Ініціалізувати базу даних

source: First time you open a connection to a database which had never been seen by Ghini before, Ghini will first display an alert:
es: La primera vez que se abre una conexión a una base de datos, nunca antes vista con Ghini, el programa presenta el aviso:
it: La prima volta che si apre una connessione ad una base dati che Ghini non ha mai utilizzato prima, Ghini mostrerà l'avviso:
ko: 이전에 Ghini에서 볼 수 없었던 데이터베이스에 대한 연결을 처음 열면 Ghini가 먼저 경고를 표시합니다::
uk: Коли ви відкриваєте з'єднання з базою даних, яка не відмічена в Ghini перший раз, Ghini спочатку відобразить оповіщення:

source: immediately followed by a question:
es: e inmediatamente después la pregunta:
it: seguito a ruota da una domanda:
ko: 즉시 다음 질문이 뒤따릅니다:
uk: відразу слідує запитання:

source: Be careful when manually specifying the connection parameters: the values you have entered may refer to an existing database, not intended for use with Ghini. By letting Ghini initialize a database, the database will be emptied and all of its content be lost.
es: Tenga cuidado al especificar manualmente los parámetros de conexión: los valores que ha introducido pueden referirse a una base de datos existente, no debe ser usado con Ghini. Dejando Ghini inicializar una base de datos, la base de datos estará vacía y todo su contenido se pierde.
it: Fare attenzione quando si specificano manualmente i parametri di connessione: i valori immessi possono riferirsi a un database esistente, non destinato all'uso con Ghini. Permettendo a Ghini di inizializzare il database, questo sarà svuotato e tutto il suo contenuto verrà perso.
ko: 연결 매개 변수를 수동으로 지정할 때 주의하십시오. 입력한 값은 Ghini와 함께 사용할 수 없는 기존 데이터베이스를 참조할 수 있습니다. Ghini가 데이터베이스를 초기화하면 데이터베이스가 비워지고 모든 내용이 손실됩니다.
uk: Будьте обережні, коли вручну, вказуєте параметри з'єднання: значення, які ви ввели і відіслали до існуючої бази даних, можуть бути не призначені для використання в Ghini. Даючи Ghini ініціалізувати базу даних, база даних буде вичерпана, і весь її вміст буде втрачено.

source: If you are sure you want to create a database at this connection then select "Yes". Ghini will then start creating the database tables and importing the default data. This can take a minute or two so while all of the default data is imported into the database so be patient.
es: Si usted está seguro que desea crear una base de datos a este respecto a continuación, seleccione "Yes". Ghini entonces comenzará a crear las tablas de la base de datos e importar los datos por defecto. Esto puede tardar un minuto o dos así que mientras que todos los datos por defecto es importado a la base de datos asi que tengan paciencia.
it: Se sei sicuro di voler creare un database con questi parametri seleziona "Sì". Ghini inizierà quindi col creare le tabelle del database e procederà con l'importazione di dati predefiniti. Questo può richiedere un minuto o due: prego pazientare mentre tutti i dati predefiniti vengono importati.
ko: 이 연결에 데이터베이스를 생성하려면 "예"를 선택하십시오. 그런 다음 Ghini가 데이터베이스 테이블을 만들고 기본 데이터를 가져오기 시작합니다. 이 작업은 1~2분이 걸릴 수 있으므로 모든 기본 데이터를 데이터베이스로 가져오는 동안 잠시 기다려 주십시오.
uk: Якщо ви впевнені, що хочете створити базу даних у цьому зв'язку, виберіть "Так". Ghini почне створювати таблиці бази даних та імпортувати дані за замовчуванням. Це може зайняти хвилину або дві, тоді як всі дані за замовчуванням імпортуються в базу даних, тому будьте терплячі.

source: Once your database has been created, configured, initialized, you are ready to start :ref:`editing-and-inserting-data` and subsequently :ref:`searching-in-bauble`.
es: Cuando se haya creado, configurado, inicialisado la base de datos, estamos listos para :ref:`editing-and-inserting-data` y lo más interesante :ref:`searching-in-bauble`.
it: Una volta creata, configurata, inizializzata la base dati, siamo pronti per iniziare a :ref:`editing-and-inserting-data`ed in seguito :ref:`searching-in-bauble`.
ko: 데이터베이스가 생성, 구성, 초기화되면 다음을 시작할 수 있습니다:ref:데이터 저장 및 데이터 저장 후 :ref:&amp;in-completable.
uk: Після того, як база даних була створена, налаштована,ініціалізована, ви готові до запуску :ref:`editing-and-inserting-data` і згодом :ref:`searching-in-bauble`.

source: Mission & Vision
es: Misión y Visión
it: Missione & Visione
ko: 미션 & 비전
uk: Місія і Бачення

source: Here we state who we are, what we think of our work, what you can expect of this project.
es: Aquí afirmamos Quiénes somos, qué pensamos de nuestro trabajo, lo que puede esperar de este proyecto.
it: Qui di seguito riportiamo chi siamo, cosa pensiamo del nostro lavoro, cosa potete aspettarvi di questo progetto.
ko: 여기 우리가 우리 자신이 누군지 말했듯이 우리가 할 일이라고 생각하는, 이 프로젝트의 뭘 기대할 수 있다.
uk: Тут ми визначаємо, хто ми, що ми думаємо про нашу роботу, що ви можете очікувати від цього проекту.

source: Who is behind Ghini
es: Quién está detrás de Ghini
it: Chi c'è dietro Ghini
ko: Ghini 뒤에 누가 있습니까
uk: Хто стоїть за Ghini

source: Ghini is a small set of programs, meant to let collection managers manage their collection also digitally.
ko: Ghini는 컬렉션 관리자가 디지털 방식으로 컬렉션을 관리할 수 있도록 하는 작은 프로그램 세트입니다.
uk: Ghini - це невеликий набір програм, призначених для того, щоб розпорядники колекцій могли керувати своєю колекцією також у цифровій формі.
