Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Creating a Propagation
es: Creación de una propagación
it: Creazione di una propagazione
ko: 전파 생성
uk: Створення розмноження

source: A Propagation (trial) is obtained from a Plant. Ghini reflects this in its interface: you select a plant, open the Plant Editor on it, activate the Propagation Tab, click on Add.
es: Una propagación (ensayo) se obtiene de una planta. Ghini lo refleja en su interfaz: Seleccione una planta, abra el Editor de planta en él, activar la pestaña de propagación, haga clic en Agregar.
it: Una propagazione (trial) è ottenuta da una pianta. Ghini si riflette nella sua interfaccia: selezionare una pianta, aprire l'Editor di pianta su di esso, attivare la scheda di propagazione, fare clic su Aggiungi.
ko: 식물로부터 전파(시험)를 얻는다. Ghini는 이 인터페이스를 반영합니다. 식물을 선택하고, 식물 편집기를 열고, 전파 탭을 활성화하고, 추가를 클릭합니다.
uk: Розмноження (випробування) отримують із рослини. Ghini відображає це у своєму інтерфейсі: вибираєте рослину, відкривається редактор рослин, активуєте вкладку розповсюдження, натискаєте Додати.

source: When you do the above, you get a Propagation Editor window. Ghini does not consider Propagation trials as independent entities. As a result, Ghini treats the Propagation Editor as a special editor window, which you can only reach from the Plant Editor.
es: Cuando haces lo anterior, se obtiene una ventana de Editor de propagación. Ghini no considera ensayos de propagación como entidades independientes. Como resultado, Ghini trata al Editor de propagación como una ventana de editor especial, que sólo se puede llegar desde el Editor de planta.
it: Quando si fare quanto sopra, si ottiene una finestra di Editor di propagazione. Ghini non considera prove di propagazione come entità indipendenti. Di conseguenza, Ghini considera l'Editor di propagazione come una finestra di editor speciale, che si può raggiungere solo dall'Editor di pianta.
ko: 위의 작업을 수행할 때 전파 편집기 창이 나타납니다. Ghini는 전파 시행을 독립적인 개체로 간주하지 않습니다. 따라서 Ghini는 전파 편집기를 특수 편집기 창으로 간주하며, 이 창은 식물 편집기에서만 연결할 수 있습니다.
uk: Коли ви робите це вище, ви отримаєте вікно редактора розповсюдження. Ghini не вважає, що дослідження про розповсюдження є незалежними органами. В результаті, Ghini розглядає редактор розповсюдження як спеціальне вікно редактора, який ви можете отримати тільки з редактора рослин.

source: For a new Propagation, you select the type of propagation (this becomes an immutable property of the propagation) then insert the data describing it.
es: Para una nueva propagación, se seleccione el tipo de propagación (esto se convierte en una propiedad inmutable de la propagación) luego insertar los datos que lo describen.
it: Per una propagazione di nuova, si seleziona il tipo di propagazione (che diventa una proprietà immutabile della propagazione) quindi inseriscono i dati che lo descrive.
ko: 새 전파의 경우 전파 유형(이것은 전파의 불변 속성이 됨)을 선택한 다음 이를 설명하는 데이터를 삽입합니다.
uk: Для нового розповсюдження ви вибираєте тип розповсюдження (це стає незмінним властивістю розповсюдження), потім вставляйте дані, що описують його.

source: You will be able to edit the propagation data via the same path: select a plant, open the Plant Editor, identify the propagation you want to edit, click on the corresponding Edit button. You will be able to edit all properties of an existing Propagation trial, except its type.
es: Usted podrá editar los datos de propagación a través de la misma ruta: Seleccione una planta, abra el Editor de la planta, identificar la propagación que desea editar, haga clic en el botón Editar. Podrás editar todas las propiedades de una juicio, excepto el tipo de propagación existente.
it: Sarete in grado di modificare i dati di propagazione tramite lo stesso percorso: selezionare una pianta, aprire l'Editor di pianta, identificare la propagazione si desidera modificare, fare clic sul pulsante modifica corrispondente. Sarete in grado di modificare tutte le proprietà di una prova, tranne il tipo di propagazione esistente.
ko: 동일한 경로를 통해 전파 데이터를 편집할 수 있습니다. 공장을 선택하고, 공장 편집기를 열고, 편집할 전파를 식별하고, 해당 편집 버튼을 클릭합니다. 유형을 제외한 기존 전파 평가판의 모든 속성을 편집할 수 있습니다.
uk: Ви зможете редагувати дані про розповсюдження одним шляхом: виберіть рослину, відкрийте редактор рослин, ідентифікуйте поширення, яке ви хочете редагувати, натисніть на відповідну кнопку Редагувати. Ви зможете редагувати всі властивості існуючого процесу розповсюдження, крім його типу.

source: In the case of a seed propagation trial, you have a pollen parent, and a seed parent. You should always associate the Propagation trial to the seed parent.
es: En el caso de una propagación de semilla prueba, usted tiene un padre de polen y un padre de la semilla. Siempre se debe asociar el ensayo de propagación a los padres de semilla.
it: Nel caso di una prova di propagazione del seme, si dispone di un genitore di polline e un genitore del seme. È sempre necessario associare il processo di propagazione al padre di seme.
ko: 씨앗 전파 실험의 경우, 꽃가루 부모, 그리고 씨앗 부모가 있습니다. 전파 평가판을 항상 시드 부모에 연결해야 합니다.
uk: У випадку пробного розмноження насіння, у вас є батьківський пилок, і батьківське насіння. Завжди слід зв'язувати розповсюдження проб до батьківського насіння.

source: In Ghini-1.0 you specify the pollen parent plant in the "Notes" field, while Ghini-1.1 has a (relation) field for it. According to ITF2, there might be cases in seed propagation trials where it is not known which Plant plays which role. Again, in Ghini-1.0 you should use a note to indicate whether this is the case, Ghini-1.1 has a (boolean) field indicating whether this is the case.
es: En Ghini 1.0 especifica la planta polen del padre en el "Notes" del campo, mientras Ghini 1.1 tiene un campo (relación) para él. Según ITF2, puede haber casos en los ensayos de propagación de semilla donde no se sabe que planta que papel. Una vez más, en Ghini 1.0 debe usar una nota para indicar que si este es el caso, Ghini 1.1 tiene un campo (booleano) que indica si este es el caso.
it: In Ghini-1.0 è possibile specificare la pianta del genitore di polline nella "Notes" di campo, mentre Ghini-1.1 ha un campo (relazione) per esso. Secondo ITF2, potrebbero esserci casi nelle prove di propagazione di seme dove non è conosciuto che pianta svolge quale ruolo. Ancora una volta, in Ghini-1.0 è necessario utilizzare una nota per indicare che se questo è il caso, Ghini-1.1 presenta un campo (boolean) che indica se questo è il caso.
ko: Ghini-1.0에서는 "Notes" 필드에 꽃가루 부모 식물을 지정하는 반면, Ghini-1.1에서는 꽃가루 부모 식물을 위한 (관계) 필드가 있습니다. ITF2에 따르면, 어떤 식물이 어떤 역할을 하는지 알 수 없는 종자 전파 시험 사례가 있을 수 있다. 다시, Ghini-1.0에서는 메모를 사용하여 이 경우인지 여부를 나타내야 합니다. Ghini-1.1에는 이 경우인지 여부를 나타내는 (부울) 필드가 있습니다.
uk: У Ghini-1.0 ви вказуєте пилок батьківської рослини в поле "Примітки", у той час як Ghini-1.1 має (відношення) поле для нього. За інформацією ITF2, можуть бути випадки випробувань на розмноження де невідомо, яку роль відіграє яке насіння . Знову ж таки, в Ghini-1.0 ви повинні використовувати примітку, щоб вказати, чи це так, Ghini-1.1 має (булеве) поле, що вказує, чи це так.

source: Using a Propagation
es: Usando una propagación
it: Utilizzando una propagazione
ko: 전파 사용
uk: Використання розповсюдження

source: A Propagation trial may be successful and result in a new Accession.
es: Un ensayo de propagación puede ser exitoso y producir una nueva accesión.
it: Una prova di propagazione può essere successo e provocare una nuova accessione.
ko: 전파 평가판이 성공하여 새 등록으로 이어질 수 있습니다.
uk: Процес розповсюдження може бути успішним і призвести до нового приєднання.

source: Ghini helps you reflect this in the database: create a new Accession, immediately switch to the Source tab and select "Garden Propagation" in the (admittedly somewhat misleading) Contact field.
es: Ghini le ayuda a reflejar esto en la base de datos: crear una nueva accesión, inmediatamente cambie a la pestaña fuente y seleccione "Garden Propagation" en el campo (aunque algo engañoso).
it: Ghini ti aiuta a riflettere questo nel database: creare una nuova accessione, immediatamente passare alla scheda origine e selezionare "Garden Propagation" nel campo contatto (devo ammettere che un po ' fuorviante).
ko: Ghini는 새 등록 문서를 작성하고 즉시 원본 탭으로 전환한 후 (일부 오해의 소지가 있는) 연락처 필드에서 "정원 전파"를 선택합니다.
uk: Ghini допоможе відобразити це в базі даних: створити нове приєднання, негайно перейдіть на вкладку Джерело і виберіть "Розповсюдження саду" в (правда, дещо помилково) контактному полі.

source: Start typing the plant number and a list of matching plants with propagation trials will appear for you to select from.
es: Comience a escribir el número de plantas y aparecerá una lista de plantas que empareja con ensayos de propagación para que usted seleccione.
it: Iniziare a digitare il numero di piante e verrà visualizzato un elenco di piante corrispondenti con prove di propagazione per selezionare da.
ko: 공장 번호 입력을 시작하면 선택할 수 있는 전파 시행과 일치하는 공장 목록이 나타납니다.
uk: Почніть вводити номер рослини, і ви побачите список відповідних рослин із випробуваннями для розповсюдження.

source: Select the plant, and the list of accessed and unaccessed propagation trials will appear in the lower half of the window.
es: Seleccione la planta, y en la mitad inferior de la ventana aparecerá la lista de los ensayos de propagación a e unaccessed.
it: Selezionare l'planting e l'elenco delle prove di propagazione raggiunto e inutilizzato apparirà nella parte inferiore della finestra.
ko: 공장을 선택하면 액세스 및 액세스되지 않은 전파 시행 목록이 창 아래쪽에 나타납니다.
uk: Виберіть рослину, а список доступних і недоступних випробувань поширення з'явиться в нижній частині вікна.

source: Select a still unaccessed propagation trial from the list and click on Ok to complete the operation.
es: Seleccione un ensayo de propagación todavía unaccessed de la lista y haga clic en Aceptar para completar la operación.
it: Selezionare una versione di prova di propagazione ancora inutilizzato dall'elenco e fare clic su Ok per completare l'operazione.
ko: 목록에서 액세스되지 않은 전파 평가판을 선택하고 확인을 클릭하여 작업을 완료합니다.
uk: Виберіть незадовільну пробну версію для розповсюдження зі списку та натисніть кнопку ОК, щоб завершити операцію.

source: Using the data from the Propagation trial, Ghini completes some of the fields in the General tab: Taxon name, Type of material, and possibly Provenance. You will be able to edit these fields, but please note that the software will not prevent introducing conceptual inconsistencies in your database.
es: Usando los datos del ensayo de propagación, Ghini completa algunos de los campos en la ficha General: nombre de la taxonomía, tipo de material y posiblemente de procedencia. Usted podrá editar los campos, pero tenga en cuenta que el software no impedirá introducir inconsistencias conceptuales en su base de datos.
it: Utilizzando i dati dalla prova di propagazione, Ghini completa alcuni campi nella scheda Generale: nome del Taxon, tipo di materiale e possibilmente di provenienza. Sarete in grado di modificare questi campi, ma siete pregati di notare che il software non impedirà l'introduzione concettuale incoerenze nel database.
ko: Ghini는 전파 평가판의 데이터를 사용하여 일반 탭의 일부 필드를 완료합니다. 세금 명, 재료 유형 및 입증 가능성. 이러한 필드를 편집할 수 있지만, 소프트웨어에서 데이터베이스에 개념적 불일치를 초래하는 것을 방지하지는 않습니다.
uk: Використовуючи дані, отримані в процесі розповсюдження, Ghini завершує деякі поля на вкладці Загальні: назва Таксона, Тип матеріалу та, можливо, Походження. Ви зможете редагувати ці поля, але будь ласка, зверніть увагу, що програмне забезпечення не заважатиме введення концептуальних невідповідностей у вашій базі даних.

source: You can associate a Propagation trial to only one Accession.
es: Puede asociar un ensayo de propagación a la sola accesión.
it: È possibile associare una prova di propagazione sola accessione.
ko: 전파 평가판을 하나의 등록에만 연결할 수 있습니다.
uk: Ви можете приєднати пробну версію до одного приєднання.

source: Generating reports
es: Producir informes
it: Generare relazioni
ko: 보고서 생성
uk: Створення звітів

source: A database without exporting facilities is of little use. Ghini lets you export your data in table format (open them in your spreadsheet editor of choice), as labels (to be printed or engraved), as html pages or pdf or postscript documents.
ko: 설비를 수출하지 않는 데이터베이스는 거의 쓸모가 없다. Ghini를 사용하면 데이터를 테이블 형식(선택한 스프레드시트 편집기에서 열림), 레이블(인쇄 또는 새겨짐), HTML 페이지 또는 pdf 또는 postscript 문서로 내보낼 수 있습니다.

source: The Report Tool
ko: 보고서 도구

source: You activate the Report Tool from the main menu: :menuselection:`Tools-->Report`. The Report Tools acts on a selection, so first select something, then start the Report Tool.
ko: 메인 메뉴: 메뉴 선택:에서 Report Tool을 활성화합니다.'도구-->보고서'입니다. 보고서 도구는 선택 항목에 따라 작동하므로 먼저 항목을 선택한 다음 보고서 도구를 시작합니다.

source: Report on the whole collection.
ko: 전체 컬렉션에 대해 보고합니다.

source: To produce a report on your whole plant collection, a shortcut would be from the home screen, to click on the ``Families: in use`` cell.
ko: 당신의 전체 식물 수집에 대한 보고서를 작성하기 위해서는 홈 스크린에서 ``가족: 사용 중" 셀을 클릭하는 지름길이 될 것이다.

source: If your focus is more on the garden location than on taxonomy and accessions, you would click on the ``Locations: total`` cell.
ko: 분류법이나 접근법보다는 정원 위치에 초점을 맞추면 ''위치: 총계'' 셀을 클릭하게 된다.

source: Reports are produced by a report engine, making use of a report template. Ghini relies upon two different report engines (Mako & XSL), and offers several report templates, meant as usable examples.
ko: 보고서는 보고서 템플릿을 사용하여 보고서 엔진에 의해 생성됩니다. Ghini는 두 개의 다른 보고서 엔진(Mako & XSL)에 의존하며 사용 가능한 예로서 여러 보고서 템플릿을 제공한다.

source: Choose the report you need, specify parameters if required, and produce the report. Ghini will open the report in the associated application.
ko: 필요한 리포트를 선택하고 필요한 경우 매개 변수를 지정한 다음 리포트를 생성합니다. Ghini가 관련 응용 프로그램에서 보고서를 엽니다.

source: Configuring report templates, that's a task for who installs and configures ghini at your institution. Basically, you create a template name, indicating the report engine and specifying the template. Configured templates are static, once configured you are not expected to alter them. Only the special ``**scratch**`` template can be modified on the fly.
ko: 보고서 템플릿을 구성하는 작업은 기관에 기니를 설치하고 구성하는 사용자를 위한 작업입니다. 기본적으로 보고서 엔진을 나타내고 템플릿을 지정하는 템플릿 이름을 생성합니다. 구성된 템플릿은 정적 템플릿이므로 일단 구성한 후에는 변경할 필요가 없습니다. 특수 ``**스크래치**" 템플릿만 즉시 수정할 수 있다.

source: The remainder of this page provides technical information and links regarding the formatter engines, and gives hints on writing report templates. Writing templates comes very close to writing a computer program, and that's beyond the scope of this manual, but we have hints that will definitely be useful to the interested reader.
ko: 이 페이지의 나머지 부분에서는 포맷터 엔진에 대한 기술 정보와 링크를 제공하고 보고서 템플릿 작성에 대한 힌트를 제공합니다. 쓰기 템플릿은 컴퓨터 프로그램 작성에 매우 가까우며, 이 매뉴얼의 범위를 벗어납니다. 하지만 관심 있는 독자들에게는 분명히 유용할 힌트를 가지고 있습니다.

source: Using the Mako Report Formatter
es: Uso del formateador de informes Mako
it: Utilizzando il formattatore di Report di Mako
ko: Mako Report Formatter 사용

source: The Mako report formatter uses the Mako template language for generating reports. More information about Mako and its language can be found at `makotemplates.org <http://www.makotemplates.org>`_.
es: El formateador de informes Mako utiliza su propio idioma de plantilla para generar informes. Puede encontrar más información sobre el Mako y su lenguaje en `makotemplates.org <http://www.makotemplates.org>`_
it: Il formattatore di relazione Mako utilizza il linguaggio del modello di Mako per la generazione di report. Ulteriori informazioni su Mako e il suo linguaggio si trovano sul sito `makotemplates.org <http://www.makotemplates.org>`_.
ko: Mako 보고서 포맷터는 보고서를 생성하기 위해 Mako 템플릿 언어를 사용합니다. 마코와 그 언어에 대한 자세한 내용은 http://www.makotemplates.org에서 확인할 수 있다.

source: The Mako templating system should already be installed on your computer if Ghini is installed.
es: El sistema de plantillas de Mako ya debería estar instalado en su equipo si está instalado Ghini.
it: Il sistema di template Mako dovrebbe già essere installato sul tuo computer se è installato Ghini.
ko: Ghini가 설치된 경우 컴퓨터에 Mako 템플릿 시스템이 이미 설치되어 있어야 합니다.

source: Creating reports with Mako is similar in the way that you would create a web page from a template. It is much simpler than the XSL Formatter(see below) and should be relatively easy to create template for anyone with a little but of programming experience.
es: Creación de informes con Mako es similar en lo que sería crear una página web desde una plantilla. Es mucho más simple que la Formatter(see below) XSL y debería ser relativamente fácil de crear plantilla para cualquier persona con un poco pero de experiencia de programación.
it: Creazione di report con Mako è simile nel modo in cui si creerà una pagina web da un modello. È molto più semplice di Formatter(see below) il XSL e dovrebbe essere relativamente facile creare un modello per chiunque con un po ' ma di esperienza di programmazione.
ko: Mako를 사용하여 리포트를 생성하는 방법은 템플릿에서 웹 페이지를 생성하는 방법과 유사합니다. XSL Formatter(아래 참조)보다 훨씬 간단하며, 프로그래밍 경험이 적은 사람을 위한 템플릿을 만드는 것이 비교적 쉬워야 한다.

source: The template generator will use the same file extension as the template which should indicate the type of output the template with create. For example, to generate an HTML page from your template you should name the template something like `report.html`. If the template will generate a comma separated value file you should name the template `report.csv`.
es: El generador de la plantilla produce archivos con la misma extensión que la plantilla. Por ejemplo, para generar una página HTML, el nombre de su plantilla debe ser algo como 'report.html'. Si la plantilla generará un archivo de valor separado por comas, nombre la plantilla 'report.csv'.
ko: 템플릿 생성기는 템플릿과 동일한 파일 확장명을 사용하며 템플릿 생성 시 출력 유형을 나타냅니다. 예를 들어 템플릿에서 HTML 페이지를 생성하려면 템플릿의 이름을 'report.html'과 같이 지정해야 합니다. 템플릿에서 쉼표로 구분된 값 파일을 생성하는 경우 템플릿의 이름을 'report.csv'로 지정해야 합니다.

source: The template will receive a variable called `values` which will contain the list of values in the current search.
es: La plantilla va a recibir una variable llamada 'valores' que contendrán la lista de valores en la búsqueda actual.
it: Il modello riceverà una variabile denominata 'valori' che conterranno l'elenco di valori nella ricerca attuale.
ko: 템플릿은 현재 검색의 값 목록을 포함하는 'values'라는 변수를 수신합니다.

source: The type of each value in `values` will be the same as the search domain used in the search query. For more information on search domains see :ref:`search-domains`.
es: El tipo de cada valor en los 'valores' será el mismo que el dominio de búsqueda utilizado en la consulta de búsqueda. Para más información sobre dominios de búsqueda ver: ref: 'dominios de búsqueda'.
it: Il tipo di ogni valore in 'valori' sarà lo stesso come il dominio di ricerca utilizzato nella query di ricerca. Per ulteriori informazioni su domini di ricerca vedere: ref: domini di ricerca.
ko: 값에서 각 값의 유형은 검색 질의에 사용되는 검색 도메인과 동일합니다. 검색 도메인에 대한 자세한 내용은 다음을 참조하십시오.

source: If the query does not have a search domain then the values could all be of a different type and the Mako template should prepared to handle them.
es: Si la consulta no tiene un dominio de búsqueda, los valores pueden ser de diferente tipo y la plantilla de Mako debe preparan para manejarlas.
it: Se la query non dispone di un dominio di ricerca quindi tutti i valori possono essere di diverso tipo e il modello di Mako dovrebbe preparare per gestire loro.
ko: 쿼리에 검색 도메인이 없는 경우 값은 모두 다른 유형일 수 있으며 Mako 템플릿이 이를 처리할 준비를 해야 합니다.

source: Using the XSL Report Formatter
es: Utilizar al formateador de informe XSL
it: Utilizzando il formattatore di Report XSL
ko: XSL 보고서 포맷터 사용

source: The XSL report formatter requires an XSL to PDF renderer to convert the data to a PDF file. Apache FOP is is a free and open-source XSL->PDF renderer and is recommended.
es: El formateador XSL Informe requiere una XSL para el representador PDF para convertir los datos en un archivo PDF. Apache FOP es un XSL-> representador de PDF gratuito y de código abierto y es recomendado.
it: Il formattatore di relazione XSL richiede un XSL per renderer PDF per convertire i dati in un file PDF. Apache FOP è è un libero e open-source XSL-> renderer PDF ed è consigliato.
ko: XSL 보고서 포맷터에는 데이터를 PDF 파일로 변환하려면 XSL에서 PDF 렌더러가 필요합니다. Apache FOPis는 자유-오픈 소스 XSL->PDF 렌더러이며 권장된다.

source: If using Linux, Apache FOP should be installable using your package manager. On Debian/Ubuntu it is installable as ``fop`` in Synaptic or using the following command::
es: Si utiliza Linux, Apache FOP debe ser usando su gestor de paquetes instalable. En Debian/Ubuntu es instalable como '' fop'' en Synaptic o usando el siguiente comando::
it: Se si utilizza Linux, Apache FOP dovrebbe essere installabile utilizzando il vostro gestore di pacchetti. Su Debian/Ubuntu è installabile come 'fop ' in Synaptic o utilizzando il comando seguente::
ko: Linux를 사용하는 경우 Apache FOP는 패키지 관리자를 사용하여 설치할 수 있어야 합니다. Debian/Ubuntu에서는 다음 명령을 사용하여 "opp"로 설치할 수 있습니다::
uk: При використанні Linux, Apache FOP повинен бути встановлений за допомогою менеджера пакетів. В Debian/Ubuntu це встановлювана як ``fop`` в Synaptic або за допомогою наступної команди ::

source: Installing Apache FOP on Windows
es: Instalación de Apache FOP en Windows
it: L'installazione di Apache FOP su Windows
ko: 윈도우즈에 Apache FOP 설치
uk: Установка Apache FOP на Windows

source: You have two options for installing FOP on Windows. The easiest way is to download the prebuilt `ApacheFOP-0.95-1-setup.exe <http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q=#makechanges>`_ installer.
es: Tienes dos opciones para la instalación de FOP en Windows. La forma más sencilla es descargar su instalador `ApacheFOP-0.95-1-setup.exe <http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q=#makechanges >`_.
it: Ci sono due modi per installare FOP su Windows. Il più semplice è scaricando il precompilato `ApacheFOP-0.95-1-setup.exe <http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q=#makechanges >`_.
ko: Windows에 FOP를 설치하는 두 가지 옵션이 있습니다. 가장 쉬운 방법은 미리 제작된 ApacheFOP-0.95-1- 설정을 다운로드하는 것이다.exe http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q= #make changes''_ 설치 관리자.
uk: У вас є два варіанти установки FOP на Windows. Найпростіший спосіб це завантажити скомпільований `ApacheFOP-0.95-1-setup.exe <http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q=#makechanges>`_ installer.

source: Alternatively you can download the `archive <http://www.apache.org/dist/xmlgraphics/fop/binaries/>`_. After extracting the archive you must add the directory you extracted the archive to to your PATH environment variable.
es: En alternativa, puede descargar el `fichero <http://www.apache.org/dist/xmlgraphics/fop/binaries/>`_. Tras descomprimir el fichero debe añadir el directorio extraído a su variable de entorno PATH.
it: In alternativa è possibile scaricare `l'archivio <http://www.apache.org/dist/xmlgraphics/fop/binaries/>`_. Dopo l'estrazione dell'archivio è necessario aggiungere al PATH la directory dove è stato estratto l'archivio.
ko: 또는 http://www.apache.org/dist/xmlgraphics/fop/binaries/'을 다운로드할 수 있습니다. 보관 파일을 추출한 후 보관 파일을 추출한 디렉토리를 PATH 환경 변수에 추가해야 합니다.
uk: В якості альтернативи ви можете скачати `archive <http://www.apache.org/dist/xmlgraphics/fop/binaries/>`_. Після вилучення архіву ви повинні додати каталог, розпакував архів в змінну PATH середовища.

source: Searching in Ghini
es: Buscar en Ghini
it: Ricerca in Ghini
ko: 기니에서 검색
uk: Пошук в Ghini
