Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: In this case, when the species gets identified (and it could even be a species nova), we directly edit the species, so all accessions that refer to it get the change.
es: En este caso, cuando la especie es identificada (y podría incluso ser una nueva especie), editamos directamente la especie, así que todas sus accesiones recibirán el cambio.
ko: 이 경우, 종들이 식별되면(그리고 종노바일 수도 있음) 우리는 종을 직접 편집할 수 있습니다. 그래서 그것을 가리키는 모든 접근법이 변화를 가져올 수 있습니다.
uk: У цьому випадку, коли вид ідентифікується (і це може бути навіть видом nova), ми безпосередньо редагуємо вид, тому всі приєднання, які належать до нього, отримують зміни.

source: A new plants is relative to a species not yet in our collection.
es: Una nueva planta es relativa a una especie que todavía no está en nuestra colección.
ko: 새로운 식물은 아직 우리 수집품에서 볼 수 없는 종에 상대적이다.
uk: Нові рослини відносяться до виду, ще не в нашій колекції.

source: Last minute species
es: Especie de último minuto
ko: 마지막 종
uk: Остання хвилина видів

source: We start this from the Accession window and it's very simple, just click on the **+** next to the species name, we get into the Species window.
es: Comenzamos este de la Ventana de Accesiones y es muy sencillo, simplemente haga clic en el **+** al lado del nombre de la especie, nos metemos en la Ventana de Especie.
ko: 마지막 종등록 창에서 시작하면 매우 간단합니다. 종 이름 옆에 있는 **+***를 클릭하면 종 창이 나타납니다.
uk: Ми починаємо це з вікна приєднання, і це дуже просто, просто натисніть **+** поруч із назвою виду, ми потрапляємо у вікно види.

source: Adding a species and using online taxonomic services
es: Añadir una especie y utilizar servicios taxonómicos en línea
ko: 종 추가 및 온라인 분류 서비스 사용
uk: Додавання виду та використання онлайн-таксономічних послуг

source: Adding a new species — the plant list.
es: Añadir una nueva especie — the plant list.
ko: 새로운 종(식물 목록)을 추가합니다.
uk: Додавання нового виду - список рослин.

source: We start the obvious way: type the genus epithet, possibly select it from the completion list, then type the species epithet, or at least your best guess.
es: Empezamos la manera obvia: insertar el epíteto de género, posiblemente lo seleccione de la lista de finalización, luego el epíteto de la especie, o al menos su mejor aproximación.
ko: 우리는 명확한 방법을 시작합니다. 속명을 입력하고, 완성 목록에서 선택한 다음, 종족속명을 입력합니다. 아니면 적어도 당신의 최선의 추측입니다.
uk: Ми починаємо очевидний спосіб: наберіть епітет родини, можливо, виділіть його з списку завершень, потім введіть епітет виду або, принаймні, найкращий припущення.

source: Next to the species epithet field there's a small button, |green_ball|, which connects us to the plant list. Click on it, a message area appears at the top of the window.
es: Al lado del campo del epíteto de especie hay un pequeño botón, |green_ball|, que nos une a theplantlist. Haga clic en él, un área de mensajes aparece en la parte superior de la ventana.
ko: 종들의 묘지 옆에는 작은 버튼인 |green_ball|이 있는데, 이것은 우리를 식물 목록에 연결시켜줍니다. 이 옵션을 클릭하면 창 맨 위에 메시지 영역이 나타납니다.
uk: Поруч із видом епітетного поля є маленька кнопка, |green_ball|, яка з'єднує нас із списком рослин. Натисніть на неї, у верхній частині вікна з'явиться повідомлення.

source: Depending on the speed of your internet connection, but also on how close your best guess is to a correct published name, the top area will change to something like this:
es: Dependiendo de la velocidad de su conexión a internet, pero también de qué tan cerca su conjetura de un nombre correcto publicado, la zona superior cambiará a algo como esto:
ko: 인터넷 연결 속도와 올바른 게시 이름에 대한 추측이 얼마나 가까운지에 따라 맨 위 영역이 다음과 같은 내용으로 변경됩니다:
uk: Залежно від швидкості вашого інтернет-з'єднання, а також від того, наскільки правильно опубліковане ім'я, верхня область зміниться на щось подібне:

source: Accept the hint and it will be as if you had typed the data yourself.
es: Aceptar la sugerencia y será como si usted hubiera escrito los datos usted mismo.
ko: 힌트를 수락하면 데이터를 직접 입력한 것처럼 됩니다.
uk: Прийміть підказку, і це буде так, ніби ви самі набрали дані.

source: Reviewing a whole selection — TNRS.
es: Revisar una selección entera — TNRS.
ko: 전체 선택 항목 검토 - TNRS.
uk: Перегляд цілого вибору - TNRS.

source: This is described in the manual, it's extremely useful, don't forget about it.
es: Esto se describe en el manual, es muy útil, no se olvide de él.
ko: 이것은 매뉴얼에 설명되어 있습니다. 매우 유용하죠. 잊지 마세요.
uk: Це описано в посібнику, це надзвичайно корисно, не забувайте про це.

source: Let the database fit the garden
es: Que la base de datos refleje lo que es el jardín
ko: 데이터베이스가 정원에 맞도록 두십시오
uk: Нехай база даних підходить до саду

source: A never-ending task is reviewing what we have in the garden and have it match what we have in the database.
es: Una tarea interminable es revisar lo que tenemos en el jardín para que coincida con lo que tenemos en la base de datos.
ko: 끝없는 과제는 정원에 있는 것을 검토하고 데이터베이스에 있는 것과 일치하도록 하는 것입니다.
uk: Невичерпне завдання - переглянути те, що ми маємо в саду, і поєднати його з базами.

source: Initial status and variable resources
es: Estado inicial y recursos variables
ko: 초기 상태 및 가변 리소스
uk: Початковий статус і змінні ресурси

source: When we adopted ghini, we imported into it all that was properly described in a filemaker database. That database focused solely on Orchids and even so it was far from complete. In practice, we still meet labeled plants in the garden which have never been inserted in the database.
es: Cuando adoptamos ghini, importamos en él todo lo que teníamos en una base de datos filemaker. Esa base de datos se centraba únicamente en orquídeas y aún así estaba lejos de ser completa. En la práctica, nos encontramos todavía con plantas etiquetadas en el jardín que nunca se han insertado en la base de datos.
ko: Ghini를 채택했을 때 파일메이커 데이터베이스에 제대로 설명되어 있는 모든 것을 가져왔습니다. 그 데이터베이스는 오직 난초에만 초점을 맞추었고 심지어 그것은 완전하지 않았다. 실제로, 우리는 여전히 데이터베이스에 삽입된 적이 없는 정원에서 라벨이 붙은 식물들을 만납니다.
uk: Коли ми прийняли ghini, ми імпортували в це все, що правильно описано в базі даних файлових виробників. Ця база даних орієнтувалася виключно на Орхідеї, і навіть це було далеко не повне. На практиці ми все ще зустрічаємо помічені рослини в саду, які ніколи не були вставлені в базу даних.

source: From time to time, we manage to get resources to review the garden, comparing it to the collection in the database, and the main activity is to insert accession codes to the database, take pictures of the plant in question, and note its location, all tasks that are described in the remainder of this section.
es: De vez en cuando, logramos obtener recursos para revisar el jardín, comparándolo con la colección en la base de datos, y la principal actividad es insertar códigos de accesión a la base de datos, tomar fotos de la planta en cuestión y anotar su ubicación, todas tareas que se describen en el resto de esta sección.
ko: 때때로, 우리는 데이터베이스의 수집과 비교하여 정원을 검토할 자원을 얻는데, 주요 활동은 데이터베이스에 등록 코드를 삽입하고, 문제의 공장의 사진을 찍고, 그 위치를, 이 절의 나머지 부분에 설명된 모든 작업에 주목하는 것이다.
uk: Час від часу нам вдається отримати ресурси для перегляду саду, порівняння його з колекцією в базі даних, а головна діяльність полягає в тому, щоб вставити коди приєднання до бази даних, сфотографувати цю установку та помітити її місце розташування, Всі завдання, описані в решті частини цього розділу.

source: The small Android app ghini.pocket was added to the Ghini family while a Ghini programmer was here in Quito. It helps us take a snapshot of the database in our pocket while walking in the garden, but it also allows for a very swift inventory procedure.
es: La pequeña aplicación android ghini pocket fue añadida a la familia Ghini en ocasión de una visita de un programador Ghini al Jardín Botánico de Quito. ghini.pocket nos permite llevarnos en el bolsillo una copia reducida del contenido de la base datos, pero también nos facilita la rápida realización de un inventario
ko: 작은 안드로이드 appghini.기니 프로그래머가 여기 키토에 있는 동안 주머니가 기니 가족에 추가되었어요 그것은 우리가 정원을 산책하는 동안 주머니에 있는 데이터베이스의 스냅샷을 만들도록 도와주지만, 또한 매우 신속한 재고 조사를 가능하게 한다.
uk: Невеликий застосунок ghini.pocket для Android був доданий до сім'ї Ghini, коли програміст Ghini був тут у Кіто. Це допомагає нам зробити знімок бази даних на місці під час прогулянки в саду, також це дозволяє дуже швидку інвентаризацію.

source: Inventory procedure
es: Procedimiento de Inventario
ko: 재고처리절차
uk: Процедури інвентаризації

source: We start ghini.pocket, we write down the name of the location where we will be conducting the inventory, for example (INV 1) for greenhouse 1. We enter (type or scan if the plant has bar code or QR code) the accession code and we look it up in ghini.pocket.
es: Ingresamos a ghini.pocket, anotamos el nombre de la locación donde se estará realizando el inventario. Ejem (INV 1) para invernadero 1. Anotamos o escaneamos la accesión (si la planta cuenta con código de barra o código QR) y se realiza la búsqueda.
ko: 기니를 시작합니다.포켓, 우리는 우리가 재고를 진행할 장소의 이름을 적습니다. 예를 들면 (INV 1) 온실 1의 경우입니다. 우리는 등록 코드를 입력하고(공장에 바코드 또는 QR 코드가 있는 경우 입력 또는 스캔) 기니로 조회합니다.호주머니에 넣다.
uk: Запускаючи ghini.pocket, ми записуємо назву місця, де ми будемо проводити інвентаризацію, наприклад (INV 1) оранжереї 1. Ми вводимо (тип або сканування, якщо на рослині є штрих-код або QR-код) код приєднання, і ми розглянемо його в ghini.pocket.

source: A side effect of performing the search is that ghini.pocket writes the date with time, location and the code looked for in a text file that can later be imported into the database.
es: Ghini.pocket marca la fecha con horario, la ubicación, el código buscado en un archivo textual que luego podrá ser importado a la base de datos.
ko: 검색을 수행하는 것의 부작용은 바로 그 기니이다.pocket은 나중에 데이터베이스로 가져올 수 있는 텍스트 파일에서 찾은 시간, 위치 및 코드를 사용하여 날짜를 기록합니다.
uk: Побічним ефектом виконання пошуку є те, що ghini.pocket записує дату з часом, розташуванням та пошуковим кодом у текстовому файлі, який пізніше можна буде імпортувати до бази даних.

source: For a greenhouse with around 1000 plants our estimates suggest you will need two days, working at relaxed pace, from 8:00 am to 5:00 pm.
es: Para un invernadero con alrededor de 1000 plantas el tiempo estimado a realizarse es de dos días, en un horario de 8:00 am a 5:00 pm, trabajando sin apuro.
ko: 약 1000개의 식물이 있는 온실의 경우, 오전 8시부터 오후 5시까지 이틀간 느긋한 속도로 작업해야 합니다.
uk: Для оранжереї приблизно з 1000 рослин наші оцінки вказують на те, що вам доведеться спокійно працювати два дні з 8:00 до 17:00.

source: After having imported the file generated by ghini.pocket, it is easy to reveal which plants are missing. For example: If we did the inventory of the INV3 from 4 to 5 September, this is the corresponding search::
es: Luego de haber importado el archivo generado por ghini.pocket, es fácil evidenciar cuales plantas faltan. Por ejemplo: si hicimos el inventario del INV3 del 4 al 5 de septiembre, la búsqueda correspondiente es::
ko: ghini에서 생성한 파일을 가져온 후.주머니, 어떤 식물이 없어졌는지 밝히는 것은 쉽다. 예를 들어: 만약 우리가 9월 4일부터 5일까지 INV3의 재고를 했다면, 이것은 해당 검색입니다:
uk: Після імпорту файлу, створеного ghini.pocket, легко з'ясувати, які рослини відсутні. Наприклад: якщо ми провели інвентаризацію INV3 з 4 по 5 вересня, це відповідний пошук::

source: All of these plants can be marked as dead, or lost, according to garden policy.
es: Todas estas plantas se pueden marcar como pérdidas o muertas, según decida el Jardín.
ko: 이 모든 식물들은 정원 정책에 따라 죽거나 잃어버린 것으로 표시될 수 있다.
uk: Усі ці рослини можуть бути позначені як мертві або втрачені відповідно до садової політики.

source: Visualizing the need of taxonomic attention
es: Evidenciar la necesidad de identificación taxonómica.
ko: 분류학적 주의의 필요성 시각화
uk: Візуалізуючи потребу таксономічної уваги

source: Our protocol includes one more detail intended to visually highlight plants that need the attention of a taxonomist.
es: Nuestro protocolo incluye otro detalle pensado para evidenciar las plantas que necesitan la atención de un taxónomo.
ko: 우리의 프로토콜은 분류학자의 주의가 필요한 식물을 시각적으로 강조하기 위한 한 가지 세부 사항을 포함한다.
uk: Наш протокол містить ще одну деталь, призначену для візуального виділення рослин, які потребують уваги таксономіста.

source: A plant that only appears in our data base identified at family level or that wasn't yet the database receives a visual signal (e.g.: a wooden or plastic stick, for ice cream or french fries), to highlight that it is not identified. In this way the taxonomist in charge, when making a tour of the greenhouse can quickly spot them and possibly proceed to add their identification in the database.
es: Las plantas que solo aparezcan en nuestra base de datos identificadas a nivel familia o que no estaban en la base de datos reciben una señal visual (por ejemplo: un palito plástico o de madera para paletas o papas fritas), para resaltar que no está identificada y de esta forma el taxónomo o encargado cuando realice un recorrido por el invernadero pueda identificarlas y proceder a agregar la identificación en la base de datos.
ko: 가족 수준에서 확인되거나 아직 확인되지 않은 데이터베이스에만 나타나는 식물은 식별되지 않음을 강조하기 위해 시각적 신호(예: 아이스크림 또는 감자튀김용 나무 막대기 또는 플라스틱 막대기)를 수신합니다. 이런 방식으로 담당 분류학자는 온실 여행을 할 때 그들을 신속하게 발견할 수 있고 데이터베이스에 그들의 신원을 추가하는 것을 계속할 수 있다.
uk: Це рослина, що з'являється лише в нашій базі даних, ідентифікованій на рівні сім'ї, або це ще не база даних отримує візуальний сигнал (наприклад, дерев'яна або пластмасова палиця, для морозива або фрі), щоб підкреслити, що це не ідентифіковано. Таким чином, відповідальний таксоном, під час екскурсії по оранжереї, може швидко їх помістити і, можливо, продовжувати додавати свою ідентифікацію в базу даних.

source: Naming convention in garden locations
es: Convención de nombres en lugares del jardín
ko: 정원 위치에서 명명 규칙
uk: Найменування конвенції в місцях саду

source: description
es: descripción
ko: 묘사
uk: опис

source: Reserved to cactus plants next to the orchids exposition glasshouses.
es: Solo las cactáceas afuera de los orquidearios en el jardín
ko: 난초 전시장 옆에 선인장 식물에 보관되어 있습니다.
uk: Резервний для рослин кактуса поряд з експозицією орхідей теплиць.

source: Nepenthaceae exibition
es: Exposición de Nepenthaceae
ko: 네펜타과 전시
uk: Виявлення непентаних

source: orquidearios de calor en el jardín (1A a 9C son lugares especificos entre del orquideario)
ko: 정원(AA)에서 9C까지의 열 저장고들이 아주 특별합니다
uk: теплі орхідеї в саду (від 1А до 9С є конкретні місця між орхідею)

source: orquidearios de frío en el jardín (1A a 5I son lugares específicos dentro del orquideario)
ko: 정원에서 냉각 장치로 사용할 수 있게 되었습니다
uk: холодні орхідеї в саду (від 1А до 5I - конкретні місця в саду орхідей)

source: invernadero 1 (calor)
ko: 온실 1층
uk: теплиця 1 (тепло)

source: invernadero 2 (frío)
ko: 온실 2
uk: теплиця 2 (холодно)

source: invernadero 3 (calor)
ko: 온실 3호실
uk: теплиця 3 (тепло)

source: Adding an Accession for a Plant
es: Añadir una accesión para una planta
ko: 플랜트에 대한 등록 추가
uk: Додавання приєднання для рослини

source: Obviously we keep increasing our collection, with plants coming from commercial sources, or collected from the wild, more rarely coming from expeditions to remote areas of our country, or we receive plants which were illegally collected.
es: Obviamente seguimos incrementando nuestra colección, con plantas provenientes de fuentes comerciales, o recolectados de la naturaleza, más raramente procedentes de expediciones a zonas remotas de nuestro país, o recibimos plantas que fueron recolectadas ilegalmente.
ko: 분명히 우리는 우리의 수집량을 계속 늘려가고 있습니다. 상업적인 근원으로부터 또는 야생에서 채집된 식물들은, 원정에서 우리 나라의 외딴 지역으로 더 드물게, 또는 불법적으로 채집된 식물들을 더 많이 받습니다.
uk: Очевидно, що ми продовжуємо збільшувати свою колекцію, коли рослини надходять із комерційних джерел або збираються з дикої природи, рідше виходять з експедицій у віддалені райони нашої країни, або ми отримуємо рослини, які були незаконно зібрані.

source: Sometimes we have to add plants to the digital collection, just because we have them physically, found in the garden, with or without its label, but without their digital counterpart.
es: A veces tenemos que añadir plantas a la colección digital, sólo porque las tenemos físicamente, se encuentran en el jardín, con o sin su etiqueta, pero sin sus contrapartes digitales.
ko: 때때로 우리는 식물을 디지털 컬렉션에 추가해야 합니다. 왜냐하면 식물들이 물리적으로 정원에서 발견되기 때문입니다. 라벨이 있든 없든 말이죠. 하지만 그들의 디지털 컬렉션은 없습니다.
uk: Іноді доводиться додавати рослини до цифрової колекції, лише тому, що ми їх фізично знаходимо в саду з міткою або без неї, але без їхнього цифрового аналога.

source: Existing plant, found in the garden with its own label
es: Planta existente, se encuentra en el jardín con su propia etiqueta
ko: 기존 식물, 자체 라벨이 부착된 정원에서 발견됨
uk: Існуюча рослина, знайдена в саду з власною етикеткою

source: This activity starts with a plant, which was found at a specific garden location, an accession label, and the knowledge that the accession code is not in the database.
es: Esta actividad comienza con una planta, que se encuentra en una ubicación específica del jardín, con una etiqueta accesión y con el conocimiento de que el código de accesión no está en la base de datos.
ko: 이 활동은 특정 정원 위치, 등록 레이블 및 데이터베이스에 없는 등록 코드에서 발견된 식물에서 시작됩니다.
uk: Ця діяльність починається з рослини, яка була знайдена у певному місці саду, а також знак приєднання та знання про те, що код входження не знаходиться в базі даних.

source: For this example, let's assume we are going to insert this information in the database.
es: Para este ejemplo, supongamos que se va a insertar la siguiente información en la base de datos.
ko: 이 예에서는 이 정보를 데이터베이스에 삽입한다고 가정합니다.
uk: Для цього прикладу, припустимо, ми будемо вставляти цю інформацію в базу даних.

source: Accession
es: Accesión
it: Accessione
ko: 억세션
uk: Приєднання

source: Species
es: Especie
it: Specie
ko: 종명
uk: Вид

source: Location
es: Ubicación
it: Collocazione
ko: 위치명
uk: Розташування

source: Invernadero 1 (calor)
ko: 1온실
uk: Теплиця 1 (тепло)

source: We go straight into the Accession Editor, start typing the species name in the corresponding field. Luckily, the species was already in the database, otherwise we would use the **Add** button next to the entry field.
es: Vamos directamente en el Editor de Accesión, comienzo escribiendo el nombre de la especie en el campo correspondiente. Por suerte, la especie estaba ya en la base de datos, de lo contrario utilizaría el botón **agregar** junto al campo de entrada.
ko: 등록 편집기로 바로 들어가서 해당 필드에 종 이름을 입력하기 시작합니다. 다행히도, 그 종은 이미 데이터베이스에 있었고, 그렇지 않으면 우리는 입력 필드 옆에 있는 **추가** 버튼을 사용할 것이다.
uk: Ми йдемо прямо в редактор приєднання, починаємо вводити назву виду у відповідному полі. На щастя, цей вид вже був у базі даних, інакше ми використали б кнопку **Додати** біля поля введення.

source: We select the correct species, and we fill in a couple more fields, leaving the rest to the default values:
es: Seleccionamos las especies correctas y llenamos unos campos más, dejando el resto a los valores por defecto:
ko: 올바른 종을 선택하고 필드를 몇 개 더 채우고 나머지는 기본값으로 둡니다:
uk: Ми вибираємо правильний вид, і ми заповнюємо ще пару полів, залишивши решту до значень за замовчуванням:

source: Accession ID
es: ID de la accesión
it: ID delle Accessioni
ko: 억세션 ID
uk: ID приєднання

source: Type of Material
es: Tipo de Material
ko: 재료 유형
uk: Тип матеріалу

source: Quantity
es: Cantidad
ko: 수량
uk: Кількість

source: Provenance
es: Procedencia
ko: 도입처, 원산지
uk: Походження

source: Unknown
es: Desconocido
ko: 모름
uk: Невідомо

source: After this, we continue to the Plant editor, by clicking on **Add Plants**.
es: Después de esto, seguimos en el editor de planta, haciendo clic en **Añadir plantas**.
ko: 그런 다음 **식물 추가**를 클릭하여 공장 편집기로 이동합니다.
uk: Після цього ми продовжуємо в редакторі рослин, натиснувши кнопку **Додати рослини**.

source: We do not fill in the Accession's "**Intended Locations**", because we don't know what was the original intention when the plant was first acquired.
es: No llenamos en la accesión los "**lugares previsto**", porque no sabemos cuál fue la intención original cuando la planta fue adquirida en primer lugar.
ko: 우리는 그 식물이 처음 인수되었을 때 원래의 의도가 무엇이었는지 모르기 때문에 등록소의 "**의 의도된 위치**"를 작성하지 않는다.
uk: Ми не заповнюємо "**Призначені місця розташування**" приєднання, тому що ми не знаємо, що було первісним наміром, коли рослина була вперше придбана.

source: In the Plant Editor, we insert the Quantity and the Location. And we're done.
es: En la Planta Editor, podemos insertar la Cantidad y la Ubicación. Y hemos terminado.
ko: 식물 편집기에서 수량 및 위치를 삽입합니다. 그리고 우리는 끝났다.
uk: У редакторі рослин ми вставляємо кількість та місце. І ми закінчили.

source: The plant is now part of the database:
es: La planta es ahora parte de la base de datos:
ko: 식물은 이제 데이터베이스의 일부가 되었습니다:
uk: Рослина тепер є частиною бази даних:

source: New accession: plant just entering the garden
es: Planta formando un nuevo ingreso en la colección
ko: 새 등록: 정원에 막 들어오는 식물
uk: Нове приєднання: рослина просто входить у сад

source: This activity starts with a new Plant, just acquired from a known Source, a plant label, and an intended Location in the garden.
es: Esta actividad comienza con una nueva planta, que se acaba de adquirir de una fuente conocida, una etiqueta de la planta y una ubicación deseada en el jardín.
ko: 이 활동은 알려진 소스, 식물 라벨 및 정원의 의도된 위치로부터 방금 획득한 새 식물에서 시작됩니다.
uk: Ця діяльність починається з нової рослини, яка тільки що придбана від відомого джерела, ярлик рослини та передбачуваного розташування в саду.

source: We mostly do the same as for the case that a plant is found in the garden, there are two differences: (1) we know the source of the plant; (2) acquiring this plant was a planned action, and we intend to place it at a specific location in the garden.
es: Aquí hacemos más o menos lo mismo que para el caso de una planta que ya se encuentra en el jardín, hay dos diferencias: (1) conocemos la fuente de la planta; (2) adquirir esta planta fue una acción planificada, y tenemos la intención de colocarlo en un lugar específico en el jardín.
ko: 우리는 대부분 정원에서 식물이 발견되었을 때와 같은 경우, 두 가지 차이가 있다. (1) 우리는 식물의 근원을 알고 있다. (2) 이 식물을 획득하는 것은 계획된 행동이었고, 우리는 그것을 정원의 특정 위치에 배치하려고 한다.
uk: Ми в основному робимо те ж саме, що і в тому випадку, коли рослина знаходиться в саду, є дві відмінності: (1) ми знаємо джерело рослини; (2) придбання цієї рослини було планованим заходом, і ми маємо намір розмістити його в певному місці в саду.

source: Again, we go straight into the Accession Editor, start typing the species and we either select if from the completion list or we add it on the fly.
es: De nuevo, vamos directamente en al Editor de Accesión, comenzamos escribiendo el binomial de la especie y seleccionamos de la lista de las correspondencias, o añadir sobre la marcha.
ko: 다시 등록 편집기로 들어가 종을 입력하기 시작하고 완료 목록에서 원하는 항목을 즉시 추가할지 선택합니다.
uk: Знову ж таки ми йдемо прямо в редактор приєднання, починаємо вводити вид, і ми обираємо з списку завершень або додаємо його на льоту.

source: Source
es: Fuente
it: Fonte
ko: 소스
uk: Джерело

source: specified
es: especificado
ko: 명시된
uk: точно визначений

source: In the Plant Editor, we insert the Quantity and the Location.
es: En el Editor de Planta, insertamos la Cantidad y la Ubicación.
ko: 식물 편집기에서 수량 및 위치를 삽입합니다.
uk: У редакторі рослин ми вставляємо кількість та місце.

source: Please note that the plant may be initially placed in a greenhouse, before it reaches its intended location in the garden.
es: Tenga en cuenta que la planta puede ser colocada inicialmente en un invernadero, antes de que llegue su lugar previsto en el jardín.
ko: 화초가 정원에서 의도된 위치에 도달하기 전에 먼저 온실에 배치될 수 있다는 점에 유의하십시오.
uk: Зверніть увагу, що рослина може бути спочатку розміщена у теплиці, перш ніж вона досягне передбачуваного місця розташування в саду.

source: Existing plant, found in the garden without its label
es: Planta existente, en el jardín sin su etiqueta
ko: 기존 식물, 라벨 없이 정원에서 발견
uk: Існуюча рослина, знайдена в саду без етикетки
