Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Exporting *Species* will only export the complete taxonomic information in your database. *Accession* will export all your accessions plus all the taxonomic information it refers to: unreferred to taxa will not be exported. *Plant* will export all living plants (some accession might not be included), all referred to locations and taxa.
es: Exportar *Especies* exportará su base de datos solo pero toda información taxonómica. Seleccionando *Accesión* se exportarán sus accesiones y toda la información taxonómica utilizada: taxones sin utilizar no se exportarán. Seleccionando *Planta* se exportarán todas las plantas vivientes (algunos accesiones pueden no ser incluidas), todos lo referido a ubicaciones y taxa.
it: Esportazione di * specie * solo esporterà le informazioni tassonomiche complete nel database. * Accessione * esporterà tutte le vostra accessioni oltre a tutte le informazioni tassonomiche si riferisce a: unreferred a taxa non verrà esportati. * Planting * esporterà tutti i viventi, piante (alcuni accessione non può essere incluso), tutti si riferiscono a posizioni e taxa.
ko: *종*을 내보내면 데이터베이스의 전체 분류 정보만 내보냅니다. *액세스*는 모든 액세스 권한과 참조되는 모든 분류 정보를 내보냅니다. taxa에 참조되지 않은 정보는 내보내지지 않습니다. *공장*은 모든 살아있는 식물(일부 등록은 포함되지 않을 수 있음)을 수출합니다. 모든 곳은 위치 및 택시입니다.
uk: Експорт *Вид* буде експортувати тільки повну класифікаційну інформацію в вашу базу даних. "Приєднання" буде експортувати всі приєднання плюс всю класифікаційну інформацію яка відноситься: необроблена для класифікації інформація не буде експортуватися. *Рослини* буде експортувати всі існуючі рослини (деякі приєднання можуть бути невключені), всі зазначені місця і класифіковані.

source: Importing from a Generic Database
it: Importare da una base dati generica
ko: 일반 데이터베이스에서 가져오기
uk: Імпортування з загальної бази даних

source: This functionality is the object of `issue #127 <https://github.com/Ghini/ghini.desktop/issues/127>`_, for which we have no generic solution yet.
es: Esta funcionalidad es objeto de la `issue #127 <https://github.com/Ghini/ghini.desktop/issues/127>`_, para que todavía no tenemos solución genérica.
it: Questa funzionalità è oggetto della `issue #127 <https://github.com/Ghini/ghini.desktop/issues/127>`_, per la quale non abbiamo ancora una soluzione generica.
ko: 이 기능은 아직 일반적인 솔루션이 없는 '이슈 #127 https://github.com/Ghini/ghini.desktop/issues/127'의 객체이다.

source: If you're interested in importing data from some flat file (e.g.: Excel spreadsheet) or from any database, contact the developers.
it: Dovendo importare dati da una tabella, da un foglio di calcolo, o da un database non compatibile con ghini, contattare un programmatore.
ko: 일부 플랫 파일에서 데이터를 가져오려는 경우(예: Excel 스프레드시트) 또는 데이터베이스에서 개발자에게 문의하십시오.

source: Importing a Pictures Collection
es: Importar una colección de imágenes
it: Importare una collezione di immagini
ko: 사진 모음 가져오기

source: We can consider a collection of plant pictures as a particular form of botanical database, in which each picture is clearly associated with one specific plant.
es: Podemos mirara a una colección de fotografías de plantas, en que cada una es claramente asociada a una sola planta, como una forma particular de base de datos botánicos.
it: Una particolare forma di base dati botanica è una collezione di fotografie, ciascuna chiaramente associata ad una specifica pianta.
ko: 우리는 식물 사진의 컬렉션을 식물 데이터베이스의 특정 형태로 고려할 수 있으며, 각 그림은 특정 식물과 명확하게 연관되어 있다.

source: Even without using a photo collection software, you can associate pictures to accessions by following one and the same clear rule when naming picture files.
es: Aún sin utilizar un software específico para colecciones de fotos, es posible asociar fotos a accesiones, respetando un mismo estilo en dar nombre a los archivos.
it: Anche senza utilizzare un software disegnato per collezioni di foto, è possibile associare foto ad accessioni attenendosi ad una stessa regola nel dare nome ai file delle foto.
ko: 사진 수집 소프트웨어를 사용하지 않더라도 사진 파일 이름을 지정할 때 하나와 동일한 명확한 규칙을 따라 사진을 액세스에 연결할 수 있습니다.

source: For example, ``2018.0020.1 (4) Epidendrum.jpg`` would be the name of the fourth picture for plant number 1 within accession 2018.0020, identified to rank genus as an Epidendrum.
es: Por ejemplo, ``2018.0020.1 (4) Epidendrum.jpg`` podría ser el nombre de la cuarta foto asociada a la planta número 1 de la accesión veinte del año 2018, y está identificada a rango género como Epidendrum.
it: Per esempio, ``2018.0020.1 (4) Epidendrum.jpg`` potrebbe essere il nome della quarta fotografia associata alla pianta numero 1 della ventesima accessione dell'anno 2018, identificato a rango genus come Epidendrum.
ko: 예를 들어, "2018.0020.1(4) Epidendrum.jpg"는 등록 2018.0020 내에서 제1공장에 대한 네 번째 그림의 이름이 될 것이며, 이는 속(속)을 Epidendrum으로 분류한 것이다.

source: The :menuselection:`Tools-->Import-->Pictures` functionality here described is meant for importing an ordered collection of plant pictures either to initialize a ghini database, or for periodically adding to it.
es: La función :menuselection:`Herramienta-->Importar-->Fotos` aquí descrita permite de utilizar una colección de fotos para inicializar una base de datos ghini, o para añadir información de forma periódica.
it: La funzione :menuselection:`Tools-->Import-->Pictures` qui descritta permette di utilizzare una collezione di foto per inizializzare una base dati ghini, o per aggiungere dati periodicamente.
ko: : 메뉴 선택:여기서 설명하는 '도구--> 가져오기--> 사진' 기능은 기니 데이터베이스를 초기화하거나 주기적으로 추가하기 위해 정렬된 플랜트 그림 컬렉션을 가져오는 것을 의미한다.

source: Use :menuselection:`Tools-->Import-->Pictures` to activate this import tool. Import goes in several steps: parameter definition; data revision and confirmation; the import step proper; finally review the import log. At the first two steps you can confirm the data and go to the next step by clicking on the ``next`` button, or you can go back to the previous step by clicking on the ``prev`` button. Once the import is done and you're reviewing the log, you can only either confirm —or abort— the whole transaction.
ko: 사용: 메뉴 선택:이 가져오기 도구를 활성화하려면 '도구-->가 필요합니다. 가져오기는 매개 변수 정의, 데이터 수정 및 확인, 가져오기 단계 적절, 마지막으로 가져오기 로그를 검토합니다. 처음 두 단계에서 데이터를 확인하고 "다음" 버튼을 클릭하여 다음 단계로 이동하거나 "사전" 버튼을 클릭하여 이전 단계로 돌아갈 수 있습니다. 가져오기가 완료되고 로그를 검토하고 나면 전체 트랜잭션을 확인하거나 중단할 수만 있습니다.

source: In the "parameter definition" pane you: select the directory from which you intend to import pictures; indicate whether to import pictures recursively; select or create a location which will be used as default location for new plants; inform the tool about the rule you've been following when naming picture files.
es: En el panel "definición parámetros" usted puede: seleccionar el directorio de que desea importar fotografías; indicar si desea importar fotos de forma recursiva; seleccionar o crear una ubicación que se utilizará como ubicación predeterminada para nuevas plantas; describir el estilo seguido para dar nombre a los archivos.
it: Nella fase di definizione parametri puoi: selezionare la directory da cui importare le foto; indicare se l'importazione va effettuata in modo ricursivo; selezionare o creare l'ubicazione da usare per le nuove piante; descrivere la regola seguita nel dare nome ai file delle foto.
ko: 매개 변수 정의 창에서 사진을 가져올 디렉토리를 선택하고, 사진을 반복적으로 가져올지 여부를 나타냅니다. 새 식물의 기본 위치로 사용할 위치를 선택하거나 만듭니다. 사진 파일의 이름을 지정할 때 따랐던 규칙에 대해 도구에 알립니다.

source: In the "data revision" pane you are shown a table with as many rows as the pictures you are importing. Each row holds as much information as the tool managed to extract from the picture name. You can review the information, correct or confirm, and indicate whether or not the row should be imported.
it: La fase di revisione consiste nel visionare una tabella con tante righe quante le foto da importare. Ogni riga contiene tanta informazione quanto il tool avrà potuto estrarre dal nome di ciascuna foto. Si può accettare ciascun campo così come definito dal tool, e si può indicare se ciascuna riga va importata o meno.
ko: 데이터 수정기호 창에서 가져올 사진만큼 행이 있는 테이블이 표시됩니다. 각 행에는 그림 이름에서 추출한 도구만큼 많은 정보가 들어 있습니다. 정보를 검토하고, 수정 또는 확인하며, 행을 가져올지 여부를 지정할 수 있습니다.

source: In the final "commit or rollback" pane you read the logs relative to your data import, and decide whether to keep them (commit them to the database), or undo them (rollback the transaction).
it: la fase finale di "commit or rollback" consiste nel visionare il rapporto dell'importazione e decidere se mantenere i cambi (commit), o rifiutarli in blocck (rollback).
ko: 마지막 "커밋 또는 롤백" 창에서 데이터 가져오기와 관련된 로그를 읽고 로그의 보관(데이터베이스에 커밋) 또는 실행 취소(트랜잭션 롤백) 여부를 결정합니다.

source: When the Picture Collection importer creates or updates objects, it also sets a Note that you can use for selecting the objects involved in the import, and for reviewing if needed.
ko: 사진 모음 임포터는 개체를 만들거나 업데이트할 때 가져오기에 관련된 개체를 선택하고 필요한 경우 검토하는 데 사용할 수 있는 참고 사항도 설정합니다.

source: Documentation for Ghini 1.0
es: Documentación de Ghini 1.0
it: Documentazione di Ghini 1.0
ko: Ghini 1.0에 대한 문서

source: Ghini is a suite of applications for managing botanical specimen collections.
es: Ghini es un conjunto de programas para manejar una base de datos botánicas.
ko: Ghini는 식물 표본 수집을 관리하기위한 응용 프로그램 모음입니다.
uk: Ghini - це набір застосунків для управління колекціями ботанічних зразків.

source: **ghini.desktop** lets you create and query a database representing objects and events in your plant collection.
es: **ghini.desktop** le permite crear y consultar una base de datos que representa objetos y eventos en su colección de plantas.
ko: **ghini.desktop를** 사용하면 플랜트 컬렉션의 개체및 이벤트를 나타내는 데이터베이스를 만들고 쿼리할 수 있습니다.
uk: **ghini.desktop ** дозволяє створювати та запитувати базу даних, що представляє об'єкти та події у вашій колекції рослин.

source: **ghini.web** publishes highlights from your database on the web.
es: **ghini.web** le ayuda a publicar partes de la base datos en el web.
ko: **ghini.web는** 웹에 데이터베이스의 하이라이트를 게시합니다.

source: **ghini.pocket** puts a snapshot of your database in your handheld device.
es: **ghini.pocket** coloca una instantánea de su base de datos en su dispositivo de mano.
ko: **ghini.pocket는** 핸드헬드 장치에 데이터베이스의 스냅샷을 넣습니다.
uk: **ghini.pocket ** робить знімок вашої бази даних у вашому портативному пристрої.

source: **ghini.tour** assists garden visitors with a map and spoken virtual panels.
ko: **ghini.tour는** 정원 방문객을 지도와 음성 가상 패널로 지원합니다.

source: The bulk of this documentation focuses on ghini.desktop. One final chapter presents the rest of the Ghini family: :any:`ghini.pocket`, :any:`ghini.web`, :any:`ghini.tour`, and the :any:`interaction among components`.
ko: 이 설명서의 대부분은 gini.desktop에 초점을 맞추고 있습니다. 마지막 장에서는 기니의 나머지 가족인 'any:'ghini'를 소개합니다.포켓, :any:ghini.web', :any:'ghini.tour' 및 :any:'구성 요소 간 상호 작용'.

source: All Ghini software is `open <http://www.opensource.org>`_ and `free <http://www.fsf.org>`_. Our standalone software is released under the `GNU Public License <http://www.fsf.org/licensing/licenses/gpl.html>`_. Our client-server software follows the `GNU Affero Public License <http://www.fsf.org/licensing/licenses/agpl.html>`_.
es: Ghini es `codigo abierto <http://www.opensource.org>`_ y `libre <http://www.fsf.org>`_ y es distribuido bajo la `GPL, Licencia Pública GNU <http://www.fsf.org/licensing/licenses/gpl.html>`_. Además, todo el software que ofrecemos como servicio, está cubierto por la licencia `GNU Affero <http://www.fsf.org/licensing/licenses/agpl.html>`_.
it: Tutto il software Ghini è `aperto <http://www.opensource.org>`_ e `libero <http://www.fsf.org>`_ ed è distribuito secondo la `GPL: Licenza Pubblica GNU <http://www.fsf.org/licensing/licenses/gpl.html>`_. Inoltre, il software Ghini sviluppato secondo il modello servente/cliente segue la licenza `GNU Affero Public License <http://www.fsf.org/licensing/licenses/agpl.html>`_.
ko: 모든 기니 소프트웨어는 오픈 http://www.opensource.org과 무료 http://www.fsf.org이다. 당사의 독립형 소프트웨어는 'GNU 공용 라이센스 http://www.fsf.org/licensing/licenses/gpl.html'로 출시되었습니다. 우리의 클라이언트-서버 소프트웨어는 'GNU Affero Public License http://www.fsf.org/licensing/licenses/agpl.html'을 따른다.
uk: Все програмне забезпечення Ghini `відкрите <http://www.opensource.org>`_ і `безкоштовне <http://www.fsf.org>`_ . Наше автономне програмне забезпечення випускається під `GNU Public License <http://www.fsf.org/licensing/licenses/agpl.html>`_.

source: Statements
es: Declaraciones
ko: 진술들
uk: Заяви

source: Installing Ghini
es: Instalar Ghini
it: Istallare Ghini
ko: 기니 설치
uk: Установка Ghini

source: User's Guide
es: Manual del usuario
ko: 사용 설명서
uk: Керівництво користувача

source: Cookbook
es: Recetario
ko: 요리책
uk: Довідник програмних рішень

source: Administration
es: Administración
it: Amministrazione
ko: 행정
uk: Адміністрація

source: Ghini Family
ko: 지니 파밀리
uk: Сім'я Ghini

source: Ghini Development
es: Desarrollo de Ghini
it: Sviluppo di Ghini
ko: 기니 개발
uk: Розвиток Ghini

source: Supporting Ghini
es: Apoyar Ghini
it: Appoggiare Ghini
ko: 지지 기니
uk: Підтримка Ghini

source: If you're using Ghini, or if you feel like helping its development anyway, please consider donating.
ko: 만약 여러분이 기니를 사용하고 있거나, 기니의 발전을 돕고 싶다면, 기부를 고려해 보세요.

source: Installation
es: Instalación
it: Istallazione
ko: 설치
uk: Установка

source: ghini.desktop is a cross-platform program and it will run on unix machines like GNU/Linux and MacOSX, as well as on Windows.
es: ghini.desktop es un programa independiente de la plataforma software pues puede funcionar en sistemas unix como Linux y MacOSX así como en Windows.
it: ghini.desktop è un programma multipiattaforma e funziona su macchine unix (Linux e MacOSX) ma anche su Windows.
ko: ghini.desktop은 크로스 플랫폼 프로그램으로 GNU/리눅스 및 MacOSX와 같은 유닉스 머신에서 실행된다.
uk: Ghini.desktop - це крос-платформна програма, яка працюватиме на Unix-машинах, таких як GNU/Linux і MacOSX, а також у Windows.

source: one-liner for hurried users.
ko: 급행 승객을 위한 1인승.
uk: одним рядком для поспішних користувачів.

source: Linux users just download and run `the installation script <https://raw.githubusercontent.com/Ghini/ghini.desktop/ghini-1.0-dev/scripts/devinstall.sh>`_. You may read the documentation later.
ko: 리눅스 사용자들은 설치 스크립트 https://raw.githubusercontent.com/Ghini/ghini.desktop/ghini-1.0-dev/scripts/devinstall.sh'을 다운로드해서 실행하기만 하면 된다. 나중에 설명서를 읽을 수 있습니다.

source: Windows users in a real hurry don't the instructions and use a recent `Windows installer <https://github.com/Ghini/ghini.desktop/releases/>`_. You do not miss any functional feature, but you have less chances to contribute to development.
ko: 윈도 사용자들은 정말 서둘러 지시를 하지 않고 최신 윈도 설치 프로그램인 https://github.com/Ghini/ghini.desktop/releases/을 사용한다. 어떤 기능적 특징도 놓치지 않지만, 개발에 기여할 기회는 적습니다.

source: Mac users are never in a hurry, are they?
ko: 맥 사용자들은 결코 서두르지 않죠, 그렇죠?

source: Ghini is maintained by very few people, who focus on enhancing its functional parts, more than on writing fancy installers. Instead of several native installers we offer a single cross-platform installation procedure. This has a few big advantages which you will learn to appreciate as we go.
es: El grupo de desarrollo de Ghini es pequeño, y nos enfocamos en mejorar el código, o documentarlo, y no nos sobra tiempo para también mantener los paquetes de instalación. En lugar de tantos paquetes, uno por plataforma suportada, ofrecemos la misma procedura de instalación para todas plataformas. Esto no sólo nos ahorra tiempo sino tiene unas avantajas importantes, que se harán evidentes en el uso del programa.
it: Il gruppo di sviluppo di Ghini è piccolo, preferiamo lavorare al migliorare il programma, o a documentarlo, piuttosto che perder tempo con pacchetti di installazione. Invece di tanto pacchetti differenti, uno per piattaforma, offriamo una stessa procedura di installazione per tutte le piattaforme. Questo non solo ci risparmia tempo, ci regala anche un po' di vantaggi, che apprezzeremo nel corso dell'uso del software.
ko: 기니는 화려한 설치기를 쓰는 것보다 그것의 기능적인 부분을 향상시키는 데 집중하는 극소수의 사람들에 의해 유지된다. 여러 기본 설치 프로그램 대신 단일 교차 플랫폼 설치 절차를 제공합니다. 이것은 우리가 가는 동안 여러분이 감사하는 것을 배울 몇 가지 큰 장점들을 가지고 있습니다.

source: The installation is based on running a script.
es: La instalación está basada en ejecutar un script.
it: L'installazione è basata sull'esecuzione di uno script.
ko: 설치는 스크립트 실행을 기반으로 합니다.
uk: Встановлення засноване на запуску сценарію.

source: The GNU/Linux script takes care of everything, from dependecies to installation for users in the ``ghini`` group.
es: El script para GNU/Linux se ocupa de todo, desde solucionar las dependencias hasta la instalación para los usuarios en el grupo ``ghini``.
it: Lo script GNU/Linux si occupa di tutto, dalla soluzione delle dipendenze alla installazione per tutti gli utenti nel gruppo ``ghini``.
ko: GNU/리눅스 스크립트는 종속성부터 ``기니" 그룹의 사용자를 위한 설치에 이르기까지 모든 것을 처리한다.
uk: Сценарій GNU/Linux дбає про все, від dependecies до інсталяції для користувачів у групі ``ghini``.

source: The Windows script needs you to first install a couple things.
es: El script de Windows le pide primero de instalar un par de cosas.
it: Lo script per Windows richiede l'installazione previa di un paio di cose.
ko: Windows 스크립트는 먼저 몇 가지를 설치해야 합니다.
uk: Сценарій Windows потребує, щоб ви спочатку встановите пару речей.

source: On MacOSX we use the same script as on GNU/Linux. Since OSX has no default package manager, we install one and we use it before we start the script.
es: En MacOSX vamos a utilizar el mismo script de GNU/Linux, pero como OSX no tiene un gestor de paquetes, antes de ejecutar el script vamos a instalar uno.
it: Su MacOSX utilizzeremo lo stesso script di GNU/Linux, però non avendo OSX un gestore di pacchetti ne istalleremo uno prima di eseguire lo script.
ko: MacOSX에서는 GNU/Linux와 동일한 스크립트를 사용합니다. OSX에는 기본 패키지 관리자가 없으므로 스크립트를 시작하기 전에 하나를 설치하고 사용합니다.
uk: У MacOSX ми використовуємо той самий сценарій, що і на GNU/Linux. Оскільки OSX не має менеджера пакетів за замовчуванням, ми встановлюємо його, і використовуємо, перш ніж запускати скрипт.

source: Following our installation procedure, you will end with Ghini running within a Python virtual environment, all Python dependencies installed locally, non conflicting with any other Python program you may have on your system.
es: Si sigue los siguientes pasos, se encontrará con Ghini instalado en un entorno virtual, todas la dependencias Python estarán instalada localmente y no entrarán en conflicto con otros programas Python que puedan estar el la misma computadora.
it: Seguendo le seguenti istruzioni di installazione si ottiene ghini.desktop installato in un ambiente Python virtuale, tutte le dipendenze saranno installate localmente e non entreranno in conflitto con altri programmi Python che possono essere sullo stesso elaboratore.
ko: 설치 절차에 따라 Python 가상 환경에서 실행되는 Ghini와 함께 종료됩니다. 모든 Python 종속성은 로컬에서 설치되며 시스템에 있을 수 있는 다른 Python 프로그램과 충돌하지 않습니다.
uk: Дотримуючись нашої процедури встановлення, по закінчені Ghini працює в віртуальному середовищі Python, всі Python залежності встановлено локально, не конфліктуючи з будь-якою іншою програмою Python, яку ви можете мати у вашій системі.

source: Dependencies that don't fit in a Python virtual environment are: Python, virtualenv, GTK+, and PyGTK. Their installation varies per platform.
es: Las dependencias que no caben en un entorno virtual Python son: Python, virtualenv, GTK+, and PyGTK. Su instalación depende por plataforma.
it: Le dipendenze che non è possibile installare in un ambiente virtuale Python sono: Python, virtualenv, GTK+, e PyGTK. La loro installazione differisce per piattaforma.
ko: Python 가상 환경에 맞지 않는 종속성은 Python, virtualenv, GTK+ 및 PyGTK입니다. 설치는 플랫폼마다 다릅니다.

source: If you later choose to remove Ghini, you simply remove the virtual environment, which is a directory, with all of its content.
es: Si por cualquier razón quisiera usted desinstalar Ghini, lo único que tiene que hacer es eliminar el entorno virtual, que es una carpeta, con todo su contenido.
it: Se dovessi in seguito decidere di rimuovere Ghini, basterà rimuovere l'ambiente virtuale, che è una directory, con tutto il suo contenuto.
ko: 나중에 Ghini를 제거하도록 선택하면 디렉터리인 가상 환경이 모든 컨텐츠로 제거됩니다.

source: Installing on GNU/Linux
es: Instalación en GNU/Linux
it: Installare su Linux
ko: GNU/리눅스에 설치
uk: Встановлення на GNU/Linux

source: Open a shell terminal window, and follow the following instructions.
ko: 셸 터미널 창을 열고 다음 지침을 따르십시오.
uk: Відкрийте вікно терміналу оболонки та виконайте наведені нижче інструкції.

source: Download the `devinstall.sh` script:
ko: devinstall을 다운로드합니다.sh' 스크립트:

source: Invoke the script from a terminal window, starting at the directory where you downloaded it, like this::
ko: 터미널 창에서 스크립트를 다운로드한 디렉토리에서 다음과 같이 호출합니다.::

source: The script will produce quite some output, which you can safely ignore.
ko: 이 스크립트는 상당히 많은 출력을 생성하므로 사용자가 안전하게 무시할 수 있습니다.

source: global installation
ko: 글로벌 설치
uk: глобальна установка

source: When almost ready, the installation script will ask you for your password. This lets it create a ``ghini`` user group, initialise it to just yourself, make the just created ``ghini`` script available to the whole ``ghini`` user group.
ko: 거의 준비되면 설치 스크립트에서 암호를 묻는 메시지가 나타납니다. 이를 통해 ``기니" 사용자 그룹을 만들어 자기 자신만으로 초기화시키고 방금 만든 "기니" 사용자 그룹 전체가 사용할 수 있게 된다.

source: If feeling paranoid, you can safely not give your password and interrupt the script there.
ko: 편집증이 있는 경우 암호를 제공하지 않고 스크립트를 방해할 수 있습니다.

source: Possibly the main advantage of a global installation is being able to find Ghini in the application menus of your graphic environment.
ko: 글로벌 설치의 주요 이점은 그래픽 환경의 애플리케이션 메뉴에서 Ghini를 찾을 수 있다는 것입니다.

source: You can now start ghini by invoking the ``ghini`` script::
ko: 이제 "ghini" 스크립트를 호출하여 ghini를 시작할 수 있습니다.::

source: You use the same ``ghini`` script to update ghini to the latest released production patch::
ko: 동일한 ''기니'' 스크립트를 사용하여 기니를 최신 릴리스 프로덕션 패치로 업데이트합니다.::

source: This is what you would do when ghini shows you something like this:
ko: 기니가 당신에게 이런 것을 보여줄 때 당신은 이렇게 할 것이다.:

source: Users of the global installation will also type ``ghini`` to invoke the program, but they will get to a different script, located in ``/usr/local/bin``. This globally available ``ghini`` script cannot be used to update a ghini installation.
ko: 글로벌 설치 사용자들도 이 프로그램을 호출하기 위해 "기니"를 입력하지만 ``/usr/local/bin"에 위치한 다른 스크립트로 이동하게 된다. 전세계적으로 사용 가능한 이 "기니" 스크립트는 기니 설치를 업데이트하는 데 사용할 수 없습니다.

source: Again the same ``ghini`` script lets you install the optional database connectors: option ``-p`` is for PostgreSQL, option ``-m`` is for MySQL/MariaDB, but you can also install both at the same time::
ko: 다시 동일한 "ghini" 스크립트를 사용하여 선택적 데이터베이스 커넥터를 설치할 수 있습니다. "-p" 옵션은 Postgre용입니다.SQL, 옵션 ''-m''은 MySQL/MariaDB용이지만 두 옵션을 동시에 설치할 수도 있습니다.::

source: Please beware: you might need solve dependencies. How to do so, depends on which GNU/Linux flavour you are using. Check with your distribution documentation.
ko: 주의해 주세요: 의존성을 해결해야 할 수도 있습니다. 이렇게 하는 방법은 사용하는 GNU/리눅스 향에 따라 다릅니다. 배포 문서를 참조하십시오.
uk: Будьте обережні: може знадобитися вирішувати залежності. Як це зробити, залежить від того, який GNU/Linux ви використовуєте. Перевірте свою документацію про розповсюдження.

source: You can also use the ``ghini`` script to switch to a different production line. At the moment ``1.0`` is the stable one, but you can select ``1.1`` if you want to help us with its development::
ko: "기니" 스크립트를 사용하여 다른 생산 라인으로 전환할 수도 있습니다. 현재는 ''1.0''이 안정적이지만 '1'을 선택할 수 있다.1당사의 개발을 돕고 싶은 경우 다음을 수행합니다.::

source: beginner's note
es: Nota para principiantes
it: nota per il principiante
ko: 초급 노트
uk: примітка новачка
