Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: From time to time, during the process of updating the software, you will be adding or modifying strings in the python sources, in the documentation, in the glade sources. Most of our strings are translatable, and are offered to weblate for people to contribute, in the form of several ``.po`` files.
es: De vez en cuando, durante el proceso de actualización del software, el programador añade o modifica cadenas de texto en las fuentes python, o en la documentación, o en las fuentes glade. La mayoría de nuestras cadenas son traducibles y son automáticamente ofrecidas a weblate para la contribución de traducciones por voluntarios, en forma de archivos ``po``.
it: Di tanto in tanto, durante il processo di aggiornamento del software, si verrà essere aggiungendo o modificando le stringhe nelle fonti python, nella documentazione, nelle fonti glade. La maggior parte delle nostre corde sono traducibile e sono offerti a weblate per le persone a contribuire, sotto forma di diversi file. ``po``.
ko: 때때로 소프트웨어를 업데이트하는 과정에서 파이썬 소스, 문서, glade 소스의 문자열을 추가하거나 수정합니다. 대부분의 문자열은 번역이 가능하며 여러``.po ''파일 형식으로 사람들이 기여할 수 있도록 웨블레이트에 제공됩니다.
uk: Час від часу під час оновлення програмного забезпечення ви будете додавати або змінювати рядки в джерелах python, в документації, в glade джерелах. Більшість наших рядків є перекладами, і пропонуються weblate для людей, щоб зробити внесок у формі декількох ``.po`` файлів.

source: A ``po`` is mostly composed of pairs of text portions, original and translation, and is specific to a target language. When a translator adds a translation on weblate, this reaches our repository on github. When a programmer adds a string to the software, this reaches weblate as "to be translated".
es: Un archivo ``po`` está asociado a un idioma y contiene texto en pares: original y traducción. Cuando un traductor añade una traducción en weblate, eso es copiado a nuestro repositorio en github. cuando un programador añade un texto en el software, esto es copiado a weblate para ser traducido.
it: Un file ``po`` è specifico di una lingua ed è composto da coppie di testi, in lingua originale e la corrispondente traduzione. Quando un traduttore aggiunge una traduzione su weblate, questa raggiunge il nostro repositorio github. Quanto un programmatore aggiunge una stringa nel software, questa raggiunge weblate per venir tradotta.
ko: ``po ''는 대부분 원본과 번역의 텍스트 부분 쌍으로 구성되며 대상 언어에 따라 다릅니다. 번역가가 weblate에 번역을 추가하면 github의 저장소에 도달합니다. 프로그래머가 소프트웨어에 문자열을 추가하면 "to be translation"으로 weblate에 도달합니다.
uk: В основному ``po`` складається з пар текстових частин, оригінал і переклад і є специфічним для цільової мови. Коли перекладач додає переклад на weblate, це потрапляє до нашого сховища на github. Коли програміст додає рядок до програмного забезпечення, це досягає weblate "для перекладу".

source: Weblate hosts the `Ghini <https://hosted.weblate.org/projects/ghini/>`_ project. Within this project we have components, each of which corresponds to a branch of a repository on github. Each component accepts translations in several languages.
es: Weblate alberga `el proyecto Ghini <https://hosted.weblate.org/projects/ghini/>`_. El proyecto está organizado en componentes, cada cual corresponde a una rama de uno de nuestros repositorios en github. Cada componente acepta traducciones a varios idiomas.
it: Weblate ospita `il progetto Ghini <https://hosted.weblate.org/projects/ghini/>`_. Il progetto è suddiviso in componenti, ciascuna corrispondente ad un branch di un nostro repositorio github. Ciascuna componente accetta traduzioni in diverse lingue.
ko: Weblate는`Ghini <https://hosted.weblate.org/projects/ghini/>`_ 프로젝트를 호스팅합니다. 이 프로젝트에는 github의 저장소 브랜치에 해당하는 구성 요소가 있습니다. 각 구성 요소는 여러 언어로 번역을 허용합니다.
uk: Weblate хост `Ghini <https://hosted.weblate.org/projects/ghini/>`_ проект. У рамках цього проекту ми маємо компоненти, кожен з яких відповідає гілці сховища на github. Кожен компонент приймає переклад на декількох мовах.

source: component
es: componente
it: componente
ko: 구성 요소
uk: компонент

source: repository
es: repositorio
it: repositorio
ko: 저장소
uk: сховище

source: branch
es: rama
ko: 분기
uk: гілка

source: Pocket
ko: 포켓

source: To update the ``po`` files relative to the *software*, you set the working directory to the root of your checkout of *ghini.desktop*, and you run the script::
es: Para poner al día los archivos ``po`` relativos al *software*, active una linea de comando en la carpeta base del checkout de *ghini.desktop* y ejecute el script::
it: Per aggiornare i file ``po`` relativi al *software*, esegui il seguente script dalla linea di comando, preferibilmente dalla base del checkout di *ghini.desktop*::
ko: * software *와 관련된``po ''파일을 업데이트하려면 작업 디렉토리를 * ghini.desktop * 체크 아웃 루트로 설정하고 스크립트를 실행합니다::
uk: Щоб оновити файли ``po`` відносно *програмного забезпечення*, встановіть робочий каталог у корінь вашої копії *ghini.desktop* і запустіть скрипт::

source: To update the ``po`` files relative to the *documentation*, you set the working directory to the root of your checkout of *ghini.desktop-docs.i18n*, and you run the script::
es: Para poner al día los archivos ``po`` relativos a la *documentación*, active una linea de comando en la carpeta base del checkout de *ghini.desktop-docs.i18n* y ejecute el script::
it: Per aggiornare i file ``po`` relativi alla *documentazione*, esegui il seguente script dalla linea di comando, preferibilmente dalla base del checkout di *ghini.desktop-docs.i18n*::
ko: * documentation *과 관련된``po ''파일을 업데이트하려면 작업 디렉토리를 * ghini.desktop-docs.i18n * 체크 아웃 루트로 설정하고 다음 스크립트를 실행합니다::
uk: Щоб оновити ``po`` файли *документації*, встановіть робочий каталог у корінь вашої копії *ghini.desktop-docs.i18n*, і запустіть скрипт::

source: When you run either of the above mentioned scripts, chances are you need to commit *all* ``po`` files in the project. You may want to review the changes before committing them to the respository. This is most important when you perform a marginal correction to a string, like removing a typo.
es: Cuando se ejecuta uno de los scripts mencionados, lo más probable es que usted necesite alterar *todos* archivos ``po`` del proyecto. Puedes querer revisar los cambios antes de enviarlos el repositorio. Esto es muy importante cuando se realiza una corrección marginal en una cadena, como quitar un error de tipeo.
it: Quando si esegue uno degli script di cui sopra, è probabile che si abbia bisogno di fare il commit di *tutti* i file `po` del progetto. Si potrebbero voler esaminare le modifiche prima di inserirle nel respository. Questo è più importante quando si esegue una correzione marginale di una stringa, come la rimozione di un errore di battitura.
ko: 위에서 언급 한 스크립트 중 하나를 실행할 때 프로젝트에서 * 모든 *``po ''파일을 커밋해야 할 가능성이 있습니다. 저장소에 커밋하기 전에 변경 사항을 검토 할 수 있습니다. 이것은 오타 제거와 같이 문자열에 대한 한계 수정을 수행 할 때 가장 중요합니다.
uk: Коли ви запускаєте будь-який з вищезазначених сценаріїв, швидше за все, вам потрібно фіксувати *all* ``po``файли в проекті. Ви можете переглянути зміни, перш ніж застосувати їх до репозиторію. Це найголовніше коли ви виконуєте критичну корекцію до рядка, наприклад видалення помилки.

source: Something that happens: running into a conflict. Solving conflicts is not difficult once you know how to do that. First of all, add weblate as remote::
es: Algo que pasa: acabar en un conflicto. Resolución de conflictos no es difícil una vez que uno sepa cómo se hace. En primer lugar, añadir weblate como repositorio remoto::
it: Qualcosa che accade: trovarsi con un conflitto. Risoluzione dei conflitti non è difficile se sai come si fa. Prima di tutto, aggiungere weblate come remoto::
ko: 일어나는 일 : 갈등에 빠진다. 갈등을 해결하는 방법을 알면 어렵지 않습니다. 먼저 weblate를 원격으로 추가하십시오::
uk: Те, що відбувається: вступ у конфлікт. Вирішити конфлікти не складно, коли ви знаєте, як це зробити. Перш за все, додати weblate як віддалений::

source: Then make sure we are in the correct repository, on the correct branch, update the remote, merge with it::
es: A continuación, asegúrese de estar en el repositorio correcto, en la rama correcta, actualizar la fuente remota, fusionar con ella::
it: Quindi assicurarsi che siamo nel repository corretto, sul ramo corretto, aggiornare la fonte remota, unirla al ramo::
ko: 일어나는 일 : 갈등에 빠진다. 갈등을 해결하는 방법을 알면 어렵지 않습니다. 먼저 weblate를 원격으로 추가하십시오::
uk: Потім переконайтеся, що ми знаходимося в правильному сховищі, на правильній гілці, оновіть дистанційне керування, злийте з ним::

source: `Our documentation <https://readthedocs.org/projects/ghini/>`_ on readthedocs has an original English version, and several translations. We just follow the `description of localisation <http://docs.readthedocs.io/en/latest/localization.html>`_, there's nothing that we invented ourselves here.
es: 'Nuestra documentación <https://readthedocs.org/projects/ghini/ >`_ en readthedocs tiene una versión original en inglés y varias traducciones. Seguimos la `descripción de localización <http://docs.readthedocs.io/en/latest/localization.html >`_, no hay nada que nosotros mismos inventamos aquí.
it: `La nostra documentazione <https://readthedocs.org/projects/ghini/>`_ su readthedocs ha una versione originale in lingua inglese, e diverse traduzioni. Seguiamo semplicemente la `descrizione della localizzazione <http://docs.readthedocs.io/en/latest/localization.html>`_. Qui non c'è nulla che abbiamo inventato noi.
ko: `readthedocs의 문서 <https://readthedocs.org/projects/ghini/>`_에는 원본 영어 버전과 여러 번역이 있습니다. 우리는`현지화 설명 <http://docs.readthedocs.io/en/latest/localization.html>`_을 따를뿐입니다. 여기서 우리가 스스로 발명 한 것은 없습니다.
uk: `Our documentation <https://readthedocs.org/projects/ghini/>`_ на readtodocs є оригінальна англійська версія, і кілька перекладів. Ми просто дотримуємося `description of localisation <http://docs.readthedocs.io/en/latest/localization.html>`_, немає нічого, що ми винайшли собі тут.

source: Readthedocs checks the project's *Language* setting, and invokes ``sphinx-intl`` to produce the formatted documentation in the target language. With the default configuration —which we did not alter— ``sphinx-intl`` expects one ``po`` file per source document, named as the source document, and that they all reside in the directory ``local/$(LANG)/LC_MESSAGES/``.
es: Readthedocs comprueba la configuración de idioma del proyecto e invoca ``sphinx-intl`` para formatear la documentación en el idioma de objetivo. Con la configuración predeterminada, que no alteramos, ``sphinx-intl`` espera un archivo ``po`` por cada documento fuente, llamado como el documento de origen, y que resida en el directorio ``local/$(LANG)/LC_MESSAGES/``.
it: ReadTheDocs controlla l'impostazione "Language" del progetto ed invoca ``sphinx-intl`` per produrre la documentazione formattata nella lingua obiettivo. Con la configurazione predefinita — che non abbiamo alterato — ``sphinx-intl`` prevede un file ``po`` per ogni documento di origine, che abbia lo stesso nome del documento di origine, e che risieda nella directory ``locale/$(LANG)/LC_MESSAGES/``.
ko: Readthedocs는 프로젝트의 * Language * 설정을 확인하고``sphinx-intl``을 호출하여 대상 언어로 형식화 된 문서를 생성합니다. 우리가 변경하지 않은 기본 구성을 사용하면``sphinx-intl``은 소스 문서 당 하나의``po ''파일을 예상하며 소스 문서로 명명되며 모두``local / $ ( LANG) / LC_MESSAGES /``.
uk: Readthedocs перевіряє налаштування проекту *Language*, і викликає ``sphinx-intl``для отримання відформатованої документації на цільовій мові. З конфігурацією за замовчуванням —що ми не змінювали— ``sphinx-intl`` очікує один ``po`` файл на один вихідний документ, названий як вихідний документ і що всі вони перебувають у каталозі ``local/$(LANG)/LC_MESSAGES/``.

source: On the other hand, Weblate (and ourselves) prefers a single ``po`` file per language, and keeps them all in the same ``/po`` directory, just as we do for the software project: ``/po/$(LANG).po``.
es: Por otro lado, Weblate (y nosotros) preferimos un único fichero ``po`` por lenguaje, y los mantenemos todos en el mismo fichero ``/po``, tal como lo hacemos para el proyecto de software: ``/po/$(LANG).po``.
it: D'altra parte, Weblate (e noi stessi) preferiamo un file ``po`` per ogni lingua, e tenerli tutti nella stessa cartella ``/po``, come facciamo per il progetto software: ``/po/$(LANG).po``.
ko: 반면에 웨블 레이트 (그리고 우리 자신)는 언어 당 하나의``po ''파일을 선호하며, 소프트웨어 프로젝트에서와 마찬가지로 모두 동일한``/ po ''디렉토리에 보관합니다 :``/ po /$(LANG).po ''.
uk: З іншого боку, Weblate (і ми самі) віддає перевагу одному ``po`` файлу на кожну мову, і зберігаємо їх всіх у однакових директоріях ``/ po``, подібно тому, як ми робимо для програмного проекту: ``/po/$(LANG).po``.

source: In order not to repeat information, and to let both systems work their natural way, we have two sets of symbolic links (git honors them).
es: Con el fin de no repetir la información, y para permitir que ambos sistemas trabajen en su forma natural, tenemos dos conjuntos de enlaces simbólicos (git los honra).
it: Per non ripetere informazione e per lasciare lavorare entrambi i sistemi nel loro modo naturale, abbiamo due insiemi di link simbolici (git li rispetta).
ko: 정보를 반복하지 않고 두 시스템이 자연스럽게 작동하도록하기 위해 두 세트의 심볼릭 링크가 있습니다 (git이이를 존중합니다).
uk: Щоб не повторювати інформацію, і дозволити обом системам працювати природним способом, у нас є два набори символічних посилань (git визначає їх).

source: To summarise: when a file in the documentation is updated, the ``runme.sh`` script will:
es: Para resumir: cuando se actualiza un archivo de la documentación, el script ``runme.sh`` se ocupa de:
it: Per riassumere: quando viene aggiornato un file nella documentazione, lo script``runme.sh`` si occupa di:
ko: 요약하자면, 문서의 파일이 업데이트되면``runme.sh ''스크립트는 다음을 수행합니다.:
uk: Підбиваючи підсумок: коли файл у документації оновлюється, ``runme.sh`` скрипт буде:

source: copy the ``rst`` files from the software to the documentation;
es: copia los archivos ``rst`` del software a la documentación;
it: copiare i file ``rst`` dal software alla documentazione;
ko: 소프트웨어에서 문서로``rst ''파일을 복사합니다;
uk: скопіюйте ``rst`` файли з програмного забезпечення в документацію;

source: create a new ``pot`` file for each of the documentation files;
es: crea un nuevo archivo ``pot`` para cada documento;
it: creare un nuovo file ``pot`` per ciascun elemento di documentazione;
ko: 각 문서 파일에 대해 새``pot ''파일을 만듭니다;
uk: Створіть новий ``pot`` файл для кожного з файлів документації;

source: merge all ``pot`` files into one ``doc.pot``;
es: junta los archivos ``pot`` en un único ``doc.pot``;
it: unire tutti i file ``pot`` in un unico ``doc.pot``;
ko: 모든``pot ''파일을 하나의``doc.pot ''으로 병합합니다;
uk: об'єднайте всі ``pot`` файли в один ``doc.pot``;

source: use the updated ``doc.pot`` to update all ``doc.po`` files (one per language);
es: pone al día todos ``doc.po`` (uno por idioma) en base al nuevo ``doc.pot``;
it: aggiornare tutti i ``doc.po`` (uno per lingua) sulla base del nuovo ``doc.pot``;
ko: 업데이트 된``doc.pot``을 사용하여 모든``doc.po ''파일을 업데이트합니다 (언어 당 하나씩);
uk: використовуйте оновлений ``doc.pot`` для оновлення всіх файлів ``doc.po`` (по одному на кожну мову);

source: create all symbolic links:
es: crea todos enlaces simbólicos:
it: creare tutti i collegamenti simbolici:
ko: 모든 심볼릭 링크를 만듭니다:
uk: створити всі символічні посилання:

source: those expected by ``sphinx-intl`` in ``/local/$(LANG)/LC_MESSAGES/``
es: para ``sphinx-int`` en ``/local/$(LANG)/LC_MESSAGES/``
it: quelli utilizzati da ``sphinx-intl`` in ``/local/$(LANG)/LC_MESSAGES/``
ko: ``/ local / $ (LANG) / LC_MESSAGES /``의``sphinx-intl``에 의해 예상되는 것
uk: ті, що очікуються ``sphinx-intl`` в ``/local/$(LANG)/LC_MESSAGES/``

source: those used by weblate in ``/po/$(LANG).po``
es: para weblate en ``/po/$(LANG).po``
it: quelli utilizzati da noi e weblate in ``/po/$(LANG).po``
ko: weblate에서 사용하는``/ po / $ (LANG) .po``
uk: ті, що використовуються weblate в ``/po/$(LANG).po``

source: We could definitely write the above in a Makefile, or even better include it in ``/doc/Makefile``. Who knows, maybe we will do that.
es: Definitivamente podríamos escribir lo anterior en un Makefile, o incluso mejor incluirlo en ``doc/Makefile``. Quién sabe, tal vez lo haremos.
it: Sicuramente potremmo scrivere tutto ciò in un Makefile, o ancora meglio includerlo nel '/ doc/Makefile '. Chissà, forse lo faremo, un giorno.
ko: 위의 내용을 Makefile에 작성하거나``/ doc / Makefile``에 포함하는 것이 더 좋습니다. 누가 알겠습니까, 아마도 우리가 그렇게 할 것입니다.
uk: Ми могли б напевно записати вищевказане в Makefile, або навіть краще включити його в ``/doc/Makefile``. Хто знає, може, ми це зробимо.

source: Producing the docs locally
ko: 로컬에서 문서 생성

source: The above description is about how we help external sites produce our documentation so that it is online for all to see. But what if you want to have the documentation locally, for example if you want to edit and review before pushing your commits to the cloud?
ko: 위의 설명은 모든 사람이 볼 수 있도록 외부 사이트에서 문서를 생성하는 데 도움이 되는 방법에 대한 것입니다. 그러나 예를 들어 커밋을 클라우드로 푸시하기 전에 편집하고 검토하려는 경우와 같이 문서를 로컬로 갖고 싶다면 어떻게 해야 할까요?

source: In order to run sphinx locally, you need to install it **within** the same virtual environment as ghini, and to install it there, you need to have a sphinx version whose dependencies don not conflict with ghini.desktop's dependecies.
ko: sphinx를 로컬에서 실행하려면 ghini와 동일한 가상 환경 ** 내 **에 설치해야 하며, 여기에 설치하려면 종속성이 ghini.desktop의 종속성과 충돌하지 않는 sphinx 버전이 있어야 합니다.

source: What we do to keep this in order?
ko: 이것을 순서대로 유지하려면 어떻게해야합니까?

source: We state this extra dependency in the ``setup.py`` file, as an ``extras_require`` entry. Create and activate the virtual environment, then run ``easy_install ghini.desktop[docs]``. This gets you the sphinx version as declared in the ``setup.py`` file.
ko: 이 추가 종속성은``setup.py ''파일에``extras_require ''항목으로 명시합니다. 가상 환경을 생성하고 활성화 한 다음``easy_install ghini.desktop [docs]``를 실행합니다. 이렇게 하면``setup.py ''파일에 선언 된 스핑크스 버전이 표시됩니다.

source: If all you want is the html documentation built locally, run ``./setup.py install docs``. For more options, enter the ``doc`` directory and run ``make``.
ko: 로컬에서 빌드 된 html 문서 만 원하는 경우``./setup.py install docs``를 실행하십시오. 더 많은 옵션을 보려면``doc ''디렉토리를 입력하고``make ''를 실행하십시오.

source: Which way do the translated strings reach our users?
es: Como hacen nuestras cadenas de texto para llegar a los usuarios?
ko: 번역 된 문자열은 어떤 방식으로 사용자에게 전달됩니까?
uk: Яким чином перекладені рядки досягають наших користувачів?

source: A new translator asked the question, adding: »Is this an automated process from Weblate --> GIT --> Ghini Desktop installed on users computers, or does this require manual steps?
es: Hace poco un traductor me puso esta pregunta, añadiendo: »se trata de un proceso automático de Weblate a Git al Ghini desktop ya instalado, o requiere intervención manual?
ko: 새로운 번역가가 다음과 같이 질문했습니다.»Weblate-> GIT-> 사용자 컴퓨터에 설치된 Ghini Desktop의 자동화 된 프로세스입니까, 아니면 수동 단계가 필요합니까?
uk: Новий перекладач поставив запитання, додавши: «Чи це автоматичний процес від Weblate --> GIT --> Ghini Desktop встановлений на комп'ютерах користувачів, чи це вимагає ручних кроків?

source: The aswer is that the whole interaction is quite complex, and it depends on the component.
es: Es que la interacción es algo más compleja, y depende de cuál componente estamos considerando.
ko: 문제는 전체 상호 작용이 매우 복잡하고 구성 요소에 따라 다르다는 것입니다.
uk: Вважається, що вся взаємодія досить складна, і це залежить від компонента.

source: When you install ``ghini.desktop`` or one of the Android apps, the installation doesn't assume a specific run-time language: a user can change their language configuration any time. So what we do is to install the software in English together with a translation table from English to whatever else.
ko: ``ghini.desktop ''또는 Android 앱 중 하나를 설치할 때 설치는 특정 런타임 언어를 가정하지 않습니다. 사용자는 언제든지 언어 구성을 변경할 수 있습니다. 그래서 우리가하는 일은 영어로 된 번역 표와 함께 영어로 된 소프트웨어를 설치하는 것입니다.

source: At run-time the GUI libraries (Android or GTK) know where to look for the translation strings. These translation tables are generated during the installation or upgrade process, based on the strings you see on Weblate.
ko: 런타임에 GUI 라이브러리 (Android 또는 GTK)는 번역 문자열을 찾을 위치를 알고 있습니다. 이러한 번역 테이블은 Weblate에 표시되는 문자열을 기반으로 설치 또는 업그레이드 프로세스 중에 생성됩니다.

source: The path followed by translations is: You edit strings on Weblate, Weblate keeps accumulating them until you are done, or you don't interact with Weblate for a longer while; Weblate pushes the strings to github, directly into the development line ``ghini-1.0-dev``; I see them and I might blindly trust or prefer to review them, maybe I look them up in wikipedia or get them translated back to Italian, Spanish or English by some automatic translation service; sometimes I need to solve conflicts arising because of changed context, not too often fortunately. As said, this lands in the development line ``ghini-1.0-dev``, which I regularly publish to the production line ``ghini-1.0``, and this is the moment when the new translations finally make it to the distributed software.
ko: 번역이 뒤 따르는 경로는 다음과 같습니다. Weblate에서 문자열을 편집하거나, Weblate가 완료 될 때까지 문자열을 계속 축적하거나, Weblate와 오랫동안 상호 작용하지 않습니다. Weblate는 문자열을 github에 직접 푸시하여 개발 라인``ghini-1.0-dev ''로 보냅니다. 나는 그들을 보고 맹목적으로 신뢰하거나 검토하는 것을 선호 할 수 있습니다. 위키피디아에서 찾아 보거나 자동 번역 서비스를 통해 이탈리아어, 스페인어 또는 영어로 다시 번역 할 수도 있습니다. 때로는 상황이 변경되어 발생하는 갈등을 해결해야 합니다. 말했듯이 이것은 개발 라인``ghini-1.0-dev ''에 도착하며, 저는 정기적으로 생산 라인``ghini-1.0 ''에 게시하고 있으며, 이것은 새로운 번역이 마침내 배포 된 소프트웨어.

source: Users will notice a *new version available* warning and can decide to ignore it, or to update.
ko: 사용자는 * 사용 가능한 새 버전 * 경고를보고 무시하거나 업데이트 할 수 있습니다.

source: For ``ghini.pocket``, it is similar, but the notification is handled by the Android system. We publish on the Play Store, and depending on your settings, your phone will update the software automatically, or only notify you, or do nothing. It depends on how you configured automatic updates.
ko: ``ghini.pocket``의 경우 비슷하지만 Android 시스템에서 알림을 처리합니다. Google은 Play 스토어에 게시하며 설정에 따라 휴대 전화가 소프트웨어를 자동으로 업데이트하거나 알림 만 보내거나 아무것도 하지 않습니다. 자동 업데이트를 구성한 방법에 따라 다릅니다.

source: For ``ghini.web``, we haven't yet defined how to distribute it.
ko: ``ghini.web``의 경우 배포 방법을 아직 정의하지 않았습니다.
uk: Для ``ghini.web`` ми ще не визначили, як його розповсюджувати.

source: For ghini's documentation, it's completely automatic, and all is handled by readthedocs.org.
es: Para la documentación de ghini, el proceso es totalmente automático, manejado por readthedocs.org.
ko: ghini 문서의 경우 완전히 자동이며 모두 readthedocs.org에서 처리합니다.
uk: Для документації ghini вона повністю автоматична, і все це обробляється readthedocs.org.

source: Adding missing unit tests
es: Añadir pruebas unitarias
it: Aggiunta mancante unit test
ko: 누락 된 단위 테스트 추가
uk: Додавання відсутніх одиничних тестів

source: If you are interested contributing to development of Ghini, a good way to do so would be by helping us finding and writing the missing unit tests.
es: Si te interesa contribuir al desarrollo de Ghini, una buena manera de hacerlo sería por ayudarnos a encontrar y escribir las pruebas unitarias que falta.
it: Se siete interessati a contribuire allo sviluppo di Ghini, un buon modo per farlo sarebbe aiutandoci a trovare e scrittura di unit test mancante.
ko: Ghini 개발에 관심이 있으시다면, 누락 된 단위 테스트를 찾고 작성하도록 도와 주시면 좋은 방법이 될 것입니다.
uk: Якщо ви зацікавлені в сприянні розвитку Ghini, хороший спосіб зробити це буде, допомагаючи нам знаходити та писати пропущені тестові блоки.

source: A well tested function is one whose behaviour you cannot change without breaking at least one unit test.
es: Una función de bien probada es uno cuyo comportamiento se puede cambiar sin romper al menos una prueba de unidad.
it: Una funzione ben testata è uno cui comportamento non è possibile modificare senza rompere almeno un test di unità.
ko: 잘 테스트 된 함수는 적어도 하나의 단위 테스트를 위반하지 않고는 동작을 변경할 수 없는 함수입니다.
uk: Добре перевіреною функцією є та, чия поведінка не може змінюватися, не порушуючи принаймні одне тестування.
