Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Our garden has two exposition greenhouses, and several warm and cold greenhouses where we keep the largest part of our collection. Plants are moved to the exposition when flowering and back to the "warehouse" when less interesting for the exposition. For each plant in our collection we need to know its current locations and history of movements.
es: Nuestro jardín cuenta con dos invernaderos de exposición y varios invernaderos de frío y de calor donde guardamos la mayor parte de nuestra colección. Movemos las plantas al área de exposición al florecimiento y al almacén cuando se vuelven menos llamativas para la exposición. Para cada planta en nuestra colección tenemos que saber su ubicación actual y la historia de los movimientos.
ko: 우리 정원에는 2개의 전시 온실이 있고, 따뜻한 온실과 차가운 온실이 몇 채 있는데, 그 온실은 우리가 소장하고 있는 것의 가장 큰 부분을 차지한다. 식물은 꽃을 피울 때는 엑스포로 옮겨지고, 전시할 때는 "창고"로 되돌아간다. 컬렉션에 있는 각 공장에 대해 현재 위치와 이동 내역을 알아야 합니다.
uk: Наш сад має дві експозиційні теплиці та кілька теплих і холодних теплиць, в яких ми зберігаємо найбільшу частину нашої колекції. Рослини переміщуються до експозиції під час цвітіння і повертаються в "сховище", коли менш цікаві для експозиції. Для кожної рослини в нашій колекції нам потрібно знати його поточні розташування та історію рухів.

source: Planned action
es: Acción planificada
ko: 계획조치
uk: Плановані дії

source: The action starts by moving the plants around, and collecting the plant code either on paper, or in our mobile app, if we had one.
es: Esta acción empieza al mover físicamente las plantas en el jardín, anotando el código de la planta o en papel, o en nuestra aplicación móvil, si tuviéramos una.
ko: 이 작업은 식물들을 이리저리 옮겨놓고 종이로 혹은 모바일 앱으로 식물 코드를 수집하는 것으로 시작됩니다.
uk: Дія починається з переміщення рослин навколо та збирання коду рослин на папері або у нашому мобільному додатку, якщо така була.

source: We then go to the desktop terminal and revise all plants one by one changing their location in the database. It is important that the date of the location change is correctly memorized, because this tells us how long a plant stays in the exposition.
es: A continuación, vamos a la terminal de escritorio y revisamos todas las plantas una por una, poniendo al día su ubicación en la base de datos. Es importante que la fecha del cambio de ubicación esté memorizada correctamente, porque esto nos dice cuánto tiempo una planta se queda en la exposición.
ko: 그런 다음 데스크톱 터미널로 이동하여 데이터베이스에서 위치를 변경하는 모든 공장을 하나씩 수정합니다. 위치 변경 날짜를 정확하게 기억하는 것이 중요합니다. 이는 식물이 박람회에 머무는 기간을 알려주기 때문입니다.
uk: Потім ми переходимо на настільний термінал і переглядаємо всі рослини по черзі, змінюючи їх розташування в базі даних. Важливо, щоб дата зміни місцезнаходження була правильно збережена, оскільки це говорить нам, як довго рослина залишається в експозиції.

source: If we had a mobile app, we would just upload the info to the server and we would be done.
es: Teniendo esa aplicación móvil, sólo sería cargar la información en el servidor y ya estaríamos.
ko: 모바일 앱이 있다면 서버에 정보를 업로드하면 끝납니다.
uk: Якщо б ми мали мобільний додаток, ми просто завантажили би інформацію на сервер, і ми зробимо це.

source: Ex-post correction
es: Corrección ex-post
ko: 전후수정
uk: Фактична корекція

source: While revising the garden, we find a plant at a location that is not what the database says. We update the database information.
es: Al revisar el jardín, encontramos una planta en un lugar que es no lo que dice la base de datos. Actualizamos la información de la base de datos.
ko: 정원을 수정하는 동안, 우리는 데이터베이스에 기록되지 않은 위치에 식물을 발견합니다. 데이터베이스 정보를 업데이트합니다.
uk: Під час перегляду саду ми знаходимо рослину в місці, де не базується база даних. Ми оновлюємо інформацію бази даних.

source: For example, the plant belonging to accession “012142”, species “*Acineta* sp”, was found in “Invernadero 1”, while the database says it is in “ICAlm3”.
es: Por ejemplo, la planta perteneciente a la accesión "012142", especies "*Acineta* sp", fue encontrado en "Invernadero 1", mientras que la base de datos dice que está en "ICAlm3".
ko: 예를 들어, "012142"에 속하는 식물인 "*아시네타*sp"는 "인버나데로 1"에서 발견되었고, 데이터베이스는 "ICLM3"에 있다고 말한다.
uk: Наприклад, рослини, що належить до приєднання “012142”, вид “*Acineta* sp” був знайдений в “Invernadero 1”, тоді як база даних говорить, що вона знаходиться в “ICAlm3”.

source: All we do is find the Plant in the database and update its information. We do not change anything in the initial Accession information, just the current Plant information.
es: Todo lo que hacemos es encontrar la planta en la base de datos y actualizar su información. No cambiamos nada en la accesión, el cambio sólo es relativo a la planta.
ko: 우리가 하는 일은 데이터베이스에서 플랜트를 찾고 정보를 업데이트하는 것뿐입니다. 우리는 초기 등록 정보에는 아무것도 변경하지 않고 단지 현재 플랜트 정보만 변경한다.
uk: Все, що ми робимо, це знаходимо рослину в базі даних та оновлюємо інформацію. Ми не змінюємо нічого в початковій інформації про приєднання, а саме про поточну інформацію про рослину.

source: We type the accession code in the search entry field, with quotes, hit enter. The search results now shows the accession, and it tells us how many plants belong to it. Click on the squared **+** in the results row, so we now also see a row for the plant belonging to the accession.
es: Escriba el código de accesión en el campo de búsqueda, entre comillas, y presione enter. Los resultados de la búsqueda ahora muestran la accesión, que nos informa cuantas plantas le pertenecen. Haga clic en el **+**, así que aparezcan en los resultados también las plantas pertenecentes a la accesión.
ko: 검색 항목 필드에 등록 코드를 입력합니다. 따옴표와 함께 입력됩니다. 이제 검색 결과는 등록 내용을 보여주며, 얼마나 많은 식물이 등록에 속하는지 알려줍니다. 결과 행에서 제곱 **+**를 클릭하면 이제 등록에 속하는 공장의 행도 표시됩니다.
uk: Ми вводимо код приєднання у поле вводу пошуку, з лапками, натискаємо Enter. Результати пошуку тепер показують приєднання, і це говорить нам, скільки рослин належить до нього. Натискаємо на квадраті **+** у рядку результатів, так що тепер ми також бачимо рядок для рослини, що належить до приєднання.

source: Right click on the Plant row, the three options will show: “Edit, Split, Delete”, select Edit, you land in the Plant Editor.
es: Clic derecho sobre la fila de la planta, aparecen las tres opciones: "Editar, dividir, borrar", seleccione Editar, se abre el Editor de planta.
ko: 그 식물을 맞아 클릭, 세 옵션:“편집, 갈라진, Delete”,, 당신은 발전소 편집기에 도착해서 편집을 보여 줄 것이다.
uk: Натисніть правою кнопкою миші на рядку рослина, з'являться три варіанти: Редагувати, Розділити, Видалити, виберіть Редагувати, ви потрапляєте в редактор рослин.

source: Just correct the Location field, and click on OK.
es: Sólo corregir el campo Ubicación y haga clic en Aceptar.
ko: 위치 필드를 수정한 후 [확인]을 클릭합니다.
uk: Просто скопіюйте поле розташування та натисніть OK.

source: The InfoBox contains information about the last change to the object:
es: El InfoBox contiene información sobre el último cambio en el objeto:
ko: InfoBox에는 개체의 마지막 변경 사항에 대한 정보가 포함되어 있습니다:
uk: InfoBox містить інформацію про останню зміну об'єкта:

source: For plants, even more interesting, it builds a history of changes, list that includes Location changes, or Quantity changes.
es: Para las plantas, aún más interesante, se construye una historia de los cambios, una lista que incluye cambios de ubicación, o cambios de cantidad.
ko: 식물의 경우, 더욱 흥미로운 점은 위치 변경 또는 수량 변경이 포함된 변경 내역, 목록을 작성합니다.
uk: Для рослин, ще цікавіше, він створює історію змін, список яких включає в себе зміни місцезнаходження або кількість змін.

source: As plants enter the flowering stage, we can review their identification directly, or we take pictures of details of the flower, hoping that a visiting specialist could help completing the identification.
es: Como las plantas entrarán a la etapa de floración, podemos revisar su identificación directamente, o podemos tomar fotografías de los detalles de la flor, con la esperanza que más luego un especialista visitante pueda completar la identificación.
ko: 식물이 개화기에 접어들면서 직접 신원 확인을 검토할 수도 있고, 방문 전문가가 신원 확인 완료에 도움이 될 수 있기를 바라며 자세한 꽃 사진을 찍을 수도 있다.
uk: Коли рослини виходять на етап цвітіння, ми можемо переглянути їх ідентифікацію безпосередньо, або ми робимо знімки деталей квітки, сподіваючись, що спеціаліст-відвідувач може допомогти завершити ідентифікацію.

source: Adding pictures
es: Fotos
it: Fotografie
ko: 사진 추가
uk: Додавання зображень

source: We are practicing with ODK Collect, a small program running on hand-held android devices. Ghini's use of ODK Collect hasn't yet frozen to a best practice. Do have a look at the `corresponding issue <https://github.com/Ghini/ghini.desktop/issues/243>`_ on github.
es: Estamos practicando con ODK Collect, un pequeño programa que se ejecuta en los dispositivos android. Todavía no identificamos una mejor práctica en el uso de ODK Collect. Eche un vistazo a la `issue correspondiente <https://github.com/Ghini/ghini.desktop/issues/243>`_ en github.
ko: 우리는 휴대용 안드로이드 기기에서 실행되는 작은 프로그램인 ODK Collect로 연습하고 있다. 기니의 ODK 콜렉트 사용은 아직 모범 사례로는 얼지 않았다. github의 해당 이슈 https://github.com/Ghini/ghini.desktop/issues/243를 살펴보십시오.
uk: Ми практикуємо з ODK Collect, невеликою програмою, що працює на ручних андроїдних пристроях. Використання Ghini у ODK Collect ще не заморожено до кращої практики. Погляньте на `відповідний випуск <https://github.com/Ghini/ghini.desktop/issues/243>`_ на github.

source: Regularly, we need producing reports about our collection that the Ecuadorian Environment Ministry (MAE) requires and that justify the very existence of the garden.
es: Regularmente, es necesario elaborar informes acerca de nuestra colección, informes que el Ministerio ecuatoriano de medio ambiente (MAE) exigen y que justifican la existencia misma del jardín.
ko: 정기적으로, 우리는 에콰도르 환경부(MAE)가 요구하고 정원의 존재를 정당화하는 우리의 수집품에 대한 보고서를 작성해야 한다.
uk: Регулярно нам потрібні звіти про нашу колекцію, які вимагає Міністерство екології Республіки Еквадор (MAE), і це виправдовує саме існування саду.

source: Producing reports
es: Producir informes
it: Generare relazioni
ko: 보고서 작성
uk: Створення звітів

source: Each year the botanic garden has to submit a report (annual report of management and maintenance of orchids collection) complying to the requirements of the Ecuadorian Ministry of the Environment.
es: Cada año el jardín botánico tiene que presentar un informe (informe anual de gestión) y el mantenimiento de la colección de orquídeas que cumpla con los requisitos del Ministerio ecuatoriano de medio ambiente.
ko: 매년 식물원은 에콰도르 환경부의 요구 사항을 준수하는 보고서(난초 수집 관리 및 유지에 대한 연례 보고서)를 제출해야 한다.
uk: Щороку ботанічний сад повинен подати доповідь (щорічний звіт про управління та підтримці колекції орхідей), що відповідає вимогам Міністерства навколишнього середовища Еквадору.

source: To this end, we start selecting the plants we have to include in the report. It might be all acquisition in the past year::
es: Para ello, partimos de seleccionar las plantas que tenemos que incluir en el informe. Podría ser toda accuisición en el año pasado::
ko: 이를 위해 보고서에 포함시켜야 할 식물을 선정하기 시작합니다. 이는 모두 지난 1년 동안의 취득일 수 있습니다:
uk: З цією метою ми починаємо вибирати рослини, які ми повинні включити до звіту. Це може бути все придбання в минулому році:

source: or all plants within a location, or all plants belonging to a species, or just everything (but this will take time)::
es: O todas las plantas dentro de una ubicación, o todas planta que pertenecen a una especie, o simplemente todo (pero esto tomará tiempo)::
ko: 한 장소에 있는 모든 식물, 한 종에 속하는 모든 식물, 또는 모든 것(그러나 이 작업은 시간이 걸린다::
uk: або всі рослини в межах місця, або всі рослини, що належать до певного виду, або просто все (але це займе час)::

source: Having selected the database objects which we want in the report, we start the report tool, which acts on the selection.
es: Habiendo seleccionado los objetos de base de datos que queremos en el informe, inicie la herramienta de informe, que actúa en la selección.
ko: 보고서에서 원하는 데이터베이스 개체를 선택한 후 선택 항목에 대해 작동하는 보고서 도구를 시작합니다.
uk: Вибравши у звіті об'єкти бази даних, ми запускаємо інструмент звітування, який діє на вибір.

source: Searching the database
es: Buscar en la base de datos
it: Ricerca nel database
ko: 데이터베이스 검색
uk: Пошук в базі даних

source: You search the database in order to edit the data further, or because you want to produce a report. Anyway you start with typing something in the search field
es: Puedes buscar en la base de datos con el fin de editar los datos, o porque se quiere producir un informe. De todos modos se empieza escribiendo algo en el campo de búsqueda
ko: 데이터를 추가로 편집하기 위해 또는 보고서를 작성하기 위해 데이터베이스를 검색합니다. 어쨌든 검색 필드에 무언가를 입력하는 것부터 시작합니다
uk: Ви шукаєте в базі даних, щоб змінити дані далі, або тому, що хочете створити звіт. Так чи інакше, ви починаєте щось набирати в полі пошуку

source: and you hope to see your result in the search result view.
es: y ojalá sus resultados aparezcan en el resultado de búsqueda.
ko: 검색 결과 보기에서 결과를 볼 수 있습니다.
uk: і ви сподіваєтеся побачити свій результат у представленні результатів пошуку.

source: Search in order to edit (plant or accession)
es: Búsqueda para editar (planta o accesión)
it: Ricerca al fine di modificare (pianta o accessione)
ko: 편집할 검색(플랜트 또는 등록)
uk: Пошук для редагування (рослина або приєднання)

source: When searching in order to edit, you want to be very specific, and select as few objects as possible. The most fine-tuned search is the one based on plant number: you know the code, you get one object.
es: Al buscar con el fin de editar, usted quiere ser muy específico, y seleccionar el número menor posible de objetos. La búsqueda más afinada es la basada en el número de la planta: se conoce el código, se obtiene un objeto.
ko: 편집하기 위해 검색할 때 매우 구체적이고 가능한 한 적은 수의 개체를 선택합니다. 가장 세밀하게 조정된 검색은 공장 번호를 기반으로 한 검색입니다. 코드를 알고 한 개체를 얻습니다.
uk: Під час пошуку для редагування ви хочете бути дуже конкретними та вибрати якомога менше об'єктів. Найточніший пошук на основі номера рослини: ви знаєте код, ви отримуєте один об'єкт.

source: If your plant is not there, the screen would look like this:
es: Si la planta no está allí, la pantalla tendrá este aspecto:
ko: 식물이 없는 경우 화면은 다음과 같습니다:
uk: Якщо вашої рослини там немає, екран виглядатиме так:

source: Other example, plant ``007701.1`` is in the database:
es: Otro ejemplo, la planta ``007701.1`` está en la base de datos:
ko: 다른 예로는 "007701 식물"가 있다.1개의 데이터가 데이터베이스에 있습니다:
uk: Інший приклад, в базі даних знаходиться рослина ``007701.1``:

source: All fields with a darker background in the infobox on the right hand side are hyperlinks to other objects in the database. Clicking on them will either replace the text in the search field and execute the query, or will simply add the object to the results.
es: Todos los campos con un fondo más oscuro en el infobox en la derecha son hipervínculos a otros objetos en la base de datos. Haciendo clic sobre uno de ellos tiene como efecto, ó el reemplazar el texto en el campo de búsqueda y ejecutar la nueva consulta ó simplemente agregar el objeto a los resultados.
ko: 오른쪽에 있는 정보 상자의 배경이 어두운 모든 필드는 데이터베이스의 다른 개체에 대한 하이퍼링크입니다. 이 옵션을 클릭하면 검색 필드의 텍스트가 대체되고 조회가 실행되거나 객체가 결과에 추가됩니다.
uk: Всі поля з більш темним фоном у інформаційній коробці з правого боку є гіперпосиланнями на інші об'єкти в базі даних. Натискання на них буде або замінити текст у полі пошуку і виконувати запит, або просто додавати об'єкт до результатів.

source: Clicking on the accession does the latter.
es: Hacer clic en la accesión hace el último.
ko: 등록 정보를 클릭하면 후자가 됩니다.
uk: Натискання на приєднання робить останній.

source: We now have both Plant or Accession in the search result view and we can now edit either or both.
es: Disponemos ahora de planta y accesión en la vista del resultado de búsqueda y podremos editar ambas.
ko: 이제 검색 결과 보기에 플랜트 또는 등록 둘 다 있고 둘 중 하나 또는 둘 다를 편집할 수 있습니다.
uk: Тепер у представленні результатів пошуку є як Рослина, так і Приєднання, і тепер ми можемо редагувати одне або обидва.

source: Search in order to report
es: Búsqueda para informes
it: Ricerca al fine di modificare (pianta o accessione)
ko: 보고할 검색
uk: Пошук з звітом

source: When searching in order to create a report, you want to be both specific (you don't want to report about irrelevant objects) and broad (you don't want to report about a single object).
es: Al buscar con el fin de crear un informe, se desea que la búsqueda sea específica (no quiere Informar sobre objetos irrelevantes) y amplia (que no quere informar sobre un solo objeto).
ko: 보고서를 만들기 위해 검색할 때 특정 개체(관련 없는 개체에 대해 보고하지 않으려는 경우)와 광범위한 개체(단일 개체에 대해 보고하지 않으려는 경우)를 모두 검색해야 합니다.
uk: Під час пошуку для створення звіту ви хочете бути одночасно певними (ви не хочете повідомляти про невідповідні об'єкти) та широкі (ви не хочете повідомляти про один об'єкт).

source: Sometimes the report itself suggests the query, as for example: all plants in greenhouse 3; or: all plants belonging to endangered species (we store this information in a note associated to the species); or: all plants added to the collection this year; ::
es: A veces el informe mismo sugiere la consulta correspondiente, como por ejemplo: todas las plantas en invernadero 3. o: todas las plantas pertenecientes a especies en peligro (almacenamos esta información en una nota asociada a la especie); o: todas las plantas que agregamos a la colección durante este año; ::
ko: 때때로 보고서 자체에서 예를 들어 온실 속의 모든 식물 3 또는 멸종 위기에 처한 종에 속하는 모든 식물(이 정보는 해당 종과 관련된 노트에 저장) 또는 다음과 같은 질문이 제시되기도 합니다::
uk: Іноді сама доповідь пропонує запит, як, наприклад: всі рослини в теплиці 3; або: всі рослини, що належать до зникаючих видів (ми зберігаємо цю інформацію у примітці, пов'язаної з цим видом); або: всі рослини додані до колекції цього року; ::

source: Otherwise a flexible way to achieve this is to work with **Tags**.
es: De lo contrario una manera flexible para lograr esto es trabajar con **etiquetas**.
ko: 그렇지 않은 경우 **Tag**로 작업하는 것이 유연한 방법입니다.
uk: Інший гнучкий спосіб досягти цього - працювати з **Тегами**.

source: Using **Tags** as enhanced searching
es: El uso de **Tags** como búsqueda mejorada
ko: **태그**를 향상된 검색으로 사용
uk: Використовуйте **Теги** як розширений пошук

source: Sometimes we have to take the same action on objects of the same type, but we don't manage to quickly think of a search query that would group all that we need and exclude all we do not need.
es: A veces queremos ejecutar la misma acción sobre objetos del mismo tipo, pero no podemos pensar rápidamente en una consulta que agrupe todo lo que necesitamos y deje por fuera lo que no necesitamos.
ko: 동일한 유형의 개체에 대해 동일한 작업을 수행해야 하는 경우도 있지만 필요한 모든 항목을 그룹화하고 필요하지 않은 모든 항목을 제외하는 검색 쿼리가 빠르게 생각나지 않습니다.
uk: Іноді ми повинні робити однакові дії для об'єктів одного типу, але нам не вдається швидко подумати про пошуковий запит, який буде групувати все, що нам потрібно, і виключити все, що нам не потрібне.

source: This is one possible use of **Tags**. We start with a selection, we tag all objects in the selection under a new temporary tag. Let's say we call it "temporary".
es: Se trata de un posible uso de los **Tag**. Comenzamos con una selección, y ponemos en un Tag temporal todos los objetos en la selección. Supongamos llamarlo "temporal".
ko: **태그**를 사용할 수 있습니다. 선택부터 시작하여 선택 영역의 모든 개체를 새 임시 태그 아래에 태그합니다. 우리가 그것을 "임시"라고 부릅시다.
uk: Це одне можливе використання **Тегів**. Почнемо з вибору, ми позначаємо всі об'єкти у виборі під новим тимчасовим тегом. Скажімо, ми називаємо це "тимчасовий".

source: We continue searching and adding objects to the temporary tag until the tag identifies all that we need.
es: Seguimos buscando y añadiendo objetos a la etiqueta temporal hasta que la etiqueta identifique todo lo que necesitamos.
ko: 태그가 필요한 모든 항목을 식별할 때까지 임시 태그에 개체를 계속 검색하고 추가합니다.
uk: Ми продовжуємо пошук і додавання об'єктів до тимчасового тегу, доки тег не визначить всього, що нам потрібно.

source: Finally from the Tags menu we select the one we just created (in our example this corresponds to the search ``tag="temporary"``) and we can invoke the report.
es: Finalmente en el menú de etiquetas seleccionamos el que acabamos de crear (en nuestro ejemplo corresponde a la búsqueda ``tag = "temporal"``) y podemos invocar el informe.
ko: 마지막으로 Tags 메뉴에서 방금 생성한 검색("tag="임시" 검색에 해당)을 선택하면 보고서를 호출할 수 있습니다.
uk: Нарешті, в меню Теги вибираємо той, який ми щойно створили (у нашому прикладі це відповідає пошуку ``tag = 'тимчасовий'``), і ми можемо викликати звіт.

source: When we're done with a temporary tag, there's no point in leaving it around, so we just delete it.
es: Terminado el trabajo con una etiqueta temporal, no hace falta quedarse con ella, así que simplemente la borramos.
ko: 임시 태그 작업이 끝나면 그냥 놔둬도 소용없으니까 삭제만 하면 됩니다.
uk: Коли ми закінчимо тимчасовий тег, немає сенсу залишити його надалі, тому ми просто видалимо його.

source: Be aware of the available search strategies
es: Conozca las estrategias de búsqueda
ko: 사용 가능한 검색 전략을 숙지합니다
uk: Будьте обізнані про наявні стратегії пошуку

source: This is nicely documented, "più non dimandare" and `read the docs <searching.html>`_.
es: Esto está muy bien documentado, "più non dimandare" y `lea la documentación <searching.html>`_.
ko: 이것은 "pi non non dimandare"와 "searching.html"이라는 훌륭한 문서이다
uk: Це добре документовано, "più non dimandare" і `read the docs <searching.html>`_.

source: Contributed recipes collection
es: Colección de recetas aportadas
ko: 기여 요리법 모음기여 요리법 모음
uk: Внесені рецепти колекції

source: This page presents lists of use cases. If you're looking for straight, practical information, you are at the right place. If you prefer a thorough presentation of the software and database structure, check the section `software for botanical gardens <goal.html#botanic-garden-software>`_
es: Esta página presenta listas de casos de uso. Si busca información práctica y directa, estás en el lugar correcto. Si prefiere una presentación exhaustiva de la estructura de la base de datos y led software, consulte la sección `software para jardines botánicos <goal.html#botanic-garden-software>`_
ko: 이 페이지에는 사용 사례 목록이 표시됩니다. 만약 당신이 솔직하고 실용적인 정보를 찾고 있다면, 당신은 올바른 장소에 있는 것입니다. 소프트웨어와 데이터베이스 구조의 철저한 프레젠테이션을 원하는 경우 식물원용 소프트웨어 <goal.html#botanic-garden-software> 섹션을 확인하십시오
uk: На цій сторінці представлені списки випадків використання. Якщо ви шукаєте пряму, практичну інформацію, ви знаходитесь у потрібному місці. Якщо ви віддаєте перевагу докладній презентації структури програмного забезпечення та бази даних, перегляньте розділ `програмне забезпечення для ботанічних садів <goal.html#botanic-garden-software>`_

source: All material here has been contributed by gardens using the software and sharing their experiences back to the user community.
es: Todo el material ha sido aportado por jardines usuarios del software y compartiendo sus experiencias con la comunidad de usuarios.
ko: 이곳의 모든 자료는 소프트웨어를 사용하고 사용자 커뮤니티에 그들의 경험을 공유하는 정원에 의해 기여되었다.
uk: Весь матеріал тут був внесений садами, використовуючи програмне забезпечення та обмін досвідом для користувачів.

source: The authors of the software wish to thank all dearly.
es: Los autores del software le agradecen de corazón.
ko: 그 소프트웨어의 저자들은 모두에게 진심으로 감사를 표하고 싶어한다.
uk: Автори програмного забезпечення хочуть всім щиро подякувати.

source: using ghini for a seed database
ko: 시드 데이터베이스에 기니 사용

source: We keep getting involved in groups focusing on endagered plant seeds. They want to note down when seeds come in, but also when they go out to people that order the seed.
ko: 우리는 멸종위기에 처한 식물 씨앗에 초점을 맞춘 그룹에 계속 참여하고 있습니다. 그들은 씨앗이 들어올 때, 그리고 씨앗을 주문하는 사람들에게 갈 때도 메모하기를 원합니다.
