Repository: Ghini/ghini.desktop-docs.i18n
Catalog: locale/*/LC_MESSAGES/doc.po
Languages: es, it, ko, uk

source: Ghini was born back in 2004 as Bauble, at the Belize Botanical Garden. It was later adapted to the needs of a few more gardens. Brett Adams, the original programmer, made this software a commons, by releasing it under a GPL license.
ko: 기니는 2004년 벨리즈 식물원에서 보블(Bauble)로 태어났다. 그것은 나중에 몇 개의 더 많은 정원의 필요에 적응되었다. 오리지널 프로그래머인 브렛 아담스는 GPL 라이선스로 이 소프트웨어를 출시함으로써 이 소프트웨어를 공동화했다.
uk: Ghini народився ще в 2004 році як Bauble, в Ботанічному саду Белізу. Пізніше вона була адаптована до потреб ще декількох садів. Оригінальний програміст Brett Adams зробив це програмне забезпечення загальним, випустивши його за ліцензією GPL.

source: After years of stagnation Mario Frasca revived the project, and rebranded it as Ghini in honour of Luca Ghini, founder of the first European botanic garden and herbarium. Mario Frasca started advocating, travelling, distributing, developing, expanding, redefining, documenting it, and it is now Mario Frasca writing this, looking for users, requesting feedback.
ko: 몇 년간의 침체 후에 마리오 프라스카는 이 프로젝트를 부활시켰고, 최초의 유럽 식물 정원과 허바륨의 설립자인 루카 기니를 기념하여 기니로 개명했다. Mario Frasca는 이것을 지지하고, 여행하고, 배포하고, 개발하고, 확장하고, 재정의하고, 문서화하기 시작했습니다. 그리고 지금은 Mario Frasca가 이것을 쓰고, 사용자를 찾고, 피드백을 요청하고 있습니다.
uk: Після багатьох років застою Mario Frasca відновив цей проект і назвав його як Ghini на честь Luca Ghini, засновника першого європейського ботанічного саду та гербарію. Mario Frasca почав захищати, подорожувати, розповсюджувати, розвивати, розширювати, перевизначати, документувати, і зараз Mario Frasca це написав, шукаючи користувачів, з проханням зворотного зв'язку.

source: Behind Ghini there's not only one developer, but a small but growing global users community.
it: Quindi attualmente dietro Ghini c'è molto di più che solo uno sviluppatore, c'è una piccola ma crescente comunità globale di utenti.
ko: 기니 뒤에는 개발자가 한 명뿐 아니라, 작지만 성장하는 글로벌 사용자 커뮤니티가 있습니다.
uk: Отже, зараз на Ghini не один розробник, але невелика, але зростаюча глобальна спільнота користувачів.

source: Translations are provided by volunteers who mostly stay behind the scenes, translating missing terms or sentences, and disappearing again.
ko: 번역은 대부분 뒤에 남아 누락된 용어나 문장을 번역한 뒤 다시 사라지는 자원봉사자들에 의해 제공된다.
uk: Переклади надаються добровольцями, які в більшості своїй залишаються поза сценами, перекладаючи відсутні терміни або пропозиції, і знову зникають.

source: To make things clearer when we speak of Ghini, but should—and in this document we will—indicate whether it's Ghini(the software), or Ghini(the people), unless obviously we mean both things.
es: Para que sea más claro cuando hablamos de Ghini, deberíamos —y lo hacemos en este documento— indicar si estamos indicando a Ghini(el software), o a Ghini(la gente), a menos que obviamente nos referimos a ambas cosas.
it: Per rendere le cose più chiare quando si parla di Ghini, è bene indicare se si tratta di Ghini (il software), o Ghini (le persone), a meno che ovviamente non vogliamo indicare entrambe le cose.
ko: Ghini에 대해 말할 때 더 명확하게 할 수 있도록 하기 위해, 그리고 이 문서에서는 Ghini(소프트웨어)인지 Ghini(국민)인지, 두 가지 모두를 의미하지 않는 한 Ghini(국민)인지를 명시할 것입니다.
uk: Щоб зробити речі чіткішими, коли ми говоримо про Ghini, але ми повинні вказати, чи це Ghini (програмне забезпечення), або Ghini (люди), якщо, очевидно, ми не маємо на увазі обидві речі.

source: Mission
es: Misión
it: Missione
ko: 미션
uk: Місія

source: Our goal as Ghini Software is to provide free software, of proven quality, and to let anybody install it if they feel like it. We also aim at facilitating access to functional knowledge, in the form of documentation or by laying the contact among users or between users and software professionals.
ko: Ghini Software의 목표는 입증된 품질의 소프트웨어를 무료로 제공하고 누구나 원할 경우 소프트웨어를 설치할 수 있도록 하는 것입니다. 또한 문서 형태로 또는 사용자와 소프트웨어 전문가 사이에 연락을 취함으로써 기능적 지식에 대한 접근을 용이하게 하는 것을 목표로 한다.
uk: Наша мета, як Ghini Software, - забезпечити безкоштовне програмне забезпечення, що має перевірену якість, і дозволити кожному встановити його, якщо вони прагнуть цього. Ми також прагнемо полегшити доступ до функціональних знань у формі документації або шляхом встановлення контактів між користувачами або між користувачами та професіоналами програмного забезпечення.

source: All our sources, software and documentation, are open and free, and we welcome and stimulate people to use and to contribute. To facilitate community forming, all our platforms can be consulted without registration. Registration is obviously required if you want to contribute.
ko: 우리의 모든 소스, 소프트웨어 및 문서는 공개되고 무료이며, 우리는 사람들이 사용하고 기여하도록 환영하고 격려합니다. 커뮤니티 형성을 촉진하기 위해 등록 없이 모든 플랫폼을 참조할 수 있습니다. 기부를 원하시면 분명히 등록이 필요합니다.
uk: Усі наші джерела, програмне забезпечення та документація є відкритими та вільними, і ми вітаємо і стимулюємо людей використовувати та надавати свої послуги. Для полегшення формування спільноти, всі наші платформи можна протестувати без реєстрації. Реєстрація потрібна, якщо ви хочете внести свій внесок.

source: Ghini welcomes the formation of groups of users, bundling forces to define and finance further development, and we welcome developers contributing software, from any corner in the world, and we stimulate and help them comply with the high quality requirements, before we accept the contributed code in the software sources.
ko: Ghini는 추가 개발을 정의하고 자금을 조달하기 위해 사용자 그룹의 구성을 환영하며, 우리는 세계 어느 곳에서든 소프트웨어를 제공하는 개발자들을 환영하며, 소프트웨어 소스에서 기여 코드를 받아들이기 전에 그들이 고품질 요구 사항을 준수하도록 자극하고 도와준다.
uk: Ghini вітає формування груп користувачів, згрупування сил для визначення та фінансування подальшого розвитку, і ми вітаємо розробників, що надають програмне забезпечення, з будь-якого куточка світу, і ми стимулюємо та допомагаємо їм дотримуватися вимог високої якості, перш ніж ми приймемо внесок код у джерелах програмного забезпечення.

source: Vision
es: Visión
it: Visione
ko: 비전
uk: Бачення

source: The Vision serves to indicate the way ahead and projects a future image of what we want our organization to be, in a realistic and attractive way. It serves as motivation because it visualizes the challenge and direction of necessary changes in order to grow and prosper.
es: La visión es una afirmación, sirve para indicar el camino a seguir y proyecta una imagen futura de lo que queremos con nuestra organización, en una forma realista y atractiva. Sirve como motivación porque visualiza el desafío y la dirección de los cambios necesarios para crecer y prosperar.
it: La visione serve a indicare la strada da percorrere e proietta un'immagine futura di quello che vogliamo che la nostra organizzazione diventi, in modo realistico e attraente. Essa serve come motivazione perché visualizza la sfida e la direzione delle modifiche necessarie per crescere e prosperare.
ko: Vision은 앞으로 나아갈 방향을 제시하는 역할을 하며, 조직이 어떻게 되기를 원하는지에 대한 미래 이미지를 사실적이고 매력적인 방식으로 투영합니다. 성장과 번영을 위해 필요한 변화의 도전과 방향을 시각화하기 때문에 동기부여의 역할을 한다.
uk: Бачення служить для позначення майбутнього реалістичного та привабливого способу майбутнього іміджу того, що хочемо ми, наша організація. Вона слугує мотивацією, оскільки вона візуалізує виклик і напрямок необхідних змін, щоб рости і процвітати.

source: by the year 2020
es: en el año 2020
it: entro il 2020
ko: 2020년까지
uk: до 2020 року

source: reference point
es: punto de referencia
it: segno di riferimento
ko: 기준점
uk: контрольна точка

source: community
es: comunidad
it: comunità
ko: 공동체의
uk: спільнота

source: development
es: desarrollo
it: sviluppo
ko: 개발
uk: розвиток

source: integration with web portal
es: integración con portal web
it: integrazione con il portale web
ko: 웹 포털과의 통합
uk: інтеграція з веб-порталом

source: geographic information
es: información geográfica
it: informazioni geografiche
ko: 지리 정보
uk: географічна інформація

source: Tagging
it: Etichette
ko: 태그 지정
uk: Тегування

source: Tagging is an easy way to give context to an object or create a collection of object that you want to recall later.
ko: 태그 지정은 개체에 컨텍스트를 제공하거나 나중에 호출할 개체 컬렉션을 만들 수 있는 쉬운 방법입니다.
uk: Тегування - це простий спосіб надати контекст об'єкту або створити колекцію об'єктів, які ви хочете згадати пізніше.

source: The power in this tagging action is that you can share this selection with colleagues, who can act on it, without the need to redo all your collecting work.
ko: 이 태그 지정 동작의 장점은 모든 수집 작업을 다시 실행할 필요 없이 이 선택 항목을 작업할 수 있는 동료와 공유할 수 있다는 것입니다.
uk: Потужність цієї дії з тегами полягає в тому, що ви можете поділитися цим вибором із колегами, які можуть діяти на ньому, без необхідності повторювати всю вашу колективну роботу.

source: For example if you need to print accession labels of otherwise unrelated plants, you can group the objects by tagging them with the string "relabel". You or one of your colleagues can then select "relabel" from the tags menu, the search view will show all the objects you tagged, and performing a report will act on the tagged objects.
ko: 예를 들어 다른 관련 없는 식물의 등록 레이블을 인쇄해야 하는 경우 개체를 "relabel" 문자열로 태그하여 그룹화할 수 있습니다. 그런 다음 사용자 또는 동료 중 한 명이 태그 메뉴에서 "릴레이블"을 선택하고 검색 뷰에 태그가 지정된 모든 개체가 표시되고 보고서를 수행하면 태그가 지정된 개체에 적용됩니다.
uk: Наприклад, якщо вам потрібно надрукувати прикріплені етикетки інших не пов'язаних рослин, ви можете об'єднати об'єкти, позначивши їх рядком "relabel". Ви або один з ваших колег може вибрати "relabel" з меню тегів, у вікні пошуку відображатимуться всі об'єкти, які ви позначили, а виконання звіту буде діяти на позначених об'єктах.

source: Tagging acts on the active selection, that is the items in the search results which you have selected.
ko: 태그 지정은 선택한 검색 결과의 항목인 활성 선택 항목에 적용됩니다.
uk: Позначення діє на активний вибір, тобто елементи в результатах пошуку, які ви вибрали.

source: Please remember: you can select all result rows by pressing ``Ctrl-A``, you can deselect everything by pressing ``Ctrl-Shift-A``, you can toggle tagging of a single row by ``Ctrl-Mouse click`` on it.
ko: 기억하십시오. "Ctrl-A"를 눌러 모든 결과 행을 선택할 수 있고, "Ctrl-Shift-A"를 눌러 모든 항목을 선택 취소할 수 있으며, 단일 행에 "Ctrl-Mouse 클릭"을 눌러 단일 행의 태그를 전환할 수 있습니다.
uk: Будь ласка, пам'ятайте: ви можете вибрати всі рядки результатів, натиснувши ``Ctrl-A``, ви можете скасувати вибір, натиснувши ``Ctrl-Shift-A``, ви можете змінити позначення одного рядка за допомогою ``Ctrl-Клік мишкою `на ньому.

source: Once you have an active selection, tagging can be done in two ways:
ko: 활성 선택을 한 후에는 다음 두 가지 방법으로 태그 지정을 수행할 수 있습니다:
uk: Після активного вибору, тегування може здійснюватися двома способами:

source: dialog box tagging
ko: 대화 상자 태그 지정
uk: діалогове вікно тегування

source: Press ``Ctrl-T`` or select :menuselection:`Tag-->Tag Selection` from the menu, this activates a window where you can create new tags and apply any existing tag to the selection.
ko: ''Ctrl-T''를 누르거나 다음을 선택합니다. 메뉴 선택:메뉴에서 'Tag-->Tag Selection'을 선택하면 새 태그를 생성하고 기존 태그를 선택 항목에 적용할 수 있는 창이 활성화됩니다.
uk: Натисніть клавішу ``Ctrl-T`` або виберіть :menuselection:`Tag-->Tag Selection` з меню, це активує вікно, в якому ви можете створювати нові теги і застосовувати будь-який існуючий тег до вибору.

source: The tag window is composed of three parts:
ko: 태그 창은 세 부분으로 구성됩니다:
uk: Вікно тегів складається з трьох частин:

source: The upper part mentions the list of objects in your active selection. This is the list of object of which you are editing the tags;
ko: 위쪽에는 활성 선택 항목에 있는 개체 목록이 나와 있습니다. 태그를 편집하는 개체 목록입니다;
uk: У верхній частині згадується список об'єктів у вашому активному виборі. Це список об'єкта, якому ви редагуєте теги;

source: The middle part has a list of all available tags, with a checkbox that you can activate for applying the tag to or removing the tag from the selection;
ko: 중간 부분에는 사용 가능한 모든 태그 목록이 있으며 선택 영역에 태그를 적용하거나 선택 항목에서 태그를 제거하기 위해 활성화할 수 있는 확인란이 있습니다;
uk: У середній частині є список всіх доступних тегів, а також прапорець, який ви можете активувати для застосування тегу або вилучення тегу з вибору;

source: The lower part only holds a link to new tag creation, and the Ok button for closing the dialog box.
ko: 아래쪽에는 새 태그 생성 링크와 대화 상자를 닫는 확인 단추만 있습니다.
uk: Нижня частина містить лише посилання на створення нового тегу, а кнопка ОК для закриття діалогового вікна.

source: If, when opening the tag dialog box, the active selection holds multiple items, then only the tags that are common to all the selected items will have a check next to it. Tags that only apply to a proper subset of the active selection will show with an 'undecided' status. Tags that don't apply to any object in the active selection will show blank.
ko: 태그 대화 상자를 열 때 활성 선택 항목에 여러 항목이 있는 경우 선택한 모든 항목에 공통인 태그만 옆에 체크 표시가 있습니다. 활성 선택 영역의 적절한 하위 집합에만 적용되는 태그는 '미결정' 상태로 표시됩니다. 활성 선택 영역의 개체에 적용되지 않는 태그는 공백으로 표시됩니다.
uk: Якщо, відкриваючи діалогове вікно тегу, активний вибір містить кілька елементів, тоді біля нього буде встановлено лише теги, які є загальними для всіх вибраних елементів. Теги, які застосовуються лише до відповідної підмножини активного вибору, відображатимуться з статусом 'не визначено'. Теги, які не застосовуються до жодного об'єкта в активному виборі, будуть відображатися пустими.

source: The most recently created tag, or the most recently selected tag becomes the active tag, and it shows with a check next to it in the tags menu.
ko: 가장 최근에 생성된 태그 또는 가장 최근에 선택한 태그가 활성 태그가 되고 태그 메뉴에서 해당 태그 옆에 확인 표시가 나타납니다.
uk: Нещодавно створений тег або найновіший вибраний тег стає активним тегом, і він з'являється з позначкою поруч із ним в меню тегів.

source: windowless tagging
ko: 창 없는 태그 지정
uk: тегування без вікна

source: Once you have an active tag, pressing ``Ctrl-Y`` applies the active tag to all objects in the active selection. ``Ctrl-Shift-Y`` removes the active tag from all objects in the active selection.
ko: 활성 태그가 있으면 ''Ctrl-Y''를 누르면 활성 태그가 활성 선택 영역의 모든 개체에 적용됩니다. "Ctrl-Shift-Y"는 활성 선택 영역의 모든 개체에서 활성 태그를 제거합니다.
uk: Після того як у вас є активна тег, натискання клавіші `` Ctrl-Y`` застосовує активний тег до всіх об'єктів активного вибору. `Ctrl-Shift-Y`` видаляє активний тег з усіх об'єктів у активному виділенні.

source: Template Letters
ko: 템플릿 문자

source: The reader getting to this point in the documentation probably understood that this Ghini project is above all a very open and collaborative project.
ko: 문서에서 이 점에 도달한 독자들은 이 기니 프로젝트가 무엇보다도 매우 개방적이고 협력적인 프로젝트라는 것을 이해했을 것이다.

source: Here in this page you find some template letters, used to welcome new users, or that you can correct, print, and go with it to a garden, and propose them to adopt Ghini, or share with a group of your local friends, so you can make Ghini become a (voluntary, or paid) part-time job for you.
ko: 이 페이지에는 새로운 사용자를 환영하는 데 사용되는 템플릿 문자가 있습니다. 또는 수정, 인쇄 및 정원으로 이동하여 기니를 입양하거나 지역 친구들과 공유하도록 제안할 수 있습니다. 그러면 기니가 여러분에게 (자발적 또는 유료) 아르바이트가 될 수 있습니다.

source: Dear conservator or scientist,
ko: 친애하는 보수주의자 또는 과학자에게,

source: You are reading Ghini's presentation letter. Ghini is a libre software project on GitHub, focusing on botany. Brought to you by a small community of coders, botanists, translators, and supported by a few institutions around the world, among which, gardens that have adopted it for all their collection management needs.
ko: 당신은 기니의 발표 편지를 읽고 있습니다. Ghini는 식물학에 초점을 둔 GitHub의 libre 소프트웨어 프로젝트이다. 코드 제작자, 식물학자, 번역가들로 구성된 소규모 커뮤니티가 여러분을 모았습니다. 그리고 전 세계 몇몇 기관들의 지원을 받았습니다. 그 중 모든 수집 관리에 필요한 정원이었습니다.

source: The Ghini family is a software suite composed of standalone programs, data servers and handheld clients, for data management, and publication:
ko: Ghini 제품군은 독립 실행형 프로그램, 데이터 서버 및 핸드헬드 클라이언트, 데이터 관리 및 퍼블리싱을 위한 소프트웨어 제품군입니다:

source: Ghini's core, ``ghini.desktop``, lets you
ko: 기니의 핵심인 ''기니.데스크톱''이 당신을 있게 한다

source: enter and correct your data
ko: 데이터 입력 및 수정

source: navigate its links,
ko: 링크를 탐색합니다,

source: produce reports
ko: 보고서를 작성하다

source: import and or export using several standard or ad-hoc formats
ko: 여러 표준 또는 임시 형식을 사용하여 가져오기 또는 내보내기

source: review your taxonomy using online sources
ko: 온라인 소스를 사용하여 분류법 검토

source: all according best practices suggested by top gardens, formalized in standard formats like ABCD, ITF2, but also as elaborated by our developers, based on the feedback of Ghini users.
ko: 상위 정원에 의해 제안된 모범 사례에 따라, ABCD, ITF2와 같은 표준 형식으로 공식화되었지만, 또한 Ghini 사용자의 피드백을 기반으로 개발자들에 의해 상세하게 설명되었다.

source: ``ghini.desktop`` is developed and continously tested on GNU/Linux, but runs equally well on Windows, or OSX. [1]
ko: "ghini.desktop"은 GNU/Linux에서 지속적으로 개발되고 테스트되지만 Windows 또는 OSX에서도 동일하게 잘 실행됩니다. [1]

source: ``ghini.pocket`` is your full time garden companion, an Android app installed from the Play Store,
ko: ''기니''포켓은 플레이스토어에서 설치한 안드로이드 앱인 풀타임 가든의 동반자입니다,

source: assisting you in collecting or correcting data while in the field,
ko: 현장에서 데이터를 수집하거나 수정하는 데 도움을 줍니다,

source: associate pictures to your plants, and verify taxonomic information.
ko: 그림을 식물에 연결하고 분류학적 정보를 확인합니다.

source: Import your collected data into the desktop client when back in the office,
ko: 그림을 식물에 연결하고 분류학적 정보를 확인합니다.사무실에 돌아와서 수집한 데이터를 데스크톱 클라이언트로 가져오십시오,

source: ``ghini.pocket`` reduces the time spent in front of your desktop PC to a true minimum.
ko: ''기니''포켓은 데스크탑 PC 앞에서 보내는 시간을 최소한으로 줄여줍니다.

source: ``ghini.web`` is a web server and a courtesy data hub service, offering you world wide visibility: Export a selection of your data from your desktop database, and handle it for publication to the Ghini project, and we will include it at http://gardens.ghini.me/, at no cost while we're able to do that, or for a guaranteed minimal amount of time if you are able to support our hosting costs. ``ghini.web`` serves a world map to help locate participating gardens, and within each garden, its contributed georeferenced plants.
ko: ''기니''웹캠은 웹 서버이자 데이터 허브 서비스로, 전 세계에 걸친 가시성을 제공합니다. 데스크톱 데이터베이스에서 선택한 데이터를 내보낸 후 Ghini 프로젝트에 게시할 수 있도록 처리하면, http://gardens.ghini.me/,에 무료로 포함시킬 수 있으며, 호스팅 비용을 지원할 수 있다면 최소한의 시간만 보장해 드립니다. ''기니''webt는 참여하는 정원의 위치를 찾는 데 도움을 주는 세계 지도를 제공하며, 각 정원 내에는 그것의 기여된 지리 참조식물이 있다.

source: ``ghini.tour``, a geographic tour Android app aimed at visitors, using OpenStreetMap as a base map, retrieving its data, gardens and virtual panels, from the web data aggregator ``ghini.web``.
ko: ''기니'''투어'는 오픈스트리트맵을 베이스맵으로 사용하여 웹 데이터 수집기 "기니"에서 데이터, 정원 및 가상 패널을 검색해 방문자를 겨냥한 지리 관광용 안드로이드 앱이다.거미줄 치기 시작하다

source: All software within the Ghini family is either licensed GNU Public License v2+ or v3+. It is a strong copyleft license. In short, the GPL translates the ethical scientific need to share knowledge, into legal terms. If you want to read more about it, please refer to https://www.gnu.org/licenses/copyleft.html
ko: Ghini 제품군의 모든 소프트웨어는 GNU 공용 라이센스 v2+ 또는 v3+로 라이센스가 부여된다. 그것은 강력한 카피레프트 라이선스이다. 간단히 말해서, GPL은 지식을 공유하기 위한 윤리적 과학적 필요성을 법률 용어로 번역한다. 자세한 내용은 https://www.gnu.org/licenses/copyleft.html를 참조하십시오

source: Ghini's idea about knowledge and software ownership is that software is procedural knowledge and as such, should be made a "commons": With software as a commons, "libre software" and more specifically "Copylefted software", you not only get the source code, you receive the right to adapt it, and the invitation to study and learn from it, and to share it, both share forward to colleagues, and share back to the source. With proprietary software, you are buying your own ignorance, and with that, your dependency.
ko: 지식과 소프트웨어 소유에 대한 기니의 생각은 소프트웨어가 절차적 지식이며, 따라서 다음과 같은 "공통"이 되어야 한다는 것이다. 소프트웨어를 공통으로 사용하는 "libre software"와 보다 구체적으로 "copyleft software"를 사용하면 소스 코드뿐만 아니라 소스 코드를 조정할 수 있으며, 소스 코드로부터 공부하고 학습할 수 있는 초대장을 받고, 이를 공유하여 동료에게 전달하며, 소스로 다시 공유할 수 있습니다. 독점 소프트웨어를 사용하면 자신의 무지와 의존성을 살 수 있습니다.

source: This fancy term "copyleft" instead of just "libre software", means the software you received is libre software with one extra freedom, guaranteeing every right you were granted upon receiving the software is never lost.
ko: 단순히 "libre software"가 아니라 "copyleft"라는 이 화려한 용어는 당신이 받은 소프트웨어는 하나의 여분의 자유를 가진 libre software를 의미하며, 당신이 소프트웨어를 받았을 때 부여받은 모든 권리는 절대 상실되지 않는다는 것을 보증한다.

source: With copylefted software you are free —actually welcome— to employ local software developers in your neighbourhood to alter the software according to your needs, please do this on GitHub, fork the code, develop just as openly as the common practice within Ghini, and whenever you want, open a pull request so your edits can be considered for inclusion in the main branch. Ghini is mostly continuously unit tested, so before your code is added to the main branch, it should follow our quality guidelines for contributions. With libre software you acquire freedom and contribute to it, something that earns you visibility: Your additions stays yours, you share them back to the community, and will see them completed and made better by others. Having your code added to the main branch simplifies your upgrade procedure.
ko: 무료 카피레프트 소프트웨어를 사용하면 지역 소프트웨어 개발자를 고용하여 필요에 따라 소프트웨어를 변경하고, 코드를 포크 처리하며, Ghini 내의 일반적인 관행처럼 공개 개발하며, 원할 때마다 꺼내기 요청을 열어 편집 내용을 포함시킬 수 있습니다.본점에서 n. 기니는 대부분 지속적으로 유닛 테스트를 거쳤기 때문에 코드를 본점에 추가하기 전에 기여에 대한 당사의 품질 지침을 따라야 합니다. libre 소프트웨어를 사용하면 자유를 얻을 수 있고, 이를 통해 가시성을 얻을 수 있습니다. 추가 기능은 그대로 유지되고 커뮤니티에 공유되며, 다른 사용자가 추가 기능을 완료하고 더 나은 기능을 제공하는 것을 볼 수 있습니다. 기본 분기에 코드를 추가하면 업그레이드 절차가 간단해집니다.

source: You can also contribute to the software by helping translate it into your native language. [5]
ko: 또한 소프트웨어를 모국어로 변환하는 데 도움을 주어 소프트웨어에 기여할 수도 있습니다. [5]

source: Some videos are published on YouTube, highlighting some of the software capabilities. [6]
ko: 일부 비디오는 YouTube에 게시되어 소프트웨어 기능 중 일부를 강조합니다. [6]

source: Share back with the community. Several developers have spent cumulatively many thousand hours developing this software, and we're sharing with the community. We hope by this to stimulate a community sentiment in whoever starts using what we have produced.
ko: 커뮤니티와 다시 공유하십시오. 몇몇 개발자들이 이 소프트웨어를 개발하는 데 수천 시간을 소비했고, 우리는 커뮤니티와 공유하고 있습니다. 우리는 이것을 통해 우리가 생산한 것을 사용하기 시작하는 누구에게나 지역 사회의 감정을 자극하기를 바란다.

source: Thanks for your consideration; please let me know if you have any questions,
ko: 고려해 주셔서 감사합니다. 질문이 있으시면 말씀해주세요,

source: In case you're interested in publishing your tree collection on the net, I would be happy to include your plants, species, coordinates to http://gardens.ghini.me. Georeferenced textual information panels are also very welcome, all offered as a courtesy: We're still defining the offer. The idea behind this is allowing visitors to explore aggregated garden collections, and the current focus is on trees.
ko: 만약 당신이 당신의 나무 컬렉션을 인터넷에 게시하고 싶다면, 저는 당신의 식물, 종, 좌표를 http://gardens.ghini.me에 기꺼이 포함시키겠습니다. 지역 참조 텍스트 정보 패널도 모두 호의로 제공됩니다. 우리는 여전히 그 제안을 정의하고 있다. 이면의 아이디어는 방문객들이 집적된 정원 컬렉션을 탐험할 수 있도록 하는 것이고, 현재 초점은 나무입니다.

source: A small example: http://gardens.ghini.me/#garden=Jardín%20el%20Cuchubo
ko: 작은 예: http://gardens.ghini.me/#garden=Jardin%20el%20쿠추보

source: Mario Frasca MSc
ko: 마리오 프라스카 MS

source: [1] http://ghini.readthedocs.io/ - http://ghini.github.io/
ko: [1] http://ghini.readthedocs.io/ - http://ghini.github.io/ - http://ghini.github.io/

source: [5] https://hosted.weblate.org/projects/ghini/#languages
ko: [5] https://hosted.weblate.org/projects/ghini/#contracts

source: free botanic data management systems
ko: 무료 식물 데이터 관리 시스템

source: Many institutions still consider software an investment, an asset that is not to be shared with others, as if it was some economic good that can't be duplicated, like gold.
ko: 많은 기관들은 여전히 소프트웨어를 투자, 즉 다른 기관과 공유해서는 안 되는 자산으로 생각하고 있는데, 마치 금과 같이 중복될 수 없는 경제적 이익인 것처럼 생각하고 있다.

source: As of right now, very few copylefted programs exist for botanic data management:
ko: 현재 식물성 데이터 관리를 위한 복사된 프로그램은 거의 없습니다:
